
*** Dumping AST Record Layout
         0 | class std::exception
         0 |   (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::type_info
         0 |   (type_info vtable pointer)
         8 |   const char * __name
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::bad_alloc
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__exception_ptr::exception_ptr
         0 |   void * _M_exception_object
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::nested_exception
         0 |   (nested_exception vtable pointer)
         8 |   class std::__exception_ptr::exception_ptr _M_ptr
         8 |     void * _M_exception_object
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __locale_struct
         0 |   struct __locale_data *[13] __locales
       104 |   const unsigned short * __ctype_b
       112 |   const int * __ctype_tolower
       120 |   const int * __ctype_toupper
       128 |   const char *[13] __names
           | [sizeof=232, dsize=232, align=8,
           |  nvsize=232, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __va_list_tag
         0 |   unsigned int gp_offset
         4 |   unsigned int fp_offset
         8 |   void * overflow_arg_area
        16 |   void * reg_save_area
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __cancel_jmp_buf_tag
         0 |   __jmp_buf __cancel_jmp_buf
        64 |   int __mask_was_saved
           | [sizeof=72, dsize=72, align=8,
           |  nvsize=72, nvalign=8]

*** Dumping AST Record Layout
         0 | __sigset_t
         0 |   unsigned long[16] __val
           | [sizeof=128, dsize=128, align=8,
           |  nvsize=128, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __jmp_buf_tag
         0 |   __jmp_buf __jmpbuf
        64 |   int __mask_was_saved
        72 |   __sigset_t __saved_mask
        72 |     unsigned long[16] __val
           | [sizeof=200, dsize=200, align=8,
           |  nvsize=200, nvalign=8]

*** Dumping AST Record Layout
         0 | union pthread_attr_t
         0 |   char[56] __size
         0 |   long __align
           | [sizeof=56, dsize=56, align=8,
           |  nvsize=56, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_internal_list
         0 |   struct __pthread_internal_list * __prev
         8 |   struct __pthread_internal_list * __next
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_mutex_s
         0 |   int __lock
         4 |   unsigned int __count
         8 |   int __owner
        12 |   unsigned int __nusers
        16 |   int __kind
        20 |   short __spins
        22 |   short __elision
        24 |   struct __pthread_internal_list __list
        24 |     struct __pthread_internal_list * __prev
        32 |     struct __pthread_internal_list * __next
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_mutex_t
         0 |   struct __pthread_mutex_s __data
         0 |     int __lock
         4 |     unsigned int __count
         8 |     int __owner
        12 |     unsigned int __nusers
        16 |     int __kind
        20 |     short __spins
        22 |     short __elision
        24 |     struct __pthread_internal_list __list
        24 |       struct __pthread_internal_list * __prev
        32 |       struct __pthread_internal_list * __next
         0 |   char[40] __size
         0 |   long __align
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_mutexattr_t
         0 |   char[4] __size
         0 |   int __align
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct timespec
         0 |   __time_t tv_sec
         8 |   __syscall_slong_t tv_nsec
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3)
         0 |   unsigned int __low
         4 |   unsigned int __high
           | [sizeof=8, dsize=8, align=4,
           |  nvsize=8, nvalign=4]

*** Dumping AST Record Layout
         0 | __atomic_wide_counter
         0 |   unsigned long long __value64
         0 |   struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         0 |     unsigned int __low
         4 |     unsigned int __high
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct __pthread_cond_s
         0 |   __atomic_wide_counter __wseq
         0 |     unsigned long long __value64
         0 |     struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         0 |       unsigned int __low
         4 |       unsigned int __high
         8 |   __atomic_wide_counter __g1_start
         8 |     unsigned long long __value64
         8 |     struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         8 |       unsigned int __low
        12 |       unsigned int __high
        16 |   unsigned int[2] __g_refs
        24 |   unsigned int[2] __g_size
        32 |   unsigned int __g1_orig_size
        36 |   unsigned int __wrefs
        40 |   unsigned int[2] __g_signals
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | pthread_cond_t
         0 |   struct __pthread_cond_s __data
         0 |     __atomic_wide_counter __wseq
         0 |       unsigned long long __value64
         0 |       struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         0 |         unsigned int __low
         4 |         unsigned int __high
         8 |     __atomic_wide_counter __g1_start
         8 |       unsigned long long __value64
         8 |       struct __atomic_wide_counter::(unnamed at /usr/include/x86_64-linux-gnu/bits/atomic_wide_counter.h:28:3) __value32
         8 |         unsigned int __low
        12 |         unsigned int __high
        16 |     unsigned int[2] __g_refs
        24 |     unsigned int[2] __g_size
        32 |     unsigned int __g1_orig_size
        36 |     unsigned int __wrefs
        40 |     unsigned int[2] __g_signals
         0 |   char[48] __size
         0 |   long long __align
           | [sizeof=48, dsize=48, align=8,
           |  nvsize=48, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::binary_function<const volatile void *, const volatile void *, _Bool> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::greater<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::greater_equal<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less_equal<const volatile void *> (empty)
         0 |   struct std::binary_function<const volatile void *, const volatile void *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::piecewise_construct_t (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_less_val (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Val_less_iter (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_equal_to_iter (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct __gnu_cxx::__ops::_Iter_equal_to_val (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<void> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::input_iterator_tag (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::forward_iterator_tag (empty)
         0 |   struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::__false_type (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | ldiv_t
         0 |   long quot
         8 |   long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | lldiv_t
         0 |   long long quot
         8 |   long long rem
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<char> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char> (empty)
         0 |   class std::__new_allocator<char> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char>::_Alloc_hider
         0 |   class std::allocator<char> (base) (empty)
         0 |     class std::__new_allocator<char> (base) (empty)
         0 |   std::basic_string<char>::pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/basic_string.h:215:7)
         0 |   char[16] _M_local_buf
         0 |   std::basic_string<char>::size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char>
         0 |   struct std::basic_string<char>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char> (base) (empty)
         0 |       class std::__new_allocator<char> (base) (empty)
         0 |     std::basic_string<char>::pointer _M_p
         8 |   std::basic_string<char>::size_type _M_string_length
        16 |   union std::basic_string<char>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/basic_string.h:215:7) 
        16 |     char[16] _M_local_buf
        16 |     std::basic_string<char>::size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<wchar_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<wchar_t> (empty)
         0 |   class std::__new_allocator<wchar_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<wchar_t>::_Alloc_hider
         0 |   class std::allocator<wchar_t> (base) (empty)
         0 |     class std::__new_allocator<wchar_t> (base) (empty)
         0 |   std::basic_string<wchar_t>::pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<wchar_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/basic_string.h:215:7)
         0 |   wchar_t[4] _M_local_buf
         0 |   std::basic_string<wchar_t>::size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<wchar_t>
         0 |   struct std::basic_string<wchar_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<wchar_t> (base) (empty)
         0 |       class std::__new_allocator<wchar_t> (base) (empty)
         0 |     std::basic_string<wchar_t>::pointer _M_p
         8 |   std::basic_string<wchar_t>::size_type _M_string_length
        16 |   union std::basic_string<wchar_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/basic_string.h:215:7) 
        16 |     wchar_t[4] _M_local_buf
        16 |     std::basic_string<wchar_t>::size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<char16_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char16_t> (empty)
         0 |   class std::__new_allocator<char16_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char16_t>::_Alloc_hider
         0 |   class std::allocator<char16_t> (base) (empty)
         0 |     class std::__new_allocator<char16_t> (base) (empty)
         0 |   std::basic_string<char16_t>::pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char16_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/basic_string.h:215:7)
         0 |   char16_t[8] _M_local_buf
         0 |   std::basic_string<char16_t>::size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char16_t>
         0 |   struct std::basic_string<char16_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char16_t> (base) (empty)
         0 |       class std::__new_allocator<char16_t> (base) (empty)
         0 |     std::basic_string<char16_t>::pointer _M_p
         8 |   std::basic_string<char16_t>::size_type _M_string_length
        16 |   union std::basic_string<char16_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/basic_string.h:215:7) 
        16 |     char16_t[8] _M_local_buf
        16 |     std::basic_string<char16_t>::size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::__new_allocator<char32_t> (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::allocator<char32_t> (empty)
         0 |   class std::__new_allocator<char32_t> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::basic_string<char32_t>::_Alloc_hider
         0 |   class std::allocator<char32_t> (base) (empty)
         0 |     class std::__new_allocator<char32_t> (base) (empty)
         0 |   std::basic_string<char32_t>::pointer _M_p
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::basic_string<char32_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/basic_string.h:215:7)
         0 |   char32_t[4] _M_local_buf
         0 |   std::basic_string<char32_t>::size_type _M_allocated_capacity
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_string<char32_t>
         0 |   struct std::basic_string<char32_t>::_Alloc_hider _M_dataplus
         0 |     class std::allocator<char32_t> (base) (empty)
         0 |       class std::__new_allocator<char32_t> (base) (empty)
         0 |     std::basic_string<char32_t>::pointer _M_p
         8 |   std::basic_string<char32_t>::size_type _M_string_length
        16 |   union std::basic_string<char32_t>::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/basic_string.h:215:7) 
        16 |     char32_t[4] _M_local_buf
        16 |     std::basic_string<char32_t>::size_type _M_allocated_capacity
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale
         0 |   class std::locale::_Impl * _M_impl
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::facet
         0 |   (facet vtable pointer)
         8 |   _Atomic_word _M_refcount
           | [sizeof=16, dsize=12, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::id
         0 |   std::size_t _M_index
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::locale::_Impl
         0 |   _Atomic_word _M_refcount
         8 |   const class std::locale::facet ** _M_facets
        16 |   std::size_t _M_facets_size
        24 |   const class std::locale::facet ** _M_caches
        32 |   char ** _M_names
           | [sizeof=40, dsize=40, align=8,
           |  nvsize=40, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::binary_function<const class std::error_category *, const class std::error_category *, _Bool> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::less<const class std::error_category *> (empty)
         0 |   struct std::binary_function<const class std::error_category *, const class std::error_category *, _Bool> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::error_category
         0 |   (error_category vtable pointer)
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::error_code
         0 |   int _M_value
         8 |   const class std::error_category * _M_cat
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::error_condition
         0 |   int _M_value
         8 |   const class std::error_category * _M_cat
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/stdexcept:50:5)
         0 |   const char * _M_p
         0 |   char[8] _M_bytes
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__cow_string
         0 |   union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/stdexcept:50:5) 
         0 |     const char * _M_p
         0 |     char[8] _M_bytes
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::runtime_error
         0 |   class std::exception (primary base)
         0 |     (exception vtable pointer)
         8 |   struct std::__cow_string _M_msg
         8 |     union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/stdexcept:50:5) 
         8 |       const char * _M_p
         8 |       char[8] _M_bytes
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::system_error
         0 |   class std::runtime_error (primary base)
         0 |     class std::exception (primary base)
         0 |       (exception vtable pointer)
         8 |     struct std::__cow_string _M_msg
         8 |       union std::__cow_string::(anonymous at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/stdexcept:50:5) 
         8 |         const char * _M_p
         8 |         char[8] _M_bytes
        16 |   class std::error_code _M_code
        16 |     int _M_value
        24 |     const class std::error_category * _M_cat
           | [sizeof=32, dsize=32, align=8,
           |  nvsize=32, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::ios_base::_Words
         0 |   void * _M_pword
         8 |   long _M_iword
           | [sizeof=16, dsize=16, align=8,
           |  nvsize=16, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base
         0 |   (ios_base vtable pointer)
         8 |   std::streamsize _M_precision
        16 |   std::streamsize _M_width
        24 |   std::ios_base::fmtflags _M_flags
        28 |   std::ios_base::iostate _M_exception
        32 |   std::ios_base::iostate _M_streambuf_state
        40 |   struct std::ios_base::_Callback_list * _M_callbacks
        48 |   struct std::ios_base::_Words _M_word_zero
        48 |     void * _M_pword
        56 |     long _M_iword
        64 |   struct std::ios_base::_Words[8] _M_local_word
       192 |   int _M_word_size
       200 |   struct std::ios_base::_Words * _M_word
       208 |   class std::locale _M_ios_locale
       208 |     class std::locale::_Impl * _M_impl
           | [sizeof=216, dsize=216, align=8,
           |  nvsize=216, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::ctype_base (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | class std::ctype<char>
         0 |   class std::locale::facet (primary base)
         0 |     (facet vtable pointer)
         8 |     _Atomic_word _M_refcount
         0 |   struct std::ctype_base (base) (empty)
        16 |   std::__c_locale _M_c_locale_ctype
        24 |   _Bool _M_del
        32 |   std::ctype_base::__to_type _M_toupper
        40 |   std::ctype_base::__to_type _M_tolower
        48 |   const std::ctype_base::mask * _M_table
        56 |   char _M_widen_ok
        57 |   char[256] _M_widen
       313 |   char[256] _M_narrow
       569 |   char _M_narrow_ok
           | [sizeof=576, dsize=570, align=8,
           |  nvsize=570, nvalign=8]

*** Dumping AST Record Layout
         0 | struct std::__type_identity<class std::allocator<char> > (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, true> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::ios_base::_Callback_list
         0 |   struct std::ios_base::_Callback_list * _M_next
         8 |   class ios_base::event_callback _M_fn
        16 |   int _M_index
        20 |   _Atomic_word _M_refcount
           | [sizeof=24, dsize=24, align=8,
           |  nvsize=24, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::ios_base::Init (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=0, nvalign=1]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x199fb08[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:639:5[0m, [0;33mline:654:5[0m> [0;33mline:639:11[0m referenced class[0;1;36m Init[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m empty standard_layout has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199fc28[0m <[0;33mcol:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit referenced class[0;1;36m Init[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x199fd10[0m <[0;33mline:641:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m [0;32m'class ios_base':'std::ios_base'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x199fd50[0m <[0;33mline:642:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199fde0[0m <[0;33mline:643:7[0m, [0;33mcol:12[0m> [0;33mcol:7[0m used[0;1;36m Init[0m [0;32m'void ()'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x199fed0[0m <[0;33mline:644:7[0m, [0;33mcol:13[0m> [0;33mcol:7[0m used[0;1;36m ~Init[0m [0;32m'void () noexcept'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19a00a8[0m <[0;33mline:647:7[0m, [0;33mcol:33[0m> [0;33mcol:7[0m constexpr[0;1;36m Init[0m [0;32m'void (const std::ios_base::Init &)'[0m default trivial noexcept-unevaluated 0x19a00a8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199ffe8[0m <[0;33mcol:12[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const std::ios_base::Init &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0268[0m <[0;33mline:648:7[0m, [0;33mcol:44[0m> [0;33mcol:13[0m[0;1;36m operator=[0m [0;32m'std::ios_base::Init &(const std::ios_base::Init &)'[0m default trivial noexcept-unevaluated 0x19a0268
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a0178[0m <[0;33mcol:23[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const std::ios_base::Init &'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19a0310[0m <[0;33mline:651:5[0m, [0;33mcol:12[0m> [0;33mcol:5[0m private
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x19a0348[0m <[0;33mline:652:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m _S_refcount[0m [0;32m'_Atomic_word':'int'[0m static
[0;34m`-[0m[0;1;32mVarDecl[0m[0;33m 0x19a03c0[0m <[0;33mline:653:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _S_synced_with_stdio[0m [0;32m'bool'[0m static

Layout: <CGRecordLayout
  LLVMType:%"class.std::ios_base::Init" = type { i8 }
  NonVirtualBaseLLVMType:%"class.std::ios_base::Init.base" = type {}
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::basic_ios<char>
         0 |   class std::ios_base (primary base)
         0 |     (ios_base vtable pointer)
         8 |     std::streamsize _M_precision
        16 |     std::streamsize _M_width
        24 |     std::ios_base::fmtflags _M_flags
        28 |     std::ios_base::iostate _M_exception
        32 |     std::ios_base::iostate _M_streambuf_state
        40 |     struct std::ios_base::_Callback_list * _M_callbacks
        48 |     struct std::ios_base::_Words _M_word_zero
        48 |       void * _M_pword
        56 |       long _M_iword
        64 |     struct std::ios_base::_Words[8] _M_local_word
       192 |     int _M_word_size
       200 |     struct std::ios_base::_Words * _M_word
       208 |     class std::locale _M_ios_locale
       208 |       class std::locale::_Impl * _M_impl
       216 |   basic_ostream<char, struct std::char_traits<char> > * _M_tie
       224 |   std::basic_ios<char>::char_type _M_fill
       225 |   _Bool _M_fill_init
       232 |   basic_streambuf<char, struct std::char_traits<char> > * _M_streambuf
       240 |   const std::basic_ios<char>::__ctype_type * _M_ctype
       248 |   const std::basic_ios<char>::__num_put_type * _M_num_put
       256 |   const std::basic_ios<char>::__num_get_type * _M_num_get
           | [sizeof=264, dsize=264, align=8,
           |  nvsize=264, nvalign=8]

*** Dumping AST Record Layout
         0 | class std::basic_ostream<char>
         0 |   (basic_ostream vtable pointer)
         8 |   class std::basic_ios<char> (virtual base)
         8 |     class std::ios_base (primary base)
         8 |       (ios_base vtable pointer)
        16 |       std::streamsize _M_precision
        24 |       std::streamsize _M_width
        32 |       std::ios_base::fmtflags _M_flags
        36 |       std::ios_base::iostate _M_exception
        40 |       std::ios_base::iostate _M_streambuf_state
        48 |       struct std::ios_base::_Callback_list * _M_callbacks
        56 |       struct std::ios_base::_Words _M_word_zero
        56 |         void * _M_pword
        64 |         long _M_iword
        72 |       struct std::ios_base::_Words[8] _M_local_word
       200 |       int _M_word_size
       208 |       struct std::ios_base::_Words * _M_word
       216 |       class std::locale _M_ios_locale
       216 |         class std::locale::_Impl * _M_impl
       224 |     basic_ostream<char, struct std::char_traits<char> > * _M_tie
       232 |     std::basic_ios<char>::char_type _M_fill
       233 |     _Bool _M_fill_init
       240 |     basic_streambuf<char, struct std::char_traits<char> > * _M_streambuf
       248 |     const std::basic_ios<char>::__ctype_type * _M_ctype
       256 |     const std::basic_ios<char>::__num_put_type * _M_num_put
       264 |     const std::basic_ios<char>::__num_get_type * _M_num_get
           | [sizeof=272, dsize=272, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | class A
         0 |   int a
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class B
         0 |   int b
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | class C
         0 |   (C vtable pointer)
         8 |   int c
        12 |   class A (virtual base)
        12 |     int a
        16 |   class B (virtual base)
        16 |     int b
           | [sizeof=24, dsize=20, align=8,
           |  nvsize=12, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x1baa4a8[0m <[0;33mtest_6.cpp:3:1[0m, [0;33mline:10:1[0m> [0;33mline:3:7[0m referenced class[0;1;36m A[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1baa5c8[0m <[0;33mcol:1[0m, [0;33mcol:7[0m> [0;33mcol:7[0m implicit referenced class[0;1;36m A[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1baa658[0m <[0;33mline:4:1[0m, [0;33mcol:10[0m> [0;33mcol:1[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x1baa698[0m <[0;33mline:5:3[0m, [0;33mcol:7[0m> [0;33mcol:7[0m referenced[0;1;36m a[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1baa6e8[0m <[0;33mline:7:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1baa7f8[0m <[0;33mline:8:3[0m, [0;33mcol:24[0m> [0;33mcol:3[0m used[0;1;36m A[0m [0;32m'void (int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1baa728[0m <[0;33mcol:5[0m, [0;33mcol:9[0m> [0;33mcol:9[0m used[0;1;36m val[0m [0;32m'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x1baa698[0m[0;1;36m 'a'[0m [0;32m'int'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1baa9c0[0m <[0;33mcol:18[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1baa980[0m <[0;33mcol:18[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x1baa728[0m[0;1;36m 'val'[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1baaa00[0m <[0;33mcol:23[0m, [0;33mcol:24[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1baa8c8[0m <[0;33mline:9:3[0m, [0;33mcol:57[0m> [0;33mcol:8[0m used[0;1;36m printA[0m [0;32m'void ()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1bb0478[0m <[0;33mcol:17[0m, [0;33mcol:57[0m>
[0;34m|   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1bb0410[0m <[0;33mcol:19[0m, [0;33mcol:51[0m> [0;32m'std::basic_ostream<char>::__ostream_type':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb03f8[0m <[0;33mcol:43[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb0380[0m <[0;33mcol:43[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mCXXMethod[0m[0;33m 0x1b22b68[0m[0;1;36m 'operator<<'[0m [0;32m'std::basic_ostream<char>::__ostream_type &(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m
[0;34m|     |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1baf980[0m <[0;33mcol:19[0m, [0;33mcol:41[0m> [0;32m'std::basic_ostream<char>::__ostream_type':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<'
[0;34m|     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1baf968[0m <[0;33mcol:38[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(*)(int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1baf8f0[0m <[0;33mcol:38[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mCXXMethod[0m[0;33m 0x1b23b38[0m[0;1;36m 'operator<<'[0m [0;32m'std::basic_ostream<char>::__ostream_type &(int)'[0m
[0;34m|     | |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1bae990[0m <[0;33mcol:19[0m, [0;33mcol:32[0m> [0;32m'basic_ostream<char, std::char_traits<char>>':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<' adl
[0;34m|     | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bae978[0m <[0;33mcol:29[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(*)(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bae8f8[0m <[0;33mcol:29[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1b2c418[0m[0;1;36m 'operator<<'[0m [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m
[0;34m|     | | |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1baaa78[0m <[0;33mcol:19[0m, [0;33mcol:24[0m> [0;32m'std::ostream':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x1ba9eb8[0m[0;1;36m 'cout'[0m [0;32m'std::ostream':'std::basic_ostream<char>'[0m
[0;34m|     | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bae8e0[0m <[0;33mcol:32[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m <[0;31mArrayToPointerDecay[0m>
[0;34m|     | |   `-[0m[0;1;35mStringLiteral[0m[0;33m 0x1baaaa8[0m <[0;33mcol:32[0m> [0;32m'const char[4]'[0m[0;36m lvalue[0m[0;36m[0m[0;1;36m "A: "[0m
[0;34m|     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1baf8d8[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     |   `-[0m[0;1;35mMemberExpr[0m[0;33m 0x1baeb90[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->a[0;33m 0x1baa698[0m
[0;34m|     |     `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x1baeb80[0m <[0;33mcol:41[0m> [0;32m'A *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb0368[0m <[0;33mcol:46[0m, [0;33mcol:51[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(*)(basic_ostream<char, std::char_traits<char>> &)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb0330[0m <[0;33mcol:46[0m, [0;33mcol:51[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1b272a8[0m[0;1;36m 'endl'[0m [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &)'[0m ([0;1;32mFunctionTemplate[0m[0;33m 0x1b08d48[0m[0;1;36m 'endl'[0m)
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1bb64b8[0m <[0;33mline:3:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'A &(const A &)'[0m inline default trivial noexcept-unevaluated 0x1bb64b8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb65c8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const A &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1bb6668[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'A &(A &&)'[0m inline default trivial noexcept-unevaluated 0x1bb6668
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb6778[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'A &&'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x1bb6e50[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m ~A[0m [0;32m'void ()'[0m inline default trivial noexcept-unevaluated 0x1bb6e50
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1bb7060[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m A[0m [0;32m'void (const A &)'[0m inline default trivial noexcept-unevaluated 0x1bb7060
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb7178[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const A &'[0m
[0;34m`-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1bb71f8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m A[0m [0;32m'void (A &&)'[0m inline default trivial noexcept-unevaluated 0x1bb71f8
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb7308[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'A &&'[0m

Layout: <CGRecordLayout
  LLVMType:%class.A = type { i32 }
  NonVirtualBaseLLVMType:%class.A = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x1bb0490[0m <[0;33mtest_6.cpp:12:1[0m, [0;33mline:19:1[0m> [0;33mline:12:7[0m referenced class[0;1;36m B[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1bb05a8[0m <[0;33mcol:1[0m, [0;33mcol:7[0m> [0;33mcol:7[0m implicit referenced class[0;1;36m B[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1bb0638[0m <[0;33mline:13:1[0m, [0;33mcol:10[0m> [0;33mcol:1[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x1bb0678[0m <[0;33mline:14:3[0m, [0;33mcol:7[0m> [0;33mcol:7[0m referenced[0;1;36m b[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1bb06c8[0m <[0;33mline:16:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1bb07d8[0m <[0;33mline:17:3[0m, [0;33mcol:24[0m> [0;33mcol:3[0m used[0;1;36m B[0m [0;32m'void (int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb0708[0m <[0;33mcol:5[0m, [0;33mcol:9[0m> [0;33mcol:9[0m used[0;1;36m val[0m [0;32m'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x1bb0678[0m[0;1;36m 'b'[0m [0;32m'int'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb09a0[0m <[0;33mcol:18[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb0960[0m <[0;33mcol:18[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x1bb0708[0m[0;1;36m 'val'[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1bb09e0[0m <[0;33mcol:23[0m, [0;33mcol:24[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1bb08a8[0m <[0;33mline:18:3[0m, [0;33mcol:57[0m> [0;33mcol:8[0m used[0;1;36m printB[0m [0;32m'void ()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1bb5b90[0m <[0;33mcol:17[0m, [0;33mcol:57[0m>
[0;34m|   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1bb5b58[0m <[0;33mcol:19[0m, [0;33mcol:51[0m> [0;32m'std::basic_ostream<char>::__ostream_type':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb5b40[0m <[0;33mcol:43[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb5b20[0m <[0;33mcol:43[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mCXXMethod[0m[0;33m 0x1b22b68[0m[0;1;36m 'operator<<'[0m [0;32m'std::basic_ostream<char>::__ostream_type &(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m
[0;34m|     |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1bb5178[0m <[0;33mcol:19[0m, [0;33mcol:41[0m> [0;32m'std::basic_ostream<char>::__ostream_type':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<'
[0;34m|     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb5160[0m <[0;33mcol:38[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(*)(int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb5140[0m <[0;33mcol:38[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mCXXMethod[0m[0;33m 0x1b23b38[0m[0;1;36m 'operator<<'[0m [0;32m'std::basic_ostream<char>::__ostream_type &(int)'[0m
[0;34m|     | |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1bb1768[0m <[0;33mcol:19[0m, [0;33mcol:32[0m> [0;32m'basic_ostream<char, std::char_traits<char>>':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<' adl
[0;34m|     | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb1750[0m <[0;33mcol:29[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(*)(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb1730[0m <[0;33mcol:29[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1b2c418[0m[0;1;36m 'operator<<'[0m [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m
[0;34m|     | | |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb0a40[0m <[0;33mcol:19[0m, [0;33mcol:24[0m> [0;32m'std::ostream':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x1ba9eb8[0m[0;1;36m 'cout'[0m [0;32m'std::ostream':'std::basic_ostream<char>'[0m
[0;34m|     | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb1718[0m <[0;33mcol:32[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m <[0;31mArrayToPointerDecay[0m>
[0;34m|     | |   `-[0m[0;1;35mStringLiteral[0m[0;33m 0x1bb0a70[0m <[0;33mcol:32[0m> [0;32m'const char[4]'[0m[0;36m lvalue[0m[0;36m[0m[0;1;36m "B: "[0m
[0;34m|     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb5128[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     |   `-[0m[0;1;35mMemberExpr[0m[0;33m 0x1bb17b0[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->b[0;33m 0x1bb0678[0m
[0;34m|     |     `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x1bb17a0[0m <[0;33mcol:41[0m> [0;32m'B *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb5b08[0m <[0;33mcol:46[0m, [0;33mcol:51[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(*)(basic_ostream<char, std::char_traits<char>> &)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb5ad0[0m <[0;33mcol:46[0m, [0;33mcol:51[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1b272a8[0m[0;1;36m 'endl'[0m [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &)'[0m ([0;1;32mFunctionTemplate[0m[0;33m 0x1b08d48[0m[0;1;36m 'endl'[0m)
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1bb6858[0m <[0;33mline:12:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'B &(const B &)'[0m inline default trivial noexcept-unevaluated 0x1bb6858
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb6968[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const B &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1bb6a08[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'B &(B &&)'[0m inline default trivial noexcept-unevaluated 0x1bb6a08
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb6b18[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'B &&'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x1bb6f30[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m ~B[0m [0;32m'void ()'[0m inline default trivial noexcept-unevaluated 0x1bb6f30
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1bb7508[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m B[0m [0;32m'void (const B &)'[0m inline default trivial noexcept-unevaluated 0x1bb7508
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb7618[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const B &'[0m
[0;34m`-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1bb7698[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit constexpr[0;1;36m B[0m [0;32m'void (B &&)'[0m inline default trivial noexcept-unevaluated 0x1bb7698
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb77a8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'B &&'[0m

Layout: <CGRecordLayout
  LLVMType:%class.B = type { i32 }
  NonVirtualBaseLLVMType:%class.B = type { i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x1bb5ba8[0m <[0;33mtest_6.cpp:21:1[0m, [0;33mline:28:1[0m> [0;33mline:21:7[0m referenced class[0;1;36m C[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple non_trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple non_trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple non_trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m|-[0mvirtual public [0;32m'A'[0m
[0;34m|-[0mvirtual public [0;32m'B'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1bb5d78[0m <[0;33mcol:1[0m, [0;33mcol:7[0m> [0;33mcol:7[0m implicit referenced class[0;1;36m C[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1bb5e08[0m <[0;33mline:22:1[0m, [0;33mcol:10[0m> [0;33mcol:1[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x1bb5e48[0m <[0;33mline:23:3[0m, [0;33mcol:7[0m> [0;33mcol:7[0m referenced[0;1;36m c[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1bb5e98[0m <[0;33mline:25:1[0m, [0;33mcol:7[0m> [0;33mcol:1[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1bb60f8[0m <[0;33mline:26:3[0m, [0;33mcol:64[0m> [0;33mcol:3[0m used[0;1;36m C[0m [0;32m'void (int, int, int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb5ed8[0m <[0;33mcol:5[0m, [0;33mcol:9[0m> [0;33mcol:9[0m used[0;1;36m val1[0m [0;32m'int'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb5f58[0m <[0;33mcol:15[0m, [0;33mcol:19[0m> [0;33mcol:19[0m used[0;1;36m val2[0m [0;32m'int'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb5fd8[0m <[0;33mcol:25[0m, [0;33mcol:29[0m> [0;33mcol:29[0m used[0;1;36m val3[0m [0;32m'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'A'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x1bb7468[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'A'[0m[0;36m[0m[0;36m[0m [0;32m'void (int)'[0m
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb7388[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb7010[0m <[0;33mcol:39[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x1bb5ed8[0m[0;1;36m 'val1'[0m [0;32m'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'B'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x1bb7908[0m <[0;33mcol:46[0m, [0;33mcol:52[0m> [0;32m'B'[0m[0;36m[0m[0;36m[0m [0;32m'void (int)'[0m
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb7828[0m <[0;33mcol:48[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb74b8[0m <[0;33mcol:48[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x1bb5f58[0m[0;1;36m 'val2'[0m [0;32m'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x1bb5e48[0m[0;1;36m 'c'[0m [0;32m'int'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb7998[0m <[0;33mcol:57[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb7958[0m <[0;33mcol:57[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x1bb5fd8[0m[0;1;36m 'val3'[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1bb79e8[0m <[0;33mcol:63[0m, [0;33mcol:64[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1bb61d8[0m <[0;33mline:27:3[0m, [0;33mcol:57[0m> [0;33mcol:8[0m used[0;1;36m printC[0m [0;32m'void ()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1bb9f30[0m <[0;33mcol:17[0m, [0;33mcol:57[0m>
[0;34m|   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1bb9ef8[0m <[0;33mcol:19[0m, [0;33mcol:51[0m> [0;32m'std::basic_ostream<char>::__ostream_type':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb9ee0[0m <[0;33mcol:43[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb9ec0[0m <[0;33mcol:43[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mCXXMethod[0m[0;33m 0x1b22b68[0m[0;1;36m 'operator<<'[0m [0;32m'std::basic_ostream<char>::__ostream_type &(std::basic_ostream<char>::__ostream_type &(*)(std::basic_ostream<char>::__ostream_type &))'[0m
[0;34m|     |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1bb9518[0m <[0;33mcol:19[0m, [0;33mcol:41[0m> [0;32m'std::basic_ostream<char>::__ostream_type':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<'
[0;34m|     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb9500[0m <[0;33mcol:38[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(*)(int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb94e0[0m <[0;33mcol:38[0m> [0;32m'std::basic_ostream<char>::__ostream_type &(int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mCXXMethod[0m[0;33m 0x1b23b38[0m[0;1;36m 'operator<<'[0m [0;32m'std::basic_ostream<char>::__ostream_type &(int)'[0m
[0;34m|     | |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x1bb8768[0m <[0;33mcol:19[0m, [0;33mcol:32[0m> [0;32m'basic_ostream<char, std::char_traits<char>>':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m '<<' adl
[0;34m|     | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb8750[0m <[0;33mcol:29[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(*)(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb8730[0m <[0;33mcol:29[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1b2c418[0m[0;1;36m 'operator<<'[0m [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &, const char *)'[0m
[0;34m|     | | |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb7a48[0m <[0;33mcol:19[0m, [0;33mcol:24[0m> [0;32m'std::ostream':'std::basic_ostream<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x1ba9eb8[0m[0;1;36m 'cout'[0m [0;32m'std::ostream':'std::basic_ostream<char>'[0m
[0;34m|     | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb8718[0m <[0;33mcol:32[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m <[0;31mArrayToPointerDecay[0m>
[0;34m|     | |   `-[0m[0;1;35mStringLiteral[0m[0;33m 0x1bb7a78[0m <[0;33mcol:32[0m> [0;32m'const char[4]'[0m[0;36m lvalue[0m[0;36m[0m[0;1;36m "C: "[0m
[0;34m|     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb94c8[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     |   `-[0m[0;1;35mMemberExpr[0m[0;33m 0x1bb87b0[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->c[0;33m 0x1bb5e48[0m
[0;34m|     |     `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x1bb87a0[0m <[0;33mcol:41[0m> [0;32m'C *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1bb9ea8[0m <[0;33mcol:46[0m, [0;33mcol:51[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(*)(basic_ostream<char, std::char_traits<char>> &)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1bb9e70[0m <[0;33mcol:46[0m, [0;33mcol:51[0m> [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1b272a8[0m[0;1;36m 'endl'[0m [0;32m'basic_ostream<char, std::char_traits<char>> &(basic_ostream<char, std::char_traits<char>> &)'[0m ([0;1;32mFunctionTemplate[0m[0;33m 0x1b08d48[0m[0;1;36m 'endl'[0m)
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1bb62d8[0m <[0;33mline:21:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'C &(const C &)'[0m inline default noexcept-unevaluated 0x1bb62d8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb63e8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const C &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1bb6bc8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m operator=[0m [0;32m'C &(C &&)'[0m inline default noexcept-unevaluated 0x1bb6bc8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bb6cd8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'C &&'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x1bb6d70[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m ~C[0m [0;32m'void ()'[0m inline default trivial noexcept-unevaluated 0x1bb6d70
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1bba118[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m C[0m [0;32m'void (const C &)'[0m inline default noexcept-unevaluated 0x1bba118
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bba228[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'const C &'[0m
[0;34m`-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1bba2a8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m implicit[0;1;36m C[0m [0;32m'void (C &&)'[0m inline default noexcept-unevaluated 0x1bba2a8
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1bba3b8[0m <[0;33mcol:7[0m> [0;33mcol:7[0m [0;32m'C &&'[0m

Layout: <CGRecordLayout
  LLVMType:%class.C = type <{ i32 (...)**, i32, %class.A, %class.B, [4 x i8] }>
  NonVirtualBaseLLVMType:%class.C.base = type <{ i32 (...)**, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<int, int> (empty)
         0 |   struct std::integral_constant<_Bool, true> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::integral_constant<_Bool, false> (empty)
           | [sizeof=1, dsize=1, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::is_same<long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<unsigned long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<long long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<unsigned long long, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<float, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<double, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct std::is_same<long double, int> (empty)
         0 |   struct std::integral_constant<_Bool, false> (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::bidirectional_iterator_tag (empty)
         0 |   struct std::forward_iterator_tag (base) (empty)
         0 |     struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct std::random_access_iterator_tag (empty)
         0 |   struct std::bidirectional_iterator_tag (base) (empty)
         0 |     struct std::forward_iterator_tag (base) (empty)
         0 |       struct std::input_iterator_tag (base) (empty)
           | [sizeof=1, dsize=0, align=1,
           |  nvsize=1, nvalign=1]

*** Dumping AST Record Layout
         0 | struct _Guard
         0 |   class std::basic_string<char> * _M_guarded
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Save_errno
         0 |   int _M_errno
           | [sizeof=4, dsize=4, align=4,
           |  nvsize=4, nvalign=4]

*** Dumping AST Record Layout
         0 | struct _Guard
         0 |   class std::basic_string<wchar_t> * _M_guarded
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _Guard
         0 |   class std::basic_string<char> * _M_guarded
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _Guard
         0 |   class std::basic_string<wchar_t> * _M_guarded
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _Guard
         0 |   class std::basic_string<char16_t> * _M_guarded
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping AST Record Layout
         0 | struct _Guard
         0 |   class std::basic_string<char32_t> * _M_guarded
           | [sizeof=8, dsize=8, align=8,
           |  nvsize=8, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x199e320[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:566:5[0m, [0;33mline:594:5[0m> [0;33mline:566:12[0m referenced struct[0;1;36m _Callback_list[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple trivial needs_implicit
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple trivial needs_implicit
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial needs_implicit
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199e438[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Callback_list[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e508[0m <[0;33mline:569:7[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m _M_next[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e600[0m <[0;33mline:570:7[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m _M_fn[0m [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e668[0m <[0;33mline:571:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m[0;1;36m _M_index[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e6c8[0m <[0;33mline:572:7[0m, [0;33mcol:21[0m> [0;33mcol:21[0m referenced[0;1;36m _M_refcount[0m [0;32m'_Atomic_word':'int'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199e9a8[0m <[0;33mline:574:7[0m, [0;33mline:576:73[0m> [0;33mline:574:7[0m[0;1;36m _Callback_list[0m [0;32m'void (ios_base::event_callback, int, std::ios_base::_Callback_list *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199e770[0m <[0;33mcol:22[0m, [0;33mcol:47[0m> [0;33mcol:47[0m used[0;1;36m __fn[0m [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199e7f0[0m <[0;33mcol:53[0m, [0;33mcol:57[0m> [0;33mcol:57[0m used[0;1;36m __index[0m [0;32m'int'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199e868[0m <[0;33mline:575:8[0m, [0;33mcol:24[0m> [0;33mcol:24[0m used[0;1;36m __cb[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199e508[0m[0;1;36m '_M_next'[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a33d8[0m <[0;33mline:576:17[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3398[0m <[0;33mcol:17[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x199e868[0m[0;1;36m '__cb'[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199e600[0m[0;1;36m '_M_fn'[0m [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3450[0m <[0;33mcol:30[0m> [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3410[0m <[0;33mcol:30[0m> [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x199e770[0m[0;1;36m '__fn'[0m [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199e668[0m[0;1;36m '_M_index'[0m [0;32m'int'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a34c8[0m <[0;33mcol:46[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3488[0m <[0;33mcol:46[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x199e7f0[0m[0;1;36m '__index'[0m [0;32m'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199e6c8[0m[0;1;36m '_M_refcount'[0m [0;32m'_Atomic_word':'int'[0m
[0;34m| | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a3500[0m <[0;33mcol:68[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a3580[0m <[0;33mcol:71[0m, [0;33mcol:73[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199ea88[0m <[0;33mline:578:7[0m, [0;33mline:579:79[0m> [0;33mcol:7[0m referenced[0;1;36m _M_add_reference[0m [0;32m'void ()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a36d0[0m <[0;33mcol:26[0m, [0;33mcol:79[0m>
[0;34m|   `-[0m[0;1;35mCallExpr[0m[0;33m 0x19a36a0[0m <[0;33mcol:28[0m, [0;33mcol:76[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3688[0m <[0;33mcol:28[0m, [0;33mcol:39[0m> [0;32m'void (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a35e0[0m <[0;33mcol:28[0m, [0;33mcol:39[0m> [0;32m'void (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x13c3748[0m[0;1;36m '__atomic_add_dispatch'[0m [0;32m'void (_Atomic_word *, int)'[0m
[0;34m|     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x19a3650[0m <[0;33mcol:61[0m, [0;33mcol:62[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a3620[0m <[0;33mcol:62[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x199e6c8[0m
[0;34m|     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a3610[0m <[0;33mcol:62[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a3668[0m <[0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199eb50[0m <[0;33mline:582:7[0m, [0;33mline:593:7[0m> [0;33mline:583:7[0m[0;1;36m _M_remove_reference[0m [0;32m'int ()'[0m
[0;34m  `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a39b0[0m <[0;33mline:584:7[0m, [0;33mline:593:7[0m>
[0;34m    |-[0m[0;1;35mNullStmt[0m[0;33m 0x19a36e8[0m <[0;33mline:586:62[0m>
[0;34m    |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a3898[0m <[0;33mline:587:9[0m, [0;33mcol:77[0m>
[0;34m    | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a3708[0m <[0;33mcol:9[0m, [0;33mcol:76[0m> [0;33mcol:13[0m used[0;1;36m __res[0m [0;32m'int'[0m cinit
[0;34m    |   `-[0m[0;1;35mCallExpr[0m[0;33m 0x19a3868[0m <[0;33mcol:21[0m, [0;33mcol:76[0m> [0;32m'_Atomic_word':'int'[0m[0;36m[0m[0;36m[0m
[0;34m    |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3850[0m <[0;33mcol:21[0m, [0;33mcol:32[0m> [0;32m'_Atomic_word (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m    |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3790[0m <[0;33mcol:21[0m, [0;33mcol:32[0m> [0;32m'_Atomic_word (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x13c30f8[0m[0;1;36m '__exchange_and_add_dispatch'[0m [0;32m'_Atomic_word (_Atomic_word *, int)'[0m
[0;34m    |     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x19a3800[0m <[0;33mcol:60[0m, [0;33mcol:61[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m    |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a37d0[0m <[0;33mcol:61[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x199e6c8[0m
[0;34m    |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a37c0[0m <[0;33mcol:61[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m    |     `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x19a3838[0m <[0;33mcol:74[0m, [0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m prefix '-'
[0;34m    |       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a3818[0m <[0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m    |-[0m[0;1;35mIfStmt[0m[0;33m 0x19a3948[0m <[0;33mline:588:9[0m, [0;33mline:591:11[0m>
[0;34m    | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19a3908[0m <[0;33mline:588:13[0m, [0;33mcol:22[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '=='
[0;34m    | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a38f0[0m <[0;33mcol:13[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m    | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a38b0[0m <[0;33mcol:13[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a3708[0m[0;1;36m '__res'[0m [0;32m'int'[0m
[0;34m    | | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a38d0[0m <[0;33mcol:22[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m    | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a3930[0m <[0;33mline:589:11[0m, [0;33mline:591:11[0m>
[0;34m    |   `-[0m[0;1;35mNullStmt[0m[0;33m 0x19a3928[0m <[0;33mline:590:65[0m>
[0;34m    `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a39a0[0m <[0;33mline:592:9[0m, [0;33mcol:16[0m>
[0;34m      `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3988[0m <[0;33mcol:16[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m        `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3968[0m <[0;33mcol:16[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a3708[0m[0;1;36m '__res'[0m [0;32m'int'[0m

Layout: <CGRecordLayout
  LLVMType:%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
  NonVirtualBaseLLVMType:%"struct.std::ios_base::_Callback_list" = type { %"struct.std::ios_base::_Callback_list"*, void (i32, %"class.std::ios_base"*, i32)*, i32, i32 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x199ef78[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:605:5[0m, [0;33mline:610:5[0m> [0;33mline:605:12[0m referenced struct[0;1;36m _Words[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199f098[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Words[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f140[0m <[0;33mline:607:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_pword[0m [0;32m'void *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f1a8[0m <[0;33mline:608:7[0m, [0;33mcol:12[0m> [0;33mcol:12[0m referenced[0;1;36m _M_iword[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199f260[0m <[0;33mline:609:7[0m, [0;33mcol:45[0m> [0;33mcol:7[0m referenced[0;1;36m _Words[0m [0;32m'void ()'[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199f140[0m[0;1;36m '_M_pword'[0m [0;32m'void *'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3a20[0m <[0;33mcol:27[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mNullToPointer[0m>
[0;34m| |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a39e0[0m <[0;33mcol:27[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199f1a8[0m[0;1;36m '_M_iword'[0m [0;32m'long'[0m
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3a98[0m <[0;33mcol:40[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m| |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a3a58[0m <[0;33mcol:40[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a3ae0[0m <[0;33mcol:43[0m, [0;33mcol:45[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19a2338[0m <[0;33mline:605:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (const std::ios_base::_Words &)'[0m inline default trivial noexcept-unevaluated 0x19a2338
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2448[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const std::ios_base::_Words &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19a24f8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (std::ios_base::_Words &&)'[0m inline default trivial noexcept-unevaluated 0x19a24f8
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2608[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'std::ios_base::_Words &&'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a2688[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'std::ios_base::_Words &(const std::ios_base::_Words &)'[0m inline default trivial noexcept-unevaluated 0x19a2688
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2798[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const std::ios_base::_Words &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a2808[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'std::ios_base::_Words &(std::ios_base::_Words &&)'[0m inline default trivial noexcept-unevaluated 0x19a2808
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2918[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'std::ios_base::_Words &&'[0m
[0;34m`-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x1aec610[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced[0;1;36m ~_Words[0m [0;32m'void () noexcept'[0m inline default trivial

Layout: <CGRecordLayout
  LLVMType:%"struct.std::ios_base::_Words" = type { i8*, i64 }
  NonVirtualBaseLLVMType:%"struct.std::ios_base::_Words" = type { i8*, i64 }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x1924178[0m parent 0x1916cf8 prev 0x1916f18 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:373:3[0m, [0;33mline:471:3[0m> [0;33mline:373:17[0m referenced class[0;1;36m facet[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor has_mutable_fields can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x19242b0[0m <[0;33mcol:3[0m, [0;33mcol:17[0m> [0;33mcol:17[0m implicit referenced class[0;1;36m facet[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1924340[0m <[0;33mline:375:3[0m, [0;33mcol:10[0m> [0;33mcol:3[0m private
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19243c0[0m <[0;33mline:376:5[0m, [0;33mcol:18[0m> [0;33mcol:12[0m [0;32m'class locale':'std::locale'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1924470[0m <[0;33mline:377:5[0m, [0;33mcol:26[0m> [0;33mcol:12[0m [0;32m'class locale::_Impl':'std::locale::_Impl'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19244c0[0m <[0;33mline:379:5[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m _M_refcount[0m [0;32m'_Atomic_word':'int'[0m mutable
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1924520[0m <[0;33mline:382:5[0m, [0;33mcol:41[0m> [0;33mcol:41[0m[0;1;36m _S_c_locale[0m [0;32m'std::__c_locale':'struct __locale_struct *'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x19245e8[0m <[0;33mline:385:5[0m, [0;33mcol:36[0m> [0;33mcol:25[0m[0;1;36m _S_c_name[0m [0;32m'const char[2]'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1924660[0m <[0;33mline:388:5[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m _S_once[0m [0;32m'__gthread_once_t':'int'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1924718[0m <[0;33mline:391:5[0m, [0;33mline:392:24[0m> [0;33mcol:5[0m[0;1;36m _S_initialize_once[0m [0;32m'void ()'[0m static
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19247b8[0m <[0;33mline:394:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19248d0[0m <[0;33mline:404:5[0m, [0;33mline:406:7[0m> [0;33mline:405:5[0m referenced[0;1;36m facet[0m [0;32m'void (std::size_t) throw()'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19247f0[0m <[0;33mcol:11[0m, [0;33mcol:27[0m> [0;33mcol:18[0m used[0;1;36m __refs[0m [0;32m'std::size_t':'unsigned long'[0m cinit
[0;34m| | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1925f80[0m <[0;33mcol:27[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m| |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1925f60[0m <[0;33mcol:27[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x19244c0[0m[0;1;36m '_M_refcount'[0m [0;32m'_Atomic_word':'int'[0m
[0;34m| | `-[0m[0;1;35mConditionalOperator[0m[0;33m 0x1926128[0m <[0;33mcol:52[0m, [0;33mcol:65[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m| |   |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1926110[0m <[0;33mcol:52[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralToBoolean[0m>
[0;34m| |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19260f8[0m <[0;33mcol:52[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1926098[0m <[0;33mcol:52[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19247f0[0m[0;1;36m '__refs'[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m| |   |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19260b8[0m <[0;33mcol:61[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m| |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19260d8[0m <[0;33mcol:65[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19261a0[0m <[0;33mline:406:5[0m, [0;33mcol:7[0m>
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x19249c8[0m <[0;33mline:409:5[0m, [0;33mline:410:12[0m> [0;33mcol:5[0m used[0;1;36m ~facet[0m [0;32m'void () noexcept'[0m virtual
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1924d38[0m <[0;33mline:412:5[0m, [0;33mline:414:30[0m> [0;33mline:413:5[0m[0;1;36m _S_create_c_locale[0m [0;32m'void (std::__c_locale &, const char *, std::__c_locale)'[0m static
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1924b18[0m <[0;33mcol:24[0m, [0;33mcol:36[0m> [0;33mcol:36[0m[0;1;36m __cloc[0m [0;32m'std::__c_locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1924b98[0m <[0;33mcol:44[0m, [0;33mcol:56[0m> [0;33mcol:56[0m[0;1;36m __s[0m [0;32m'const char *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1924c10[0m <[0;33mline:414:10[0m, [0;33mcol:29[0m> [0;33mcol:21[0m[0;1;36m __old[0m [0;32m'std::__c_locale':'struct __locale_struct *'[0m cinit
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1925ff0[0m <[0;33mcol:29[0m> [0;32m'std::__c_locale':'struct __locale_struct *'[0m[0;36m[0m[0;36m[0m <[0;31mNullToPointer[0m>
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1925fd0[0m <[0;33mcol:29[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1924f00[0m <[0;33mline:416:5[0m, [0;33mline:417:49[0m> [0;33mcol:5[0m referenced[0;1;36m _S_clone_c_locale[0m [0;32m'std::__c_locale (std::__c_locale &) throw()'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1924e00[0m <[0;33mcol:23[0m, [0;33mcol:35[0m> [0;33mcol:35[0m[0;1;36m __cloc[0m [0;32m'std::__c_locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19250a8[0m <[0;33mline:419:5[0m, [0;33mline:420:43[0m> [0;33mcol:5[0m referenced[0;1;36m _S_destroy_c_locale[0m [0;32m'void (std::__c_locale &)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1924fb8[0m <[0;33mcol:25[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __cloc[0m [0;32m'std::__c_locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19252f8[0m <[0;33mline:422:5[0m, [0;33mline:423:60[0m> [0;33mcol:5[0m[0;1;36m _S_lc_ctype_c_locale[0m [0;32m'std::__c_locale (std::__c_locale, const char *)'[0m static
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1925160[0m <[0;33mcol:26[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __cloc[0m [0;32m'std::__c_locale':'struct __locale_struct *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19251e0[0m <[0;33mcol:45[0m, [0;33mcol:57[0m> [0;33mcol:57[0m[0;1;36m __s[0m [0;32m'const char *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1925428[0m <[0;33mline:427:5[0m, [0;33mline:428:21[0m> [0;33mcol:5[0m referenced[0;1;36m _S_get_c_locale[0m [0;32m'std::__c_locale ()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1925558[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:50:25[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:431:27[0m> [0;33mcol:5[0m[0;1;36m _S_get_c_name[0m [0;32m'const char *() throw()'[0m static
[0;34m| `-[0m[0;1;34mConstAttr[0m[0;33m 0x19255f8[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:50:41[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1925748[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:440:5[0m, [0;33mcol:32[0m> [0;33mcol:5[0m[0;1;36m facet[0m [0;32m'void (const std::locale::facet &)'[0m delete
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1925688[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const std::locale::facet &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1925908[0m <[0;33mline:442:5[0m, [0;33mline:443:36[0m> [0;33mcol:5[0m[0;1;36m operator=[0m [0;32m'std::locale::facet &(const std::locale::facet &)'[0m delete
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1925818[0m <[0;33mcol:15[0m, [0;33mcol:26[0m> [0;33mcol:27[0m [0;32m'const std::locale::facet &'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19259b0[0m <[0;33mline:446:3[0m, [0;33mcol:10[0m> [0;33mcol:3[0m private
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1925a60[0m <[0;33mline:447:5[0m, [0;33mline:449:58[0m> [0;33mline:448:5[0m[0;1;36m _M_add_reference[0m [0;32m'void () const throw()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19262f0[0m <[0;33mline:449:5[0m, [0;33mcol:58[0m>
[0;34m|   `-[0m[0;1;35mCallExpr[0m[0;33m 0x19262c0[0m <[0;33mcol:7[0m, [0;33mcol:55[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19262a8[0m <[0;33mcol:7[0m, [0;33mcol:18[0m> [0;32m'void (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1926200[0m <[0;33mcol:7[0m, [0;33mcol:18[0m> [0;32m'void (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x13c3748[0m[0;1;36m '__atomic_add_dispatch'[0m [0;32m'void (_Atomic_word *, int)'[0m
[0;34m|     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x1926270[0m <[0;33mcol:40[0m, [0;33mcol:41[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x1926240[0m <[0;33mcol:41[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x19244c0[0m
[0;34m|     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x1926230[0m <[0;33mcol:41[0m> [0;32m'const std::locale::facet *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1926288[0m <[0;33mcol:54[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1925b28[0m <[0;33mline:451:5[0m, [0;33mline:464:5[0m> [0;33mline:452:5[0m[0;1;36m _M_remove_reference[0m [0;32m'void () const throw()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1926588[0m <[0;33mline:453:5[0m, [0;33mline:464:5[0m>
[0;34m|   |-[0m[0;1;35mNullStmt[0m[0;33m 0x1926308[0m <[0;33mline:455:60[0m>
[0;34m|   `-[0m[0;1;35mIfStmt[0m[0;33m 0x1926568[0m <[0;33mline:456:7[0m, [0;33mline:463:2[0m>
[0;34m|     |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1926488[0m <[0;33mline:456:11[0m, [0;33mcol:71[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '=='
[0;34m|     | |-[0m[0;1;35mCallExpr[0m[0;33m 0x1926438[0m <[0;33mcol:11[0m, [0;33mcol:66[0m> [0;32m'_Atomic_word':'int'[0m[0;36m[0m[0;36m[0m
[0;34m|     | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1926420[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;32m'_Atomic_word (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1926360[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;32m'_Atomic_word (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x13c30f8[0m[0;1;36m '__exchange_and_add_dispatch'[0m [0;32m'_Atomic_word (_Atomic_word *, int)'[0m
[0;34m|     | | |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x19263d0[0m <[0;33mcol:50[0m, [0;33mcol:51[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|     | | | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19263a0[0m <[0;33mcol:51[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x19244c0[0m
[0;34m|     | | |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x1926390[0m <[0;33mcol:51[0m> [0;32m'const std::locale::facet *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     | | `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x1926408[0m <[0;33mcol:64[0m, [0;33mcol:65[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m prefix '-'
[0;34m|     | |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19263e8[0m <[0;33mcol:65[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1926468[0m <[0;33mcol:71[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1926548[0m <[0;33mline:457:2[0m, [0;33mline:463:2[0m>
[0;34m|       |-[0m[0;1;35mNullStmt[0m[0;33m 0x19264a8[0m <[0;33mline:458:63[0m>
[0;34m|       `-[0m[0;1;35mCXXTryStmt[0m[0;33m 0x1926528[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/exception_defines.h:40:21[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:462:8[0m>
[0;34m|         |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19264e0[0m <[0;33mline:460:6[0m, [0;33mcol:21[0m>
[0;34m|         | `-[0m[0;1;35mCXXDeleteExpr[0m[0;33m 0x19264c0[0m <[0;33mcol:8[0m, [0;33mcol:15[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1132850[0m[0;1;36m 'operator delete'[0m [0;32m'void (void *) noexcept'[0m
[0;34m|         |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19264b0[0m <[0;33mcol:15[0m> [0;32m'const std::locale::facet *'[0m[0;36m[0m[0;36m[0m this
[0;34m|         `-[0m[0;1;35mCXXCatchStmt[0m[0;33m 0x1926508[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/exception_defines.h:41:21[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:462:8[0m>
[0;34m|           |-[0m[0;34m<<<NULL>>>[0m
[0;34m|           `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19264f8[0m <[0;33mcol:6[0m, [0;33mcol:8[0m>
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1925c98[0m <[0;33mline:466:5[0m, [0;33mcol:41[0m> [0;33mcol:18[0m[0;1;36m _M_sso_shim[0m [0;32m'const std::locale::facet *(const std::locale::id *) const'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1925bd8[0m <[0;33mcol:30[0m, [0;33mcol:38[0m> [0;33mcol:39[0m [0;32m'const std::locale::id *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1925de0[0m <[0;33mline:467:5[0m, [0;33mcol:41[0m> [0;33mcol:18[0m[0;1;36m _M_cow_shim[0m [0;32m'const std::locale::facet *(const std::locale::id *) const'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1925d50[0m <[0;33mcol:30[0m, [0;33mcol:38[0m> [0;33mcol:39[0m [0;32m'const std::locale::id *'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1925e88[0m <[0;33mline:469:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m`-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1925eb0[0m <[0;33mline:470:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m class[0;1;36m __shim[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::locale::facet" = type <{ i32 (...)**, i32, [4 x i8] }>
  NonVirtualBaseLLVMType:%"class.std::locale::facet.base" = type <{ i32 (...)**, i32 }>
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x1927570[0m parent 0x1916cf8 prev 0x1917080 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:524:3[0m, [0;33mline:632:3[0m> [0;33mline:524:17[0m referenced class[0;1;36m _Impl[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m standard_layout has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x19276a8[0m <[0;33mcol:3[0m, [0;33mcol:17[0m> [0;33mcol:17[0m implicit referenced class[0;1;36m _Impl[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1927738[0m <[0;33mline:526:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1927780[0m <[0;33mline:528:5[0m, [0;33mcol:18[0m> [0;33mcol:12[0m [0;32m'class locale':'std::locale'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1927830[0m <[0;33mline:529:5[0m, [0;33mcol:26[0m> [0;33mcol:12[0m [0;32m'class locale::facet':'std::locale::facet'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1927b40[0m <[0;33mline:531:5[0m, [0;33mline:533:38[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x1927a58[0m parent 0x1916c30 prev 0x1926dd8 <[0;33mline:531:5[0m, [0;33mline:533:38[0m> [0;33mcol:7[0m[0;1;36m has_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x1927870[0m <[0;33mline:531:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19279a8[0m parent 0x1916c30 prev 0x1926d28 <[0;33mline:532:7[0m, [0;33mline:533:38[0m> [0;33mcol:7[0m[0;1;36m has_facet[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1927910[0m <[0;33mcol:17[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const std::locale &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1949190[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x194d160[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acd250[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acd5d0[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acda30[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acde90[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1addc60[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1addfe0[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1ade440[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x1ade8a0[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1927eb0[0m <[0;33mline:535:5[0m, [0;33mline:537:30[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x1927dc8[0m parent 0x1916c30 prev 0x1926ac8 <[0;33mline:535:5[0m, [0;33mline:537:30[0m> [0;33mcol:7[0m[0;1;36m use_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x1927b80[0m <[0;33mline:535:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x1927d18[0m parent 0x1916c30 prev 0x1926a18 <[0;33mline:536:7[0m, [0;33mline:537:30[0m> [0;33mcol:7[0m[0;1;36m use_facet[0m [0;32m'const _Facet &(const std::locale &)'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1927c20[0m <[0;33mcol:17[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const std::locale &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1948e08[0m[0;1;36m 'use_facet'[0m [0;32m'const std::collate<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x194cdd8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::collate<wchar_t> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acbb58[0m[0;1;36m 'use_facet'[0m [0;32m'const std::ctype<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acc0a8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::numpunct<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acc7b8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_put<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1accec8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_get<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1adc568[0m[0;1;36m 'use_facet'[0m [0;32m'const std::ctype<wchar_t> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1adcab8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::numpunct<wchar_t> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1add1c8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_put<wchar_t> &(const std::locale &)'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x1add8d8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_get<wchar_t> &(const std::locale &)'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1928088[0m <[0;33mline:539:5[0m, [0;33mline:540:21[0m> [0;33mcol:21[0m
[0;34m| `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x1928010[0m parent 0x1916c30 prev 0x19179f0 <[0;33mline:539:5[0m, [0;33mline:540:21[0m> [0;33mcol:21[0m[0;1;36m __use_cache[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x1927ef0[0m <[0;33mline:539:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Cache[0m
[0;34m|   `-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1927f80[0m parent 0x1916c30 prev 0x1917960 <[0;33mline:540:14[0m, [0;33mcol:21[0m> [0;33mcol:21[0m struct[0;1;36m __use_cache[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19280e0[0m <[0;33mline:542:3[0m, [0;33mcol:10[0m> [0;33mcol:3[0m private
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x1928118[0m <[0;33mline:544:5[0m, [0;33mcol:20[0m> [0;33mcol:20[0m referenced[0;1;36m _M_refcount[0m [0;32m'_Atomic_word':'int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19281b0[0m <[0;33mline:545:5[0m, [0;33mcol:21[0m> [0;33mcol:21[0m referenced[0;1;36m _M_facets[0m [0;32m'const std::locale::facet **'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x1928210[0m <[0;33mline:546:5[0m, [0;33mcol:15[0m> [0;33mcol:15[0m referenced[0;1;36m _M_facets_size[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x1928278[0m <[0;33mline:547:5[0m, [0;33mcol:21[0m> [0;33mcol:21[0m referenced[0;1;36m _M_caches[0m [0;32m'const std::locale::facet **'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19282e0[0m <[0;33mline:548:5[0m, [0;33mcol:15[0m> [0;33mcol:15[0m referenced[0;1;36m _M_names[0m [0;32m'char **'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1928430[0m <[0;33mline:549:5[0m, [0;33mcol:48[0m> [0;33mcol:36[0m[0;1;36m _S_id_ctype[0m [0;32m'const locale::id *const[]'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1928510[0m <[0;33mline:550:5[0m, [0;33mcol:50[0m> [0;33mcol:36[0m[0;1;36m _S_id_numeric[0m [0;32m'const locale::id *const[]'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x19285f0[0m <[0;33mline:551:5[0m, [0;33mcol:50[0m> [0;33mcol:36[0m[0;1;36m _S_id_collate[0m [0;32m'const locale::id *const[]'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x19286d0[0m <[0;33mline:552:5[0m, [0;33mcol:47[0m> [0;33mcol:36[0m[0;1;36m _S_id_time[0m [0;32m'const locale::id *const[]'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x19287b0[0m <[0;33mline:553:5[0m, [0;33mcol:51[0m> [0;33mcol:36[0m[0;1;36m _S_id_monetary[0m [0;32m'const locale::id *const[]'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1928890[0m <[0;33mline:554:5[0m, [0;33mcol:51[0m> [0;33mcol:36[0m[0;1;36m _S_id_messages[0m [0;32m'const locale::id *const[]'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1928a30[0m <[0;33mline:555:5[0m, [0;33mcol:63[0m> [0;33mcol:43[0m[0;1;36m _S_facet_categories[0m [0;32m'const locale::id *const *const[]'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1928ac0[0m <[0;33mline:557:5[0m, [0;33mline:559:58[0m> [0;33mline:558:5[0m[0;1;36m _M_add_reference[0m [0;32m'void () throw()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x192af08[0m <[0;33mline:559:5[0m, [0;33mcol:58[0m>
[0;34m|   `-[0m[0;1;35mCallExpr[0m[0;33m 0x192aed8[0m <[0;33mcol:7[0m, [0;33mcol:55[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192aec0[0m <[0;33mcol:7[0m, [0;33mcol:18[0m> [0;32m'void (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192ae18[0m <[0;33mcol:7[0m, [0;33mcol:18[0m> [0;32m'void (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x13c3748[0m[0;1;36m '__atomic_add_dispatch'[0m [0;32m'void (_Atomic_word *, int)'[0m
[0;34m|     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x192ae88[0m <[0;33mcol:40[0m, [0;33mcol:41[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x192ae58[0m <[0;33mcol:41[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x1928118[0m
[0;34m|     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x192ae48[0m <[0;33mcol:41[0m> [0;32m'std::locale::_Impl *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x192aea0[0m <[0;33mcol:54[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1928b88[0m <[0;33mline:561:5[0m, [0;33mline:574:5[0m> [0;33mline:562:5[0m referenced[0;1;36m _M_remove_reference[0m [0;32m'void () throw()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x192b1a0[0m <[0;33mline:563:5[0m, [0;33mline:574:5[0m>
[0;34m|   |-[0m[0;1;35mNullStmt[0m[0;33m 0x192af20[0m <[0;33mline:565:60[0m>
[0;34m|   `-[0m[0;1;35mIfStmt[0m[0;33m 0x192b180[0m <[0;33mline:566:7[0m, [0;33mline:573:2[0m>
[0;34m|     |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x192b0a0[0m <[0;33mline:566:11[0m, [0;33mcol:71[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '=='
[0;34m|     | |-[0m[0;1;35mCallExpr[0m[0;33m 0x192b050[0m <[0;33mcol:11[0m, [0;33mcol:66[0m> [0;32m'_Atomic_word':'int'[0m[0;36m[0m[0;36m[0m
[0;34m|     | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b038[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;32m'_Atomic_word (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192af78[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;32m'_Atomic_word (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x13c30f8[0m[0;1;36m '__exchange_and_add_dispatch'[0m [0;32m'_Atomic_word (_Atomic_word *, int)'[0m
[0;34m|     | | |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x192afe8[0m <[0;33mcol:50[0m, [0;33mcol:51[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|     | | | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x192afb8[0m <[0;33mcol:51[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x1928118[0m
[0;34m|     | | |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x192afa8[0m <[0;33mcol:51[0m> [0;32m'std::locale::_Impl *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     | | `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x192b020[0m <[0;33mcol:64[0m, [0;33mcol:65[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m prefix '-'
[0;34m|     | |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x192b000[0m <[0;33mcol:65[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x192b080[0m <[0;33mcol:71[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x192b160[0m <[0;33mline:567:2[0m, [0;33mline:573:2[0m>
[0;34m|       |-[0m[0;1;35mNullStmt[0m[0;33m 0x192b0c0[0m <[0;33mline:568:63[0m>
[0;34m|       `-[0m[0;1;35mCXXTryStmt[0m[0;33m 0x192b140[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/exception_defines.h:40:21[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:572:8[0m>
[0;34m|         |-[0m[0;1;35mCompoundStmt[0m[0;33m 0x192b0f8[0m <[0;33mline:570:6[0m, [0;33mcol:21[0m>
[0;34m|         | `-[0m[0;1;35mCXXDeleteExpr[0m[0;33m 0x192b0d8[0m <[0;33mcol:8[0m, [0;33mcol:15[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1132850[0m[0;1;36m 'operator delete'[0m [0;32m'void (void *) noexcept'[0m
[0;34m|         |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x192b0c8[0m <[0;33mcol:15[0m> [0;32m'std::locale::_Impl *'[0m[0;36m[0m[0;36m[0m this
[0;34m|         `-[0m[0;1;35mCXXCatchStmt[0m[0;33m 0x192b120[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/exception_defines.h:41:21[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:572:8[0m>
[0;34m|           |-[0m[0;34m<<<NULL>>>[0m
[0;34m|           `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x192b110[0m <[0;33mcol:6[0m, [0;33mcol:8[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1928e08[0m <[0;33mline:576:5[0m, [0;33mcol:31[0m> [0;33mcol:5[0m referenced[0;1;36m _Impl[0m [0;32m'void (const std::locale::_Impl &, std::size_t)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1928c68[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const std::locale::_Impl &'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1928ce0[0m <[0;33mcol:25[0m> [0;33mcol:31[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1929028[0m <[0;33mline:577:5[0m, [0;33mcol:30[0m> [0;33mcol:5[0m[0;1;36m _Impl[0m [0;32m'void (const char *, std::size_t)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1928ed8[0m <[0;33mcol:11[0m, [0;33mcol:21[0m> [0;33mcol:22[0m [0;32m'const char *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1928f50[0m <[0;33mcol:24[0m> [0;33mcol:30[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1929198[0m <[0;33mline:578:5[0m, [0;33mcol:25[0m> [0;33mcol:5[0m[0;1;36m _Impl[0m [0;32m'void (std::size_t) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929100[0m <[0;33mcol:11[0m> [0;33mcol:17[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x19292a8[0m <[0;33mline:580:4[0m, [0;33mcol:19[0m> [0;33mcol:4[0m used[0;1;36m ~_Impl[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1929428[0m <[0;33mline:582:5[0m, [0;33mcol:23[0m> [0;33mcol:5[0m[0;1;36m _Impl[0m [0;32m'void (const std::locale::_Impl &)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929368[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const std::locale::_Impl &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1929588[0m <[0;33mline:584:5[0m, [0;33mline:585:27[0m> [0;33mcol:5[0m[0;1;36m operator=[0m [0;32m'void (const std::locale::_Impl &)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19294f8[0m <[0;33mcol:15[0m, [0;33mcol:26[0m> [0;33mcol:27[0m [0;32m'const std::locale::_Impl &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1929650[0m <[0;33mline:587:5[0m, [0;33mline:596:5[0m> [0;33mline:588:5[0m[0;1;36m _M_check_same_name[0m [0;32m'bool ()'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x192ba28[0m <[0;33mline:589:5[0m, [0;33mline:596:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x192b248[0m <[0;33mline:590:7[0m, [0;33mcol:24[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x192b1d0[0m <[0;33mcol:7[0m, [0;33mcol:20[0m> [0;33mcol:12[0m used[0;1;36m __ret[0m [0;32m'bool'[0m cinit
[0;34m|   |   `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x192b238[0m <[0;33mcol:20[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|   |-[0m[0;1;35mIfStmt[0m[0;33m 0x192b9c0[0m <[0;33mline:591:7[0m, [0;33mline:594:66[0m>
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b358[0m <[0;33mline:591:11[0m, [0;33mcol:21[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m <[0;31mPointerToBoolean[0m>
[0;34m|   | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b340[0m <[0;33mcol:11[0m, [0;33mcol:21[0m> [0;32m'char *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   | |   `-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x192b320[0m <[0;33mcol:11[0m, [0;33mcol:21[0m> [0;32m'char *'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   | |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b308[0m <[0;33mcol:11[0m> [0;32m'char **'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   | |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x192b2b8[0m <[0;33mcol:11[0m> [0;32m'char **'[0m[0;36m lvalue[0m[0;36m[0m ->_M_names[0;33m 0x19282e0[0m
[0;34m|   | |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x192b2a8[0m <[0;33mcol:11[0m> [0;32m'std::locale::_Impl *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | |     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x192b2e8[0m <[0;33mcol:20[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|   | `-[0m[0;1;35mForStmt[0m[0;33m 0x192b988[0m <[0;33mline:593:2[0m, [0;33mline:594:66[0m>
[0;34m|   |   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x192b420[0m <[0;33mline:593:7[0m, [0;33mcol:21[0m>
[0;34m|   |   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x192b380[0m <[0;33mcol:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m used[0;1;36m __i[0m [0;32m'std::size_t':'unsigned long'[0m cinit
[0;34m|   |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b408[0m <[0;33mcol:20[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   |   |     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x192b3e8[0m <[0;33mcol:20[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|   |   |-[0m[0;34m<<<NULL>>>[0m
[0;34m|   |   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x192b600[0m <[0;33mcol:23[0m, [0;33mcol:59[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '&&'
[0;34m|   |   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b5e8[0m <[0;33mcol:23[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b438[0m <[0;33mcol:23[0m> [0;32m'bool'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x192b1d0[0m[0;1;36m '__ret'[0m [0;32m'bool'[0m
[0;34m|   |   | `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x192b5c8[0m <[0;33mcol:32[0m, [0;33mcol:59[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '<'
[0;34m|   |   |   |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b598[0m <[0;33mcol:32[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   |   | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b458[0m <[0;33mcol:32[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x192b380[0m[0;1;36m '__i'[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|   |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b5b0[0m <[0;33mcol:38[0m, [0;33mcol:59[0m> [0;32m'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   |   |     `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x192b578[0m <[0;33mcol:38[0m, [0;33mcol:59[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '-'
[0;34m|   |   |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b560[0m <[0;33mcol:38[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   |   |       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b4c0[0m <[0;33mcol:38[0m> [0;32m'std::locale::(unnamed enum at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:335:5)'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x191b2e0[0m[0;1;36m '_S_categories_size'[0m [0;32m'std::locale::(unnamed enum at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:335:5)'[0m
[0;34m|   |   |       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x192b4e0[0m <[0;33mcol:59[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|   |   |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x192b640[0m <[0;33mcol:62[0m, [0;33mcol:64[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m prefix '++'
[0;34m|   |   | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b620[0m <[0;33mcol:64[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x192b380[0m[0;1;36m '__i'[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|   |   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x192b968[0m <[0;33mline:594:4[0m, [0;33mcol:66[0m> [0;32m'bool'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   |     |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b658[0m <[0;33mcol:4[0m> [0;32m'bool'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x192b1d0[0m[0;1;36m '__ret'[0m [0;32m'bool'[0m
[0;34m|   |     `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x192b948[0m <[0;33mcol:12[0m, [0;33mcol:66[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '=='
[0;34m|   |       |-[0m[0;1;35mCallExpr[0m[0;33m 0x192b898[0m <[0;33mcol:12[0m, [0;33mcol:61[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m|   |       | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b880[0m <[0;33mcol:12[0m> [0;32m'int (*)(const char *, const char *) noexcept'[0m[0;36m[0m[0;36m[0m <[0;31mBuiltinFnToFnPtr[0m>
[0;34m|   |       | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b678[0m <[0;33mcol:12[0m> [0;32m'<builtin fn type>'[0m[0;36m[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1129d78[0m[0;1;36m '__builtin_strcmp'[0m [0;32m'int (const char *, const char *) noexcept'[0m
[0;34m|   |       | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b8e0[0m <[0;33mcol:29[0m, [0;33mcol:41[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |       | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b8c8[0m <[0;33mcol:29[0m, [0;33mcol:41[0m> [0;32m'char *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | |   `-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x192b728[0m <[0;33mcol:29[0m, [0;33mcol:41[0m> [0;32m'char *'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |       | |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b6f8[0m <[0;33mcol:29[0m> [0;32m'char **'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x192b6a8[0m <[0;33mcol:29[0m> [0;32m'char **'[0m[0;36m lvalue[0m[0;36m[0m ->_M_names[0;33m 0x19282e0[0m
[0;34m|   |       | |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x192b698[0m <[0;33mcol:29[0m> [0;32m'std::locale::_Impl *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |       | |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b710[0m <[0;33mcol:38[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | |       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b6d8[0m <[0;33mcol:38[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x192b380[0m[0;1;36m '__i'[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|   |       | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b910[0m <[0;33mcol:44[0m, [0;33mcol:60[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |       |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b8f8[0m <[0;33mcol:44[0m, [0;33mcol:60[0m> [0;32m'char *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       |     `-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x192b830[0m <[0;33mcol:44[0m, [0;33mcol:60[0m> [0;32m'char *'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |       |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b818[0m <[0;33mcol:44[0m> [0;32m'char **'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       |       | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x192b758[0m <[0;33mcol:44[0m> [0;32m'char **'[0m[0;36m lvalue[0m[0;36m[0m ->_M_names[0;33m 0x19282e0[0m
[0;34m|   |       |       |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x192b748[0m <[0;33mcol:44[0m> [0;32m'std::locale::_Impl *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |       |       `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x192b7f8[0m <[0;33mcol:53[0m, [0;33mcol:59[0m> [0;32m'unsigned long'[0m[0;36m[0m[0;36m[0m '+'
[0;34m|   |       |         |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b7c8[0m <[0;33mcol:53[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       |         | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b788[0m <[0;33mcol:53[0m> [0;32m'std::size_t':'unsigned long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x192b380[0m[0;1;36m '__i'[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|   |       |         `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192b7e0[0m <[0;33mcol:59[0m> [0;32m'unsigned long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   |       |           `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x192b7a8[0m <[0;33mcol:59[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|   |       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x192b928[0m <[0;33mcol:66[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x192ba18[0m <[0;33mline:595:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x192ba00[0m <[0;33mcol:14[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192b9e0[0m <[0;33mcol:14[0m> [0;32m'bool'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x192b1d0[0m[0;1;36m '__ret'[0m [0;32m'bool'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19298b8[0m <[0;33mline:598:5[0m, [0;33mline:599:49[0m> [0;33mcol:5[0m[0;1;36m _M_replace_categories[0m [0;32m'void (const std::locale::_Impl *, std::locale::category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929728[0m <[0;33mcol:27[0m, [0;33mcol:38[0m> [0;33mcol:39[0m [0;32m'const std::locale::_Impl *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19297a0[0m <[0;33mcol:41[0m> [0;33mcol:49[0m [0;32m'std::locale::category':'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1929b58[0m <[0;33mline:601:5[0m, [0;33mline:602:63[0m> [0;33mcol:5[0m[0;1;36m _M_replace_category[0m [0;32m'void (const std::locale::_Impl *, const locale::id *const *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929978[0m <[0;33mcol:25[0m, [0;33mcol:36[0m> [0;33mcol:37[0m [0;32m'const std::locale::_Impl *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929a48[0m <[0;33mcol:39[0m, [0;33mcol:62[0m> [0;33mcol:63[0m [0;32m'const locale::id *const *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1929df8[0m <[0;33mline:604:5[0m, [0;33mline:605:53[0m> [0;33mcol:5[0m referenced[0;1;36m _M_replace_facet[0m [0;32m'void (const std::locale::_Impl *, const locale::id *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929c18[0m <[0;33mcol:22[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const std::locale::_Impl *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929ce8[0m <[0;33mcol:36[0m, [0;33mcol:52[0m> [0;33mcol:53[0m [0;32m'const locale::id *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x192a098[0m <[0;33mline:607:5[0m, [0;33mline:608:53[0m> [0;33mcol:5[0m referenced[0;1;36m _M_install_facet[0m [0;32m'void (const locale::id *, const std::locale::facet *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929f10[0m <[0;33mcol:22[0m, [0;33mcol:38[0m> [0;33mcol:39[0m [0;32m'const locale::id *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1929f88[0m <[0;33mcol:41[0m, [0;33mcol:52[0m> [0;33mcol:53[0m [0;32m'const std::locale::facet *'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x192a378[0m <[0;33mline:610:5[0m, [0;33mline:613:49[0m> [0;33mline:612:7[0m[0;1;36m _M_init_facet[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x192a148[0m <[0;33mline:610:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x192a2d8[0m <[0;33mline:611:7[0m, [0;33mline:613:49[0m> [0;33mline:612:7[0m[0;1;36m _M_init_facet[0m [0;32m'void (_Facet *)'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192a218[0m <[0;33mcol:21[0m, [0;33mcol:29[0m> [0;33mcol:29[0m referenced[0;1;36m __facet[0m [0;32m'_Facet *'[0m
[0;34m|   `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x192bbc8[0m <[0;33mline:613:7[0m, [0;33mcol:49[0m>
[0;34m|     `-[0m[0;1;35mCallExpr[0m[0;33m 0x192bb98[0m <[0;33mcol:9[0m, [0;33mcol:46[0m> [0;32m'<dependent type>'[0m[0;36m[0m[0;36m[0m
[0;34m|       |-[0m[0;1;35mMemberExpr[0m[0;33m 0x192baa8[0m <[0;33mcol:9[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->_M_install_facet[0;33m 0x192a098[0m
[0;34m|       | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x192ba98[0m <[0;33mcol:9[0m> [0;32m'std::locale::_Impl *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|       |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x192bb60[0m <[0;33mcol:26[0m, [0;33mcol:35[0m> [0;32m'<dependent type>'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|       | `-[0m[0;1;35mDependentScopeDeclRefExpr[0m[0;33m 0x192bb28[0m <[0;33mcol:27[0m, [0;33mcol:35[0m> [0;32m'<dependent type>'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192bb78[0m <[0;33mcol:39[0m> [0;32m'_Facet *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x192a218[0m[0;1;36m '__facet'[0m [0;32m'_Facet *'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x192a608[0m <[0;33mline:615:5[0m, [0;33mline:621:7[0m> [0;33mline:617:7[0m[0;1;36m _M_init_facet_unchecked[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x192a3d8[0m <[0;33mline:615:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x192a568[0m <[0;33mline:616:7[0m, [0;33mline:621:7[0m> [0;33mline:617:7[0m[0;1;36m _M_init_facet_unchecked[0m [0;32m'void (_Facet *)'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192a4a8[0m <[0;33mcol:31[0m, [0;33mcol:39[0m> [0;33mcol:39[0m referenced[0;1;36m __facet[0m [0;32m'_Facet *'[0m
[0;34m|   `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x192be50[0m <[0;33mline:618:7[0m, [0;33mline:621:7[0m>
[0;34m|     |-[0m[0;1;35mCallExpr[0m[0;33m 0x192bc48[0m <[0;33mline:619:2[0m, [0;33mcol:28[0m> [0;32m'<dependent type>'[0m[0;36m[0m[0;36m[0m
[0;34m|     | `-[0m[0;1;35mCXXDependentScopeMemberExpr[0m[0;33m 0x192bc00[0m <[0;33mcol:2[0m, [0;33mcol:11[0m> [0;32m'<dependent type>'[0m[0;36m lvalue[0m[0;36m[0m ->_M_add_reference
[0;34m|     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192bbe0[0m <[0;33mcol:2[0m> [0;32m'_Facet *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x192a4a8[0m[0;1;36m '__facet'[0m [0;32m'_Facet *'[0m
[0;34m|     `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x192be30[0m <[0;33mline:620:2[0m, [0;33mcol:34[0m> [0;32m'<dependent type>'[0m[0;36m[0m[0;36m[0m '='
[0;34m|       |-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x192bdf0[0m <[0;33mcol:2[0m, [0;33mcol:30[0m> [0;32m'<dependent type>'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|       | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x192bcc0[0m <[0;33mcol:2[0m> [0;32m'const std::locale::facet **'[0m[0;36m lvalue[0m[0;36m[0m ->_M_facets[0;33m 0x19281b0[0m
[0;34m|       | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x192bcb0[0m <[0;33mcol:2[0m> [0;32m'std::locale::_Impl *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|       | `-[0m[0;1;35mCallExpr[0m[0;33m 0x192bdd0[0m <[0;33mcol:12[0m, [0;33mcol:29[0m> [0;32m'<dependent type>'[0m[0;36m[0m[0;36m[0m
[0;34m|       |   `-[0m[0;1;35mCXXDependentScopeMemberExpr[0m[0;33m 0x192bd88[0m <[0;33mcol:12[0m, [0;33mcol:23[0m> [0;32m'<dependent type>'[0m[0;36m lvalue[0m[0;36m[0m ._M_id
[0;34m|       |     `-[0m[0;1;35mCXXDependentScopeMemberExpr[0m[0;33m 0x192bd40[0m <[0;33mcol:12[0m, [0;33mcol:20[0m> [0;32m'<dependent type>'[0m[0;36m lvalue[0m[0;36m[0m ->id
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x192be10[0m <[0;33mcol:34[0m> [0;32m'_Facet *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x192a4a8[0m[0;1;36m '__facet'[0m [0;32m'_Facet *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x192a808[0m <[0;33mline:623:5[0m, [0;33mline:624:42[0m> [0;33mcol:5[0m referenced[0;1;36m _M_install_cache[0m [0;32m'void (const std::locale::facet *, std::size_t)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192a678[0m <[0;33mcol:22[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const std::locale::facet *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192a6f0[0m <[0;33mcol:36[0m> [0;33mcol:42[0m [0;32m'std::size_t':'unsigned long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x192a9c8[0m <[0;33mline:626:5[0m, [0;33mcol:31[0m> [0;33mcol:10[0m[0;1;36m _M_init_extra[0m [0;32m'void (std::locale::facet **)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192a900[0m <[0;33mcol:24[0m, [0;33mcol:30[0m> [0;33mcol:31[0m [0;32m'std::locale::facet **'[0m
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x192acf8[0m <[0;33mline:627:5[0m, [0;33mcol:62[0m> [0;33mcol:10[0m[0;1;36m _M_init_extra[0m [0;32m'void (void *, void *, const char *, const char *)'[0m
[0;34m  |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192aa88[0m <[0;33mcol:24[0m, [0;33mcol:28[0m> [0;33mcol:29[0m [0;32m'void *'[0m
[0;34m  |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192ab08[0m <[0;33mcol:31[0m, [0;33mcol:35[0m> [0;33mcol:36[0m [0;32m'void *'[0m
[0;34m  |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192ab88[0m <[0;33mcol:38[0m, [0;33mcol:48[0m> [0;33mcol:49[0m [0;32m'const char *'[0m
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x192ac08[0m <[0;33mcol:51[0m, [0;33mcol:61[0m> [0;33mcol:62[0m [0;32m'const char *'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
  NonVirtualBaseLLVMType:%"class.std::locale::_Impl" = type { i32, %"class.std::locale::facet"**, i64, %"class.std::locale::facet"**, i8** }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x1916cf8[0m prev 0x130cf68 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:62:3[0m, [0;33mline:359:3[0m> [0;33mline:62:9[0m referenced class[0;1;36m locale[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m standard_layout has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1916df0[0m <[0;33mcol:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m implicit referenced class[0;1;36m locale[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x1916e80[0m <[0;33mline:64:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x1916ec0[0m <[0;33mline:67:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m category[0m [0;32m'int'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0xfe99f0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1916f18[0m <[0;33mline:70:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m class[0;1;36m facet[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1916fd0[0m <[0;33mline:71:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced class[0;1;36m id[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1917080[0m <[0;33mline:72:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced class[0;1;36m _Impl[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1917180[0m <[0;33mline:74:5[0m, [0;33mcol:18[0m> [0;33mcol:12[0m [0;32m'class facet':'std::locale::facet'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1917210[0m <[0;33mline:75:5[0m, [0;33mcol:18[0m> [0;33mcol:12[0m [0;32m'class _Impl':'std::locale::_Impl'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1917520[0m <[0;33mline:77:5[0m, [0;33mline:79:38[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x1917438[0m parent 0x1916c30 prev 0x130d280 <[0;33mline:77:5[0m, [0;33mline:79:38[0m> [0;33mcol:7[0m[0;1;36m has_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x1917250[0m <[0;33mline:77:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x1917388[0m parent 0x1916c30 prev 0x130d1e0 <[0;33mline:78:7[0m, [0;33mline:79:38[0m> [0;33mcol:7[0m[0;1;36m has_facet[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19172f0[0m <[0;33mcol:17[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const std::locale &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1949190[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x194d160[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acd250[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acd5d0[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acda30[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acde90[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1addc60[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1addfe0[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1ade440[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x1ade8a0[0m[0;1;36m 'has_facet'[0m [0;32m'bool (const std::locale &) throw()'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1917890[0m <[0;33mline:81:5[0m, [0;33mline:83:30[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x19177a8[0m parent 0x1916c30 prev 0x130d5c8 <[0;33mline:81:5[0m, [0;33mline:83:30[0m> [0;33mcol:7[0m[0;1;36m use_facet[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x1917560[0m <[0;33mline:81:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19176f8[0m parent 0x1916c30 prev 0x130d528 <[0;33mline:82:7[0m, [0;33mline:83:30[0m> [0;33mcol:7[0m[0;1;36m use_facet[0m [0;32m'const _Facet &(const std::locale &)'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1917600[0m <[0;33mcol:17[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const std::locale &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1948e08[0m[0;1;36m 'use_facet'[0m [0;32m'const std::collate<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x194cdd8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::collate<wchar_t> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acbb58[0m[0;1;36m 'use_facet'[0m [0;32m'const std::ctype<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acc0a8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::numpunct<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1acc7b8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_put<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1accec8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_get<char> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1adc568[0m[0;1;36m 'use_facet'[0m [0;32m'const std::ctype<wchar_t> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1adcab8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::numpunct<wchar_t> &(const std::locale &)'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x1add1c8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_put<wchar_t> &(const std::locale &)'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x1add8d8[0m[0;1;36m 'use_facet'[0m [0;32m'const std::num_get<wchar_t> &(const std::locale &)'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x1917be8[0m <[0;33mline:85:5[0m, [0;33mline:86:21[0m> [0;33mcol:21[0m
[0;34m| `-[0m[0;1;32mClassTemplateDecl[0m[0;33m 0x19179f0[0m parent 0x1916c30 <[0;33mline:85:5[0m, [0;33mline:86:21[0m> [0;33mcol:21[0m[0;1;36m __use_cache[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19178d0[0m <[0;33mline:85:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Cache[0m
[0;34m|   `-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x1917960[0m parent 0x1916c30 <[0;33mline:86:14[0m, [0;33mcol:21[0m> [0;33mcol:21[0m struct[0;1;36m __use_cache[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1917c70[0m <[0;33mline:98:5[0m, [0;33mcol:35[0m> [0;33mcol:27[0m[0;1;36m none[0m [0;32m'const std::locale::category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1917cd8[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1917d60[0m <[0;33mline:99:5[0m, [0;33mcol:42[0m> [0;33mcol:27[0m referenced[0;1;36m ctype[0m [0;32m'const std::locale::category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1917e28[0m <[0;33mcol:36[0m, [0;33mcol:42[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1917e08[0m <[0;33mcol:36[0m, [0;33mcol:42[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1917dc8[0m <[0;33mcol:36[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1917de8[0m <[0;33mcol:42[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1917ea8[0m <[0;33mline:100:5[0m, [0;33mcol:43[0m> [0;33mcol:27[0m referenced[0;1;36m numeric[0m [0;32m'const std::locale::category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1917f70[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1917f50[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1917f10[0m <[0;33mcol:37[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1917f30[0m <[0;33mcol:43[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1917ff0[0m <[0;33mline:101:5[0m, [0;33mcol:43[0m> [0;33mcol:27[0m referenced[0;1;36m collate[0m [0;32m'const std::locale::category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19180b8[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1918098[0m <[0;33mcol:37[0m, [0;33mcol:43[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1918058[0m <[0;33mcol:37[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1918078[0m <[0;33mcol:43[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 2[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1918138[0m <[0;33mline:102:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m time[0m [0;32m'const std::locale::category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1918200[0m <[0;33mcol:35[0m, [0;33mcol:41[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19181e0[0m <[0;33mcol:35[0m, [0;33mcol:41[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19181a0[0m <[0;33mcol:35[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19181c0[0m <[0;33mcol:41[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 3[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1918280[0m <[0;33mline:103:5[0m, [0;33mcol:44[0m> [0;33mcol:27[0m referenced[0;1;36m monetary[0m [0;32m'const std::locale::category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1918348[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1918328[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19182e8[0m <[0;33mcol:38[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1918308[0m <[0;33mcol:44[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 4[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x19183c8[0m <[0;33mline:104:5[0m, [0;33mcol:44[0m> [0;33mcol:27[0m referenced[0;1;36m messages[0m [0;32m'const std::locale::category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1918490[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1918470[0m <[0;33mcol:38[0m, [0;33mcol:44[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m '<<'
[0;34m|     |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1918430[0m <[0;33mcol:38[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x1918450[0m <[0;33mcol:44[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 5[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x1918510[0m <[0;33mline:105:5[0m, [0;33mline:106:36[0m> [0;33mline:105:27[0m[0;1;36m all[0m [0;32m'const std::locale::category':'const int'[0m static cinit
[0;34m| `-[0m[0;1;35mParenExpr[0m[0;33m 0x1918870[0m <[0;33mcol:34[0m, [0;33mline:106:36[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m|   `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1918850[0m <[0;33mline:105:35[0m, [0;33mline:106:28[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19187d8[0m <[0;33mline:105:35[0m, [0;33mline:106:17[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1918760[0m <[0;33mline:105:35[0m, [0;33mline:106:9[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19186e8[0m <[0;33mline:105:35[0m, [0;33mcol:53[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x1918670[0m <[0;33mcol:35[0m, [0;33mcol:43[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '|'
[0;34m|     | | | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1918620[0m <[0;33mcol:35[0m> [0;32m'std::locale::category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1918600[0m <[0;33mcol:35[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x1917d60[0m[0;1;36m 'ctype'[0m [0;32m'const std::locale::category':'const int'[0m non_odr_use_constant
[0;34m|     | | | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1918658[0m <[0;33mcol:43[0m> [0;32m'std::locale::category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1918638[0m <[0;33mcol:43[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x1917ea8[0m[0;1;36m 'numeric'[0m [0;32m'const std::locale::category':'const int'[0m non_odr_use_constant
[0;34m|     | | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19186d0[0m <[0;33mcol:53[0m> [0;32m'std::locale::category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19186b0[0m <[0;33mcol:53[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x1917ff0[0m[0;1;36m 'collate'[0m [0;32m'const std::locale::category':'const int'[0m non_odr_use_constant
[0;34m|     | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1918748[0m <[0;33mline:106:9[0m> [0;32m'std::locale::category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1918728[0m <[0;33mcol:9[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x1918138[0m[0;1;36m 'time'[0m [0;32m'const std::locale::category':'const int'[0m non_odr_use_constant
[0;34m|     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19187c0[0m <[0;33mcol:17[0m> [0;32m'std::locale::category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19187a0[0m <[0;33mcol:17[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x1918280[0m[0;1;36m 'monetary'[0m [0;32m'const std::locale::category':'const int'[0m non_odr_use_constant
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x1918838[0m <[0;33mcol:28[0m> [0;32m'std::locale::category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x1918818[0m <[0;33mcol:28[0m> [0;32m'const std::locale::category':'const int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19183c8[0m[0;1;36m 'messages'[0m [0;32m'const std::locale::category':'const int'[0m non_odr_use_constant
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1918958[0m <[0;33mline:117:5[0m, [0;33mcol:20[0m> [0;33mcol:5[0m referenced[0;1;36m locale[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1918b10[0m <[0;33mline:126:5[0m, [0;33mcol:41[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const std::locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1918a10[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __other[0m [0;32m'const std::locale &'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1918c78[0m <[0;33mline:136:5[0m, [0;33mline:137:27[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const char *)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1918be8[0m <[0;33mcol:12[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __s[0m [0;32m'const char *'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1918f68[0m <[0;33mline:151:5[0m, [0;33mcol:65[0m> [0;33mcol:5[0m used[0;1;36m locale[0m [0;32m'void (const std::locale &, const char *, std::locale::category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1918d48[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __base[0m [0;32m'const std::locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1918dc8[0m <[0;33mcol:34[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __s[0m [0;32m'const char *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1918e40[0m <[0;33mcol:51[0m, [0;33mcol:60[0m> [0;33mcol:60[0m[0;1;36m __cat[0m [0;32m'std::locale::category':'int'[0m
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19191c8[0m <[0;33mline:162:5[0m, [0;33mline:163:60[0m> [0;33mcol:5[0m[0;1;36m locale[0m [0;32m'void (const std::string &)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1919100[0m <[0;33mcol:12[0m, [0;33mcol:31[0m> [0;33mcol:31[0m used[0;1;36m __s[0m [0;32m'const std::string &'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'std::locale'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x191be50[0m <[0;33mcol:38[0m, [0;33mcol:56[0m> [0;32m'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const char *)'[0m
[0;34m| |   `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x191bd10[0m <[0;33mcol:45[0m, [0;33mcol:55[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m
[0;34m| |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x191bce0[0m <[0;33mcol:45[0m, [0;33mcol:49[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m .c_str[0;33m 0x17eb370[0m
[0;34m| |       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x191bcc0[0m <[0;33mcol:45[0m> [0;32m'const std::string':'const std::basic_string<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x1919100[0m[0;1;36m '__s'[0m [0;32m'const std::string &'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x191bea8[0m <[0;33mcol:58[0m, [0;33mcol:60[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19194f8[0m <[0;33mline:177:5[0m, [0;33mline:178:44[0m> [0;33mline:177:5[0m[0;1;36m locale[0m [0;32m'void (const std::locale &, const std::string &, std::locale::category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1919298[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m used[0;1;36m __base[0m [0;32m'const std::locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1919358[0m <[0;33mcol:34[0m, [0;33mcol:53[0m> [0;33mcol:53[0m used[0;1;36m __s[0m [0;32m'const std::string &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19193d0[0m <[0;33mcol:58[0m, [0;33mcol:67[0m> [0;33mcol:67[0m used[0;1;36m __cat[0m [0;32m'std::locale::category':'int'[0m
[0;34m| |-[0mCXXCtorInitializer [0;32m'std::locale'[0m
[0;34m| | `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x191bfc0[0m <[0;33mline:178:7[0m, [0;33mcol:40[0m> [0;32m'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const std::locale &, const char *, std::locale::category)'[0m
[0;34m| |   |-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x191beb8[0m <[0;33mcol:14[0m> [0;32m'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x1919298[0m[0;1;36m '__base'[0m [0;32m'const std::locale &'[0m
[0;34m| |   |-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x191bf28[0m <[0;33mcol:22[0m, [0;33mcol:32[0m> [0;32m'const char *'[0m[0;36m[0m[0;36m[0m
[0;34m| |   | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x191bef8[0m <[0;33mcol:22[0m, [0;33mcol:26[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m .c_str[0;33m 0x17eb370[0m
[0;34m| |   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x191bed8[0m <[0;33mcol:22[0m> [0;32m'const std::string':'const std::basic_string<char>'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x1919358[0m[0;1;36m '__s'[0m [0;32m'const std::string &'[0m
[0;34m| |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x191bfa8[0m <[0;33mcol:35[0m> [0;32m'std::locale::category':'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x191bf48[0m <[0;33mcol:35[0m> [0;32m'std::locale::category':'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19193d0[0m[0;1;36m '__cat'[0m [0;32m'std::locale::category':'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x191c028[0m <[0;33mcol:42[0m, [0;33mcol:44[0m>
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19197e8[0m <[0;33mline:192:5[0m, [0;33mcol:69[0m> [0;33mcol:5[0m[0;1;36m locale[0m [0;32m'void (const std::locale &, const std::locale &, std::locale::category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19195d8[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __base[0m [0;32m'const std::locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1919650[0m <[0;33mcol:34[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __add[0m [0;32m'const std::locale &'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19196c8[0m <[0;33mcol:55[0m, [0;33mcol:64[0m> [0;33mcol:64[0m[0;1;36m __cat[0m [0;32m'std::locale::category':'int'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x1919bc0[0m <[0;33mline:205:5[0m, [0;33mline:206:48[0m> [0;33mcol:7[0m[0;1;36m locale[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19198b8[0m <[0;33mline:205:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m| `-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x1919b18[0m <[0;33mline:206:7[0m, [0;33mcol:48[0m> [0;33mcol:7[0m[0;1;36m locale[0m [0;32m'void (const std::locale &, _Facet *)'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1919960[0m <[0;33mcol:14[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m __other[0m [0;32m'const std::locale &'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1919a08[0m <[0;33mcol:37[0m, [0;33mcol:45[0m> [0;33mcol:45[0m[0;1;36m __f[0m [0;32m'_Facet *'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x1919c88[0m <[0;33mline:209:5[0m, [0;33mcol:21[0m> [0;33mcol:5[0m used[0;1;36m ~locale[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x1919e40[0m <[0;33mline:219:5[0m, [0;33mline:220:44[0m> [0;33mcol:5[0m referenced[0;1;36m operator=[0m [0;32m'const std::locale &(const std::locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1919d48[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __other[0m [0;32m'const std::locale &'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x191a128[0m <[0;33mline:234:5[0m, [0;33mline:236:38[0m> [0;33mcol:7[0m[0;1;36m combine[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x1919ee8[0m <[0;33mline:234:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m typename depth 0 index 0[0;1;36m _Facet[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191a088[0m <[0;33mline:235:7[0m, [0;33mline:236:38[0m> [0;33mcol:7[0m[0;1;36m combine[0m [0;32m'std::locale (const std::locale &) const'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x1919f90[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __other[0m [0;32m'const std::locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191a228[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:136:33[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:245:12[0m> [0;33mcol:5[0m[0;1;36m name[0m [0;32m'std::string () const'[0m
[0;34m| `-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x191a2c8[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:136:47[0m, [0;33mcol:67[0m> cxx11
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191a450[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:254:5[0m, [0;33mline:255:51[0m> [0;33mcol:5[0m used[0;1;36m operator==[0m [0;32m'bool (const std::locale &) const throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191a358[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __other[0m [0;32m'const std::locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191a5a0[0m <[0;33mline:264:5[0m, [0;33mline:266:44[0m> [0;33mline:265:5[0m[0;1;36m operator!=[0m [0;32m'bool (const std::locale &) const throw()'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191a508[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;33mcol:30[0m used[0;1;36m __other[0m [0;32m'const std::locale &'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x1924140[0m <[0;33mline:266:5[0m, [0;33mcol:44[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x1924130[0m <[0;33mcol:7[0m, [0;33mcol:41[0m>
[0;34m|     `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x1924118[0m <[0;33mcol:14[0m, [0;33mcol:41[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m prefix '!' cannot overflow
[0;34m|       `-[0m[0;1;35mParenExpr[0m[0;33m 0x19240f8[0m <[0;33mcol:15[0m, [0;33mcol:41[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|         `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x19240d0[0m <[0;33mcol:16[0m, [0;33mcol:40[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|           |-[0m[0;1;35mMemberExpr[0m[0;33m 0x191c048[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->operator==[0;33m 0x191a450[0m
[0;34m|           | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x191c038[0m <[0;33mcol:16[0m> [0;32m'const std::locale *'[0m[0;36m[0m[0;36m[0m this
[0;34m|           `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19240b0[0m <[0;33mcol:33[0m> [0;32m'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x191a508[0m[0;1;36m '__other'[0m [0;32m'const std::locale &'[0m
[0;34m|-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x191ac78[0m <[0;33mline:284:5[0m, [0;33mline:287:54[0m> [0;33mline:286:7[0m[0;1;36m operator()[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x191a648[0m <[0;33mline:284:14[0m, [0;33mcol:23[0m> [0;33mcol:23[0m referenced typename depth 0 index 0[0;1;36m _Char[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x191a6c8[0m <[0;33mcol:30[0m, [0;33mcol:39[0m> [0;33mcol:39[0m referenced typename depth 0 index 1[0;1;36m _Traits[0m
[0;34m| |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x191a748[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;33mcol:57[0m referenced typename depth 0 index 2[0;1;36m _Alloc[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191abd8[0m <[0;33mline:285:7[0m, [0;33mline:287:54[0m> [0;33mline:286:7[0m[0;1;36m operator()[0m [0;32m'bool (const basic_string<_Char, _Traits, _Alloc> &, const basic_string<_Char, _Traits, _Alloc> &) const'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191a920[0m <[0;33mcol:18[0m, [0;33mcol:62[0m> [0;33mcol:62[0m[0;1;36m __s1[0m [0;32m'const basic_string<_Char, _Traits, _Alloc> &'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191aac0[0m <[0;33mline:287:4[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __s2[0m [0;32m'const basic_string<_Char, _Traits, _Alloc> &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191adb8[0m <[0;33mline:300:5[0m, [0;33mline:301:31[0m> [0;33mcol:5[0m[0;1;36m global[0m [0;32m'std::locale (const std::locale &)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191acf0[0m <[0;33mcol:12[0m, [0;33mcol:26[0m> [0;33mcol:26[0m[0;1;36m __loc[0m [0;32m'const std::locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191aea8[0m <[0;33mline:306:5[0m, [0;33mline:307:13[0m> [0;33mcol:5[0m[0;1;36m classic[0m [0;32m'const std::locale &()'[0m static
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x191af48[0m <[0;33mline:309:3[0m, [0;33mcol:10[0m> [0;33mcol:3[0m private
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x191afa8[0m <[0;33mline:311:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_impl[0m [0;32m'std::locale::_Impl *'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x191b008[0m <[0;33mline:314:5[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m _S_classic[0m [0;32m'std::locale::_Impl *'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x191b080[0m <[0;33mline:317:5[0m, [0;33mcol:19[0m> [0;33mcol:19[0m[0;1;36m _S_global[0m [0;32m'std::locale::_Impl *'[0m static
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x191b130[0m <[0;33mline:323:5[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m _S_categories[0m [0;32m'const char *const *const'[0m static
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x191b198[0m <[0;33mline:335:5[0m, [0;33mcol:61[0m> [0;33mcol:5[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x191b2e0[0m <[0;33mcol:12[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++locale.h:45:33[0m> [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:335:12[0m referenced[0;1;36m _S_categories_size[0m [0;32m'std::locale::(unnamed enum at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:335:5)'[0m
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x191b330[0m <[0;33mcol:33[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++locale.h:45:33[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|     `-[0m[0;1;35mConstantExpr[0m[0;33m 0x191b2c0[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:335:33[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m|       |-value: [0m[0;36mInt [0;1;36m12[0m[0m
[0;34m|       `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x191b2a0[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:335:33[0m, [0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m '+'
[0;34m|         |-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x191b260[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:335:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 6[0m
[0;34m|         `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x191b280[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++locale.h:45:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 6[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x191b358[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/locale_classes.h:338:5[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m _S_once[0m [0;32m'__gthread_once_t':'int'[0m static
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x191b4d0[0m <[0;33mline:341:5[0m, [0;33mline:342:26[0m> [0;33mcol:5[0m referenced[0;1;36m locale[0m [0;32m'void (std::locale::_Impl *) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191b3d0[0m <[0;33mcol:12[0m, [0;33mcol:17[0m> [0;33mcol:18[0m [0;32m'std::locale::_Impl *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191b5b0[0m <[0;33mline:344:5[0m, [0;33mline:345:19[0m> [0;33mcol:5[0m[0;1;36m _S_initialize[0m [0;32m'void ()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191b678[0m <[0;33mline:347:5[0m, [0;33mline:348:32[0m> [0;33mcol:5[0m[0;1;36m _S_initialize_once[0m [0;32m'void () throw()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191b7e8[0m <[0;33mline:350:5[0m, [0;33mline:351:35[0m> [0;33mcol:5[0m[0;1;36m _S_normalize_category[0m [0;32m'std::locale::category (std::locale::category)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191b728[0m <[0;33mcol:27[0m> [0;33mcol:35[0m [0;32m'std::locale::category':'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x191ba30[0m <[0;33mline:353:5[0m, [0;33mline:354:74[0m> [0;33mcol:5[0m[0;1;36m _M_coalesce[0m [0;32m'void (const std::locale &, const std::locale &, std::locale::category)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191b8a0[0m <[0;33mcol:17[0m, [0;33mcol:31[0m> [0;33mcol:31[0m[0;1;36m __base[0m [0;32m'const std::locale &'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191b918[0m <[0;33mcol:39[0m, [0;33mcol:53[0m> [0;33mcol:53[0m[0;1;36m __add[0m [0;32m'const std::locale &'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x191b990[0m <[0;33mcol:60[0m, [0;33mcol:69[0m> [0;33mcol:69[0m[0;1;36m __cat[0m [0;32m'std::locale::category':'int'[0m
[0;34m`-[0m[0;1;32mVarDecl[0m[0;33m 0x191bb98[0m <[0;33mline:357:5[0m, [0;33mcol:46[0m> [0;33mcol:28[0m[0;1;36m _S_twinned_facets[0m [0;32m'const std::locale::id *const[]'[0m static

Layout: <CGRecordLayout
  LLVMType:%"class.std::locale" = type { %"class.std::locale::_Impl"* }
  NonVirtualBaseLLVMType:%"class.std::locale" = type { %"class.std::locale::_Impl"* }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping IRgen Record Layout
Record: [0;1;32mCXXRecordDecl[0m[0;33m 0x199a238[0m prev 0x1103330 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:233:3[0m, [0;33mline:916:3[0m> [0;33mline:233:9[0m referenced class[0;1;36m ios_base[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199a330[0m <[0;33mcol:3[0m, [0;33mcol:9[0m> [0;33mcol:9[0m implicit referenced class[0;1;36m ios_base[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x199a3c0[0m <[0;33mline:251:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199a408[0m <[0;33mline:260:5[0m, [0;33mline:279:5[0m> [0;33mline:260:34[0m class[0;1;36m failure[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple non_trivial has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m| |-[0mpublic [0;32m'std::system_error'[0m
[0;34m| |-[0m[0;1;34mAbiTagAttr[0m[0;33m 0x199a528[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:136:47[0m, [0;33mcol:67[0m> cxx11
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199a5e8[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:260:5[0m, [0;33mcol:34[0m> [0;33mcol:34[0m implicit referenced class[0;1;36m failure[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x199a678[0m <[0;33mline:262:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199a788[0m <[0;33mline:263:7[0m, [0;33mline:264:34[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const std::string &)'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199a6b0[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __str[0m [0;32m'const std::string &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199a9d8[0m <[0;33mline:267:7[0m, [0;33mline:268:47[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const std::string &, const std::error_code &)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199a848[0m <[0;33mcol:15[0m, [0;33mcol:27[0m> [0;33mcol:28[0m [0;32m'const std::string &'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199a8c0[0m <[0;33mcol:30[0m, [0;33mcol:46[0m> [0;33mcol:47[0m [0;32m'const std::error_code &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199ac08[0m <[0;33mline:270:7[0m, [0;33mline:271:63[0m> [0;33mcol:7[0m[0;1;36m failure[0m [0;32m'void (const char *, const std::error_code &)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199aab8[0m <[0;33mcol:15[0m, [0;33mcol:25[0m> [0;33mcol:26[0m [0;32m'const char *'[0m
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199ab30[0m <[0;33mcol:28[0m, [0;33mcol:57[0m> [0;33mcol:46[0m [0;32m'const std::error_code &'[0m cinit
[0;34m| |   `-[0m[0;1;35mExprWithCleanups[0m[0;33m 0x19a32e8[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const std::error_code'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m| |     `-[0m[0;1;35mMaterializeTemporaryExpr[0m[0;33m 0x19a32d0[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const std::error_code'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m| |       `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x19a32a0[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'const std::error_code'[0m[0;36m[0m[0;36m[0m [0;32m'void (std::io_errc) noexcept'[0m
[0;34m| |         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a29e8[0m <[0;33mcol:48[0m, [0;33mcol:57[0m> [0;32m'std::io_errc'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1999150[0m[0;1;36m 'stream'[0m [0;32m'std::io_errc'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x199ad20[0m <[0;33mline:274:7[0m, [0;33mline:275:24[0m> [0;33mcol:7[0m[0;1;36m ~failure[0m [0;32m'void () throw()'[0m virtual
[0;34m| | `-[0mOverrides: [ 0x197d420 system_error::~system_error 'void () noexcept' ]
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199ae28[0m <[0;33mline:277:7[0m, [0;33mline:278:26[0m> [0;33mcol:7[0m[0;1;36m what[0m [0;32m'const char *() const throw()'[0m virtual
[0;34m| | `-[0mOverrides: [ 0x1960cf8 runtime_error::what 'const char *() const noexcept' ]
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199aef8[0m <[0;33mline:260:34[0m> [0;33mcol:34[0m implicit[0;1;36m failure[0m [0;32m'void (const std::ios_base::failure &)'[0m inline default noexcept-unevaluated 0x199aef8
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199b008[0m <[0;33mcol:34[0m> [0;33mcol:34[0m [0;32m'const std::ios_base::failure &'[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199b0b8[0m <[0;33mcol:34[0m> [0;33mcol:34[0m implicit[0;1;36m operator=[0m [0;32m'std::ios_base::failure &(const std::ios_base::failure &)'[0m inline default noexcept-unevaluated 0x199b0b8
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199b1c8[0m <[0;33mcol:34[0m> [0;33mcol:34[0m [0;32m'const std::ios_base::failure &'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199b248[0m <[0;33mline:346:5[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m fmtflags[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;32mEnumType[0m[0;33m 0x1988670[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;32mEnum[0m[0;33m 0x19885d0[0m[0;1;36m '_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199b2d0[0m <[0;33mline:349:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m boolalpha[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199b338[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988710[0m[0;1;36m '_S_boolalpha'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199b3c0[0m <[0;33mline:352:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m dec[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199b428[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x19887e0[0m[0;1;36m '_S_dec'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199b4b0[0m <[0;33mline:355:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m fixed[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199b518[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x19888b0[0m[0;1;36m '_S_fixed'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199b5a0[0m <[0;33mline:358:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m hex[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199b608[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988980[0m[0;1;36m '_S_hex'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199b690[0m <[0;33mline:363:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m internal[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199b6f8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988a50[0m[0;1;36m '_S_internal'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199b780[0m <[0;33mline:367:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m left[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199b7e8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988b20[0m[0;1;36m '_S_left'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199b870[0m <[0;33mline:370:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m oct[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199b8d8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988bf0[0m[0;1;36m '_S_oct'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199b960[0m <[0;33mline:374:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m right[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199b9c8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988cc0[0m[0;1;36m '_S_right'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199ba50[0m <[0;33mline:377:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m scientific[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199bab8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988d90[0m[0;1;36m '_S_scientific'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199bb40[0m <[0;33mline:381:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showbase[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199bba8[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988e60[0m[0;1;36m '_S_showbase'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199bc30[0m <[0;33mline:385:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showpoint[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199bc98[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1988f30[0m[0;1;36m '_S_showpoint'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199bd20[0m <[0;33mline:388:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m showpos[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199bd88[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1989000[0m[0;1;36m '_S_showpos'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199be10[0m <[0;33mline:391:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m skipws[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199be78[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x19890d0[0m[0;1;36m '_S_skipws'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199bf00[0m <[0;33mline:394:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m unitbuf[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199bf68[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x19891a0[0m[0;1;36m '_S_unitbuf'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199bff0[0m <[0;33mline:398:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m uppercase[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c058[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1989270[0m[0;1;36m '_S_uppercase'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c0e0[0m <[0;33mline:401:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m adjustfield[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c148[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1989380[0m[0;1;36m '_S_adjustfield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c1d0[0m <[0;33mline:404:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m basefield[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c238[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1989490[0m[0;1;36m '_S_basefield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c2c0[0m <[0;33mline:407:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m referenced[0;1;36m floatfield[0m [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c328[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1989560[0m[0;1;36m '_S_floatfield'[0m [0;32m'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199c3b0[0m <[0;33mline:421:5[0m, [0;33mcol:26[0m> [0;33mcol:26[0m referenced[0;1;36m iostate[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m| `-[0m[0;32mEnumType[0m[0;33m 0x1996ee0[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|   `-[0m[0;1;32mEnum[0m[0;33m 0x1996e40[0m[0;1;36m '_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c440[0m <[0;33mline:425:5[0m, [0;33mcol:35[0m> [0;33mcol:26[0m referenced[0;1;36m badbit[0m [0;32m'const std::ios_base::iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c4a8[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1997010[0m[0;1;36m '_S_badbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c530[0m <[0;33mline:428:5[0m, [0;33mcol:35[0m> [0;33mcol:26[0m referenced[0;1;36m eofbit[0m [0;32m'const std::ios_base::iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c598[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x19970e0[0m[0;1;36m '_S_eofbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c620[0m <[0;33mline:433:5[0m, [0;33mcol:36[0m> [0;33mcol:26[0m referenced[0;1;36m failbit[0m [0;32m'const std::ios_base::iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c688[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x19971b0[0m[0;1;36m '_S_failbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c710[0m <[0;33mline:436:5[0m, [0;33mcol:36[0m> [0;33mcol:26[0m referenced[0;1;36m goodbit[0m [0;32m'const std::ios_base::iostate':'const std::_Ios_Iostate'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c778[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Iostate'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1996f40[0m[0;1;36m '_S_goodbit'[0m [0;32m'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199c800[0m <[0;33mline:452:5[0m, [0;33mcol:27[0m> [0;33mcol:27[0m referenced[0;1;36m openmode[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m| `-[0m[0;32mEnumType[0m[0;33m 0x198b8b0[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|   `-[0m[0;1;32mEnum[0m[0;33m 0x198b808[0m[0;1;36m '_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c890[0m <[0;33mline:455:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m[0;1;36m app[0m [0;32m'const std::ios_base::openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c8f8[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x198b950[0m[0;1;36m '_S_app'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199c980[0m <[0;33mline:458:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m[0;1;36m ate[0m [0;32m'const std::ios_base::openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199c9e8[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x198ba20[0m[0;1;36m '_S_ate'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199ca70[0m <[0;33mline:463:5[0m, [0;33mcol:36[0m> [0;33mcol:27[0m[0;1;36m binary[0m [0;32m'const std::ios_base::openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199cad8[0m <[0;33mcol:36[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x198baf0[0m[0;1;36m '_S_bin'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199cb60[0m <[0;33mline:466:5[0m, [0;33mcol:33[0m> [0;33mcol:27[0m referenced[0;1;36m in[0m [0;32m'const std::ios_base::openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199cbc8[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x198bbc0[0m[0;1;36m '_S_in'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199cc50[0m <[0;33mline:469:5[0m, [0;33mcol:34[0m> [0;33mcol:27[0m referenced[0;1;36m out[0m [0;32m'const std::ios_base::openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199ccb8[0m <[0;33mcol:34[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x198bc90[0m[0;1;36m '_S_out'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199cd40[0m <[0;33mline:472:5[0m, [0;33mcol:35[0m> [0;33mcol:27[0m[0;1;36m trunc[0m [0;32m'const std::ios_base::openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199cda8[0m <[0;33mcol:35[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x198bd60[0m[0;1;36m '_S_trunc'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199ce30[0m <[0;33mline:474:5[0m, [0;33mcol:41[0m> [0;33mcol:27[0m[0;1;36m __noreplace[0m [0;32m'const std::ios_base::openmode':'const std::_Ios_Openmode'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199ce98[0m <[0;33mcol:41[0m> [0;32m'std::_Ios_Openmode'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x198be30[0m[0;1;36m '_S_noreplace'[0m [0;32m'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199cf20[0m <[0;33mline:492:5[0m, [0;33mcol:26[0m> [0;33mcol:26[0m referenced[0;1;36m seekdir[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m| `-[0m[0;32mEnumType[0m[0;33m 0x1998d50[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|   `-[0m[0;1;32mEnum[0m[0;33m 0x1998ca8[0m[0;1;36m '_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199cfb0[0m <[0;33mline:495:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m[0;1;36m beg[0m [0;32m'const std::ios_base::seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199d018[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1998db0[0m[0;1;36m '_S_beg'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199d0a0[0m <[0;33mline:498:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m referenced[0;1;36m cur[0m [0;32m'const std::ios_base::seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199d108[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1998e40[0m[0;1;36m '_S_cur'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mVarDecl[0m[0;33m 0x199d190[0m <[0;33mline:501:5[0m, [0;33mcol:33[0m> [0;33mcol:26[0m[0;1;36m end[0m [0;32m'const std::ios_base::seekdir':'const std::_Ios_Seekdir'[0m static cinit
[0;34m| `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x199d1f8[0m <[0;33mcol:33[0m> [0;32m'std::_Ios_Seekdir'[0m[0;36m[0m[0;36m[0m [0;1;32mEnumConstant[0m[0;33m 0x1998ed0[0m[0;1;36m '_S_end'[0m [0;32m'std::_Ios_Seekdir'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199d2c8[0m <[0;33mline:505:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m[0;1;36m io_state[0m [0;32m'int'[0m
[0;34m| |-[0m[0;32mBuiltinType[0m[0;33m 0xfe99f0[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;34mDeprecatedAttr[0m[0;33m 0x199d320[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:96:19[0m, [0;33mcol:58[0m> "use 'std::iostate' instead" ""
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199d408[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:507:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m[0;1;36m open_mode[0m [0;32m'int'[0m
[0;34m| |-[0m[0;32mBuiltinType[0m[0;33m 0xfe99f0[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;34mDeprecatedAttr[0m[0;33m 0x199d460[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:96:19[0m, [0;33mcol:58[0m> "use 'std::openmode' instead" ""
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199d548[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:509:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m[0;1;36m seek_dir[0m [0;32m'int'[0m
[0;34m| |-[0m[0;32mBuiltinType[0m[0;33m 0xfe99f0[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;34mDeprecatedAttr[0m[0;33m 0x199d5a0[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:96:19[0m, [0;33mcol:58[0m> "use 'std::seekdir' instead" ""
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199d710[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:512:5[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m streampos[0m [0;32m'std::streampos':'std::fpos<__mbstate_t>'[0m
[0;34m| |-[0m[0;32mElaboratedType[0m[0;33m 0x199d660[0m [0;32m'std::streampos'[0m sugar
[0;34m| | `-[0m[0;32mTypedefType[0m[0;33m 0x129c8b0[0m [0;32m'std::streampos'[0m sugar
[0;34m| |   |-[0m[0;1;32mTypedef[0m[0;33m 0x1102f20[0m[0;1;36m 'streampos'[0m
[0;34m| |   `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x1102ea0[0m [0;32m'fpos<mbstate_t>'[0m sugar fpos
[0;34m| |     |-[0mTemplateArgument type [0;32m'mbstate_t':'__mbstate_t'[0m
[0;34m| |     | `-[0m[0;32mUsingType[0m[0;33m 0x1102d60[0m [0;32m'mbstate_t'[0m sugar
[0;34m| |     |   |-[0m[0;1;32mUsingShadow[0m[0;33m 0x10f77b8[0m[0;1;36m 'mbstate_t'[0m
[0;34m| |     |   `-[0m[0;32mTypedefType[0m[0;33m 0x10e5440[0m [0;32m'mbstate_t'[0m sugar
[0;34m| |     |     |-[0m[0;1;32mTypedef[0m[0;33m 0x10c60c0[0m[0;1;36m 'mbstate_t'[0m
[0;34m| |     |     `-[0m[0;32mTypedefType[0m[0;33m 0x10c6090[0m [0;32m'__mbstate_t'[0m sugar
[0;34m| |     |       |-[0m[0;1;32mTypedef[0m[0;33m 0x10c6018[0m[0;1;36m '__mbstate_t'[0m
[0;34m| |     |       `-[0m[0;32mElaboratedType[0m[0;33m 0x10c5fc0[0m [0;32m'struct __mbstate_t'[0m sugar
[0;34m| |     |         `-[0m[0;32mRecordType[0m[0;33m 0x10c5ba0[0m [0;32m'__mbstate_t'[0m
[0;34m| |     |           `-[0m[0;1;32mCXXRecord[0m[0;33m 0x10c5b10[0m[0;1;36m ''[0m
[0;34m| |     `-[0m[0;32mRecordType[0m[0;33m 0x1102e80[0m [0;32m'std::fpos<__mbstate_t>'[0m
[0;34m| |       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x1102d98[0m[0;1;36m 'fpos'[0m
[0;34m| `-[0m[0;1;34mDeprecatedAttr[0m[0;33m 0x199d768[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:96:19[0m, [0;33mcol:58[0m> "use 'std::streampos' instead" ""
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199d8c0[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:514:5[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m streamoff[0m [0;32m'std::streamoff':'long'[0m
[0;34m| |-[0m[0;32mElaboratedType[0m[0;33m 0x199d810[0m [0;32m'std::streamoff'[0m sugar
[0;34m| | `-[0m[0;32mTypedefType[0m[0;33m 0x10fda10[0m [0;32m'std::streamoff'[0m sugar
[0;34m| |   |-[0m[0;1;32mTypedef[0m[0;33m 0x10fd500[0m[0;1;36m 'streamoff'[0m
[0;34m| |   `-[0m[0;32mBuiltinType[0m[0;33m 0xfe9a10[0m [0;32m'long'[0m
[0;34m| `-[0m[0;1;34mDeprecatedAttr[0m[0;33m 0x199d918[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/x86_64-linux-gnu/c++/12/bits/c++config.h:96:19[0m, [0;33mcol:58[0m> "use 'std::streamoff' instead" ""
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x199d9a8[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:525:5[0m, [0;33mline:530:5[0m> [0;33mline:525:10[0m referenced[0;1;36m event[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x199da70[0m <[0;33mline:527:7[0m> [0;33mcol:7[0m referenced[0;1;36m erase_event[0m [0;32m'std::ios_base::event'[0m
[0;34m| |-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x199dac0[0m <[0;33mline:528:7[0m> [0;33mcol:7[0m[0;1;36m imbue_event[0m [0;32m'std::ios_base::event'[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x199db10[0m <[0;33mline:529:7[0m> [0;33mcol:7[0m referenced[0;1;36m copyfmt_event[0m [0;32m'std::ios_base::event'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x199de10[0m <[0;33mline:542:5[0m, [0;33mcol:70[0m> [0;33mcol:20[0m referenced[0;1;36m event_callback[0m [0;32m'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| `-[0m[0;32mPointerType[0m[0;33m 0x199dda0[0m [0;32m'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m|   `-[0m[0;32mParenType[0m[0;33m 0x199dd40[0m [0;32m'void (std::ios_base::event, std::ios_base &, int)'[0m sugar
[0;34m|     `-[0m[0;32mFunctionProtoType[0m[0;33m 0x199dd00[0m [0;32m'void (std::ios_base::event, std::ios_base &, int)'[0m cdecl
[0;34m|       |-[0m[0;32mBuiltinType[0m[0;33m 0xfe9950[0m [0;32m'void'[0m
[0;34m|       |-[0m[0;32mEnumType[0m[0;33m 0x199da50[0m [0;32m'std::ios_base::event'[0m
[0;34m|       | `-[0m[0;1;32mEnum[0m[0;33m 0x199d9a8[0m[0;1;36m 'event'[0m
[0;34m|       |-[0m[0;32mLValueReferenceType[0m[0;33m 0x199dbe0[0m [0;32m'std::ios_base &'[0m
[0;34m|       | `-[0m[0;32mRecordType[0m[0;33m 0x11033c0[0m [0;32m'std::ios_base'[0m
[0;34m|       |   `-[0m[0;1;32mCXXRecord[0m[0;33m 0x199a238[0m[0;1;36m 'ios_base'[0m
[0;34m|       `-[0m[0;32mBuiltinType[0m[0;33m 0xfe99f0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199e068[0m <[0;33mline:554:5[0m, [0;33mline:555:55[0m> [0;33mcol:5[0m[0;1;36m register_callback[0m [0;32m'void (std::ios_base::event_callback, int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199dea0[0m <[0;33mcol:23[0m, [0;33mcol:38[0m> [0;33mcol:38[0m[0;1;36m __fn[0m [0;32m'std::ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199df20[0m <[0;33mcol:44[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x199e118[0m <[0;33mline:557:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e150[0m <[0;33mline:558:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m _M_precision[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e1b0[0m <[0;33mline:559:5[0m, [0;33mcol:17[0m> [0;33mcol:17[0m referenced[0;1;36m _M_width[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e210[0m <[0;33mline:560:5[0m, [0;33mcol:15[0m> [0;33mcol:15[0m referenced[0;1;36m _M_flags[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e270[0m <[0;33mline:561:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_exception[0m [0;32m'std::ios_base::iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e2d0[0m <[0;33mline:562:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_streambuf_state[0m [0;32m'std::ios_base::iostate':'std::_Ios_Iostate'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199e320[0m <[0;33mline:566:5[0m, [0;33mline:594:5[0m> [0;33mline:566:12[0m referenced struct[0;1;36m _Callback_list[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m exists simple trivial needs_implicit
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param needs_implicit implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m exists simple trivial needs_implicit
[0;34m| | `-[0m[0;1;32mDestructor[0m simple irrelevant trivial needs_implicit
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199e438[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Callback_list[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e508[0m <[0;33mline:569:7[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m _M_next[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e600[0m <[0;33mline:570:7[0m, [0;33mcol:32[0m> [0;33mcol:32[0m[0;1;36m _M_fn[0m [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e668[0m <[0;33mline:571:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m[0;1;36m _M_index[0m [0;32m'int'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x199e6c8[0m <[0;33mline:572:7[0m, [0;33mcol:21[0m> [0;33mcol:21[0m referenced[0;1;36m _M_refcount[0m [0;32m'_Atomic_word':'int'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199e9a8[0m <[0;33mline:574:7[0m, [0;33mline:576:73[0m> [0;33mline:574:7[0m[0;1;36m _Callback_list[0m [0;32m'void (ios_base::event_callback, int, std::ios_base::_Callback_list *)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199e770[0m <[0;33mcol:22[0m, [0;33mcol:47[0m> [0;33mcol:47[0m used[0;1;36m __fn[0m [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199e7f0[0m <[0;33mcol:53[0m, [0;33mcol:57[0m> [0;33mcol:57[0m used[0;1;36m __index[0m [0;32m'int'[0m
[0;34m| | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199e868[0m <[0;33mline:575:8[0m, [0;33mcol:24[0m> [0;33mcol:24[0m used[0;1;36m __cb[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199e508[0m[0;1;36m '_M_next'[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a33d8[0m <[0;33mline:576:17[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3398[0m <[0;33mcol:17[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x199e868[0m[0;1;36m '__cb'[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199e600[0m[0;1;36m '_M_fn'[0m [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3450[0m <[0;33mcol:30[0m> [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3410[0m <[0;33mcol:30[0m> [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x199e770[0m[0;1;36m '__fn'[0m [0;32m'ios_base::event_callback':'void (*)(std::ios_base::event, std::ios_base &, int)'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199e668[0m[0;1;36m '_M_index'[0m [0;32m'int'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a34c8[0m <[0;33mcol:46[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m| | |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3488[0m <[0;33mcol:46[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x199e7f0[0m[0;1;36m '__index'[0m [0;32m'int'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199e6c8[0m[0;1;36m '_M_refcount'[0m [0;32m'_Atomic_word':'int'[0m
[0;34m| | | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a3500[0m <[0;33mcol:68[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a3580[0m <[0;33mcol:71[0m, [0;33mcol:73[0m>
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199ea88[0m <[0;33mline:578:7[0m, [0;33mline:579:79[0m> [0;33mcol:7[0m referenced[0;1;36m _M_add_reference[0m [0;32m'void ()'[0m
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a36d0[0m <[0;33mcol:26[0m, [0;33mcol:79[0m>
[0;34m| |   `-[0m[0;1;35mCallExpr[0m[0;33m 0x19a36a0[0m <[0;33mcol:28[0m, [0;33mcol:76[0m> [0;32m'void'[0m[0;36m[0m[0;36m[0m
[0;34m| |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3688[0m <[0;33mcol:28[0m, [0;33mcol:39[0m> [0;32m'void (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m| |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a35e0[0m <[0;33mcol:28[0m, [0;33mcol:39[0m> [0;32m'void (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x13c3748[0m[0;1;36m '__atomic_add_dispatch'[0m [0;32m'void (_Atomic_word *, int)'[0m
[0;34m| |     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x19a3650[0m <[0;33mcol:61[0m, [0;33mcol:62[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m| |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a3620[0m <[0;33mcol:62[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x199e6c8[0m
[0;34m| |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a3610[0m <[0;33mcol:62[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m| |     `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a3668[0m <[0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m| `-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199eb50[0m <[0;33mline:582:7[0m, [0;33mline:593:7[0m> [0;33mline:583:7[0m[0;1;36m _M_remove_reference[0m [0;32m'int ()'[0m
[0;34m|   `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a39b0[0m <[0;33mline:584:7[0m, [0;33mline:593:7[0m>
[0;34m|     |-[0m[0;1;35mNullStmt[0m[0;33m 0x19a36e8[0m <[0;33mline:586:62[0m>
[0;34m|     |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a3898[0m <[0;33mline:587:9[0m, [0;33mcol:77[0m>
[0;34m|     | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a3708[0m <[0;33mcol:9[0m, [0;33mcol:76[0m> [0;33mcol:13[0m used[0;1;36m __res[0m [0;32m'int'[0m cinit
[0;34m|     |   `-[0m[0;1;35mCallExpr[0m[0;33m 0x19a3868[0m <[0;33mcol:21[0m, [0;33mcol:76[0m> [0;32m'_Atomic_word':'int'[0m[0;36m[0m[0;36m[0m
[0;34m|     |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3850[0m <[0;33mcol:21[0m, [0;33mcol:32[0m> [0;32m'_Atomic_word (*)(_Atomic_word *, int)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3790[0m <[0;33mcol:21[0m, [0;33mcol:32[0m> [0;32m'_Atomic_word (_Atomic_word *, int)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x13c30f8[0m[0;1;36m '__exchange_and_add_dispatch'[0m [0;32m'_Atomic_word (_Atomic_word *, int)'[0m
[0;34m|     |     |-[0m[0;1;35mUnaryOperator[0m[0;33m 0x19a3800[0m <[0;33mcol:60[0m, [0;33mcol:61[0m> [0;32m'_Atomic_word *'[0m[0;36m[0m[0;36m[0m prefix '&' cannot overflow
[0;34m|     |     | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a37d0[0m <[0;33mcol:61[0m> [0;32m'_Atomic_word':'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_refcount[0;33m 0x199e6c8[0m
[0;34m|     |     |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a37c0[0m <[0;33mcol:61[0m> [0;32m'std::ios_base::_Callback_list *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     |     `-[0m[0;1;35mUnaryOperator[0m[0;33m 0x19a3838[0m <[0;33mcol:74[0m, [0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m prefix '-'
[0;34m|     |       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a3818[0m <[0;33mcol:75[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 1[0m
[0;34m|     |-[0m[0;1;35mIfStmt[0m[0;33m 0x19a3948[0m <[0;33mline:588:9[0m, [0;33mline:591:11[0m>
[0;34m|     | |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19a3908[0m <[0;33mline:588:13[0m, [0;33mcol:22[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '=='
[0;34m|     | | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a38f0[0m <[0;33mcol:13[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|     | | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a38b0[0m <[0;33mcol:13[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a3708[0m[0;1;36m '__res'[0m [0;32m'int'[0m
[0;34m|     | | `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a38d0[0m <[0;33mcol:22[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m|     | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a3930[0m <[0;33mline:589:11[0m, [0;33mline:591:11[0m>
[0;34m|     |   `-[0m[0;1;35mNullStmt[0m[0;33m 0x19a3928[0m <[0;33mline:590:65[0m>
[0;34m|     `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a39a0[0m <[0;33mline:592:9[0m, [0;33mcol:16[0m>
[0;34m|       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3988[0m <[0;33mcol:16[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3968[0m <[0;33mcol:16[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a3708[0m[0;1;36m '__res'[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199ec30[0m <[0;33mline:596:6[0m, [0;33mcol:22[0m> [0;33mcol:22[0m referenced[0;1;36m _M_callbacks[0m [0;32m'std::ios_base::_Callback_list *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199ed90[0m <[0;33mline:598:5[0m, [0;33mline:599:41[0m> [0;33mcol:5[0m referenced[0;1;36m _M_call_callbacks[0m [0;32m'void (std::ios_base::event) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199ec90[0m <[0;33mcol:23[0m, [0;33mcol:29[0m> [0;33mcol:29[0m[0;1;36m __ev[0m [0;32m'std::ios_base::event'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199eed8[0m <[0;33mline:601:5[0m, [0;33mline:602:38[0m> [0;33mcol:5[0m referenced[0;1;36m _M_dispose_callbacks[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199ef78[0m <[0;33mline:605:5[0m, [0;33mline:610:5[0m> [0;33mline:605:12[0m referenced struct[0;1;36m _Words[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m pass_in_registers standard_layout trivially_copyable has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m simple trivial has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m exists simple trivial
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m simple trivial has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m exists simple trivial
[0;34m| | `-[0m[0;1;32mDestructor[0m simple irrelevant trivial
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199f098[0m <[0;33mcol:5[0m, [0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced struct[0;1;36m _Words[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f140[0m <[0;33mline:607:7[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_pword[0m [0;32m'void *'[0m
[0;34m| |-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f1a8[0m <[0;33mline:608:7[0m, [0;33mcol:12[0m> [0;33mcol:12[0m referenced[0;1;36m _M_iword[0m [0;32m'long'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199f260[0m <[0;33mline:609:7[0m, [0;33mcol:45[0m> [0;33mcol:7[0m referenced[0;1;36m _Words[0m [0;32m'void ()'[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199f140[0m[0;1;36m '_M_pword'[0m [0;32m'void *'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3a20[0m <[0;33mcol:27[0m> [0;32m'void *'[0m[0;36m[0m[0;36m[0m <[0;31mNullToPointer[0m>
[0;34m| | |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a39e0[0m <[0;33mcol:27[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | |-[0mCXXCtorInitializer [0;1;32mField[0m[0;33m 0x199f1a8[0m[0;1;36m '_M_iword'[0m [0;32m'long'[0m
[0;34m| | | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3a98[0m <[0;33mcol:40[0m> [0;32m'long'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m| | |   `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x19a3a58[0m <[0;33mcol:40[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 0[0m
[0;34m| | `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a3ae0[0m <[0;33mcol:43[0m, [0;33mcol:45[0m>
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19a2338[0m <[0;33mline:605:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (const std::ios_base::_Words &)'[0m inline default trivial noexcept-unevaluated 0x19a2338
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2448[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const std::ios_base::_Words &'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19a24f8[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit constexpr[0;1;36m _Words[0m [0;32m'void (std::ios_base::_Words &&)'[0m inline default trivial noexcept-unevaluated 0x19a24f8
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2608[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'std::ios_base::_Words &&'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a2688[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'std::ios_base::_Words &(const std::ios_base::_Words &)'[0m inline default trivial noexcept-unevaluated 0x19a2688
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2798[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'const std::ios_base::_Words &'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a2808[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit[0;1;36m operator=[0m [0;32m'std::ios_base::_Words &(std::ios_base::_Words &&)'[0m inline default trivial noexcept-unevaluated 0x19a2808
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2918[0m <[0;33mcol:12[0m> [0;33mcol:12[0m [0;32m'std::ios_base::_Words &&'[0m
[0;34m| `-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x1aec610[0m <[0;33mcol:12[0m> [0;33mcol:12[0m implicit referenced[0;1;36m ~_Words[0m [0;32m'void () noexcept'[0m inline default trivial
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f330[0m <[0;33mline:613:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m[0;1;36m _M_word_zero[0m [0;32m'std::ios_base::_Words'[0m
[0;34m|-[0m[0;1;32mEnumDecl[0m[0;33m 0x199f380[0m <[0;33mline:617:5[0m, [0;33mcol:35[0m> [0;33mcol:5[0m
[0;34m| `-[0m[0;1;32mEnumConstantDecl[0m[0;33m 0x199f480[0m <[0;33mcol:12[0m, [0;33mcol:33[0m> [0;33mcol:12[0m referenced[0;1;36m _S_local_word_size[0m [0;32m'std::ios_base::(unnamed enum at /usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/ios_base.h:617:5)'[0m
[0;34m|   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x199f4d0[0m <[0;33mcol:33[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m>
[0;34m|     `-[0m[0;1;35mConstantExpr[0m[0;33m 0x199f460[0m <[0;33mcol:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m
[0;34m|       |-value: [0m[0;36mInt [0;1;36m8[0m[0m
[0;34m|       `-[0m[0;1;35mIntegerLiteral[0m[0;33m 0x199f440[0m <[0;33mcol:33[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m[0;1;36m 8[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f658[0m <[0;33mline:618:5[0m, [0;33mcol:45[0m> [0;33mcol:13[0m referenced[0;1;36m _M_local_word[0m [0;32m'std::ios_base::_Words[8]'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f6c0[0m <[0;33mline:621:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m referenced[0;1;36m _M_word_size[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f720[0m <[0;33mline:622:5[0m, [0;33mcol:14[0m> [0;33mcol:14[0m referenced[0;1;36m _M_word[0m [0;32m'std::ios_base::_Words *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199f908[0m <[0;33mline:624:5[0m, [0;33mline:625:44[0m> [0;33mcol:5[0m used[0;1;36m _M_grow_words[0m [0;32m'std::ios_base::_Words &(int, bool)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199f788[0m <[0;33mcol:19[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __index[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199f800[0m <[0;33mcol:32[0m, [0;33mcol:37[0m> [0;33mcol:37[0m[0;1;36m __iword[0m [0;32m'bool'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x199f9c8[0m <[0;33mline:628:5[0m, [0;33mcol:13[0m> [0;33mcol:13[0m referenced[0;1;36m _M_ios_locale[0m [0;32m'std::locale'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x199fa40[0m <[0;33mline:630:5[0m, [0;33mline:631:21[0m> [0;33mcol:5[0m referenced[0;1;36m _M_init[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x199fae0[0m <[0;33mline:633:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199fb08[0m <[0;33mline:639:5[0m, [0;33mline:654:5[0m> [0;33mline:639:11[0m referenced class[0;1;36m Init[0m definition
[0;34m| |-[0m[0;1;32mDefinitionData[0m empty standard_layout has_user_declared_ctor can_const_default_init
[0;34m| | |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided defaulted_is_constexpr
[0;34m| | |-[0m[0;1;32mCopyConstructor[0m trivial user_declared has_const_param implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveConstructor[0m
[0;34m| | |-[0m[0;1;32mCopyAssignment[0m trivial has_const_param user_declared implicit_has_const_param
[0;34m| | |-[0m[0;1;32mMoveAssignment[0m
[0;34m| | `-[0m[0;1;32mDestructor[0m non_trivial user_declared
[0;34m| |-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x199fc28[0m <[0;33mcol:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit referenced class[0;1;36m Init[0m
[0;34m| |-[0m[0;1;32mFriendDecl[0m[0;33m 0x199fd10[0m <[0;33mline:641:7[0m, [0;33mcol:20[0m> [0;33mcol:14[0m [0;32m'class ios_base':'std::ios_base'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x199fd50[0m <[0;33mline:642:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x199fde0[0m <[0;33mline:643:7[0m, [0;33mcol:12[0m> [0;33mcol:7[0m used[0;1;36m Init[0m [0;32m'void ()'[0m
[0;34m| |-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x199fed0[0m <[0;33mline:644:7[0m, [0;33mcol:13[0m> [0;33mcol:7[0m used[0;1;36m ~Init[0m [0;32m'void () noexcept'[0m
[0;34m| |-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19a00a8[0m <[0;33mline:647:7[0m, [0;33mcol:33[0m> [0;33mcol:7[0m constexpr[0;1;36m Init[0m [0;32m'void (const std::ios_base::Init &)'[0m default trivial noexcept-unevaluated 0x19a00a8
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x199ffe8[0m <[0;33mcol:12[0m, [0;33mcol:22[0m> [0;33mcol:23[0m [0;32m'const std::ios_base::Init &'[0m
[0;34m| |-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0268[0m <[0;33mline:648:7[0m, [0;33mcol:44[0m> [0;33mcol:13[0m[0;1;36m operator=[0m [0;32m'std::ios_base::Init &(const std::ios_base::Init &)'[0m default trivial noexcept-unevaluated 0x19a0268
[0;34m| | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a0178[0m <[0;33mcol:23[0m, [0;33mcol:33[0m> [0;33mcol:34[0m [0;32m'const std::ios_base::Init &'[0m
[0;34m| |-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19a0310[0m <[0;33mline:651:5[0m, [0;33mcol:12[0m> [0;33mcol:5[0m private
[0;34m| |-[0m[0;1;32mVarDecl[0m[0;33m 0x19a0348[0m <[0;33mline:652:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m _S_refcount[0m [0;32m'_Atomic_word':'int'[0m static
[0;34m| `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a03c0[0m <[0;33mline:653:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _S_synced_with_stdio[0m [0;32m'bool'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0558[0m <[0;33mline:661:5[0m, [0;33mline:663:24[0m> [0;33mline:662:5[0m referenced[0;1;36m flags[0m [0;32m'std::ios_base::fmtflags () const'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a3b58[0m <[0;33mline:663:5[0m, [0;33mcol:24[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a3b48[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3b30[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a3b00[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base::fmtflags':'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|         `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a3af0[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a06c8[0m <[0;33mline:672:5[0m, [0;33mline:678:5[0m> [0;33mline:673:5[0m referenced[0;1;36m flags[0m [0;32m'std::ios_base::fmtflags (std::ios_base::fmtflags)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a0608[0m <[0;33mcol:11[0m, [0;33mcol:20[0m> [0;33mcol:20[0m used[0;1;36m __fmtfl[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a3d80[0m <[0;33mline:674:5[0m, [0;33mline:678:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a3c40[0m <[0;33mline:675:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a3b80[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3c28[0m <[0;33mcol:24[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a3bf8[0m <[0;33mcol:24[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a3be8[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19a3d18[0m <[0;33mline:676:7[0m, [0;33mcol:18[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a3cb0[0m <[0;33mcol:7[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a3ca0[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3d00[0m <[0;33mcol:18[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3ce0[0m <[0;33mcol:18[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a0608[0m[0;1;36m '__fmtfl'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a3d70[0m <[0;33mline:677:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3d58[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3d38[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a3b80[0m[0;1;36m '__old'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0820[0m <[0;33mline:688:5[0m, [0;33mline:694:5[0m> [0;33mline:689:5[0m used[0;1;36m setf[0m [0;32m'std::ios_base::fmtflags (std::ios_base::fmtflags)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a0790[0m <[0;33mcol:10[0m, [0;33mcol:19[0m> [0;33mcol:19[0m used[0;1;36m __fmtfl[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a4030[0m <[0;33mline:690:5[0m, [0;33mline:694:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a3e78[0m <[0;33mline:691:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a3db8[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3e60[0m <[0;33mcol:24[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a3e30[0m <[0;33mcol:24[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a3e20[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x19a3fb0[0m <[0;33mline:692:7[0m, [0;33mcol:19[0m> [0;32m'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '|='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3f98[0m <[0;33mcol:16[0m> [0;32m'const std::_Ios_Fmtflags &(*)(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3f50[0m <[0;33mcol:16[0m> [0;32m'const std::_Ios_Fmtflags &(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x198a878[0m[0;1;36m 'operator|='[0m [0;32m'const std::_Ios_Fmtflags &(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a3ee8[0m <[0;33mcol:7[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a3ed8[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a3f38[0m <[0;33mcol:19[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3f18[0m <[0;33mcol:19[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a0790[0m[0;1;36m '__fmtfl'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a4020[0m <[0;33mline:693:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4008[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a3fe8[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a3db8[0m[0;1;36m '__old'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0a28[0m <[0;33mline:705:5[0m, [0;33mline:712:5[0m> [0;33mline:706:5[0m used[0;1;36m setf[0m [0;32m'std::ios_base::fmtflags (std::ios_base::fmtflags, std::ios_base::fmtflags)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a08d8[0m <[0;33mcol:10[0m, [0;33mcol:19[0m> [0;33mcol:19[0m used[0;1;36m __fmtfl[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a0950[0m <[0;33mcol:28[0m, [0;33mcol:37[0m> [0;33mcol:37[0m used[0;1;36m __mask[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a4540[0m <[0;33mline:707:5[0m, [0;33mline:712:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a4128[0m <[0;33mline:708:7[0m, [0;33mcol:32[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a4068[0m <[0;33mcol:7[0m, [0;33mcol:24[0m> [0;33mcol:16[0m used[0;1;36m __old[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4110[0m <[0;33mcol:24[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a40e0[0m <[0;33mcol:24[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a40d0[0m <[0;33mcol:24[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x19a42c8[0m <[0;33mline:709:7[0m, [0;33mcol:20[0m> [0;32m'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '&='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a42b0[0m <[0;33mcol:16[0m> [0;32m'const std::_Ios_Fmtflags &(*)(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4290[0m <[0;33mcol:16[0m> [0;32m'const std::_Ios_Fmtflags &(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x198b2c8[0m[0;1;36m 'operator&='[0m [0;32m'const std::_Ios_Fmtflags &(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4198[0m <[0;33mcol:7[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4188[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x19a4260[0m <[0;33mcol:19[0m, [0;33mcol:20[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '~'
[0;34m|   |   |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4248[0m <[0;33mcol:19[0m> [0;32m'std::_Ios_Fmtflags (*)(std::_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   |   | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4200[0m <[0;33mcol:19[0m> [0;32m'std::_Ios_Fmtflags (std::_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x198a508[0m[0;1;36m 'operator~'[0m [0;32m'std::_Ios_Fmtflags (std::_Ios_Fmtflags)'[0m
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a41e8[0m <[0;33mcol:20[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a41c8[0m <[0;33mcol:20[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a0950[0m[0;1;36m '__mask'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   |-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x19a44c0[0m <[0;33mline:710:7[0m, [0;33mcol:36[0m> [0;32m'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '|='
[0;34m|   | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a44a8[0m <[0;33mcol:16[0m> [0;32m'const std::_Ios_Fmtflags &(*)(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   | | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4488[0m <[0;33mcol:16[0m> [0;32m'const std::_Ios_Fmtflags &(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x198a878[0m[0;1;36m 'operator|='[0m [0;32m'const std::_Ios_Fmtflags &(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4358[0m <[0;33mcol:7[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4348[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mParenExpr[0m[0;33m 0x19a4468[0m <[0;33mcol:19[0m, [0;33mcol:36[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m
[0;34m|   |   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x19a4430[0m <[0;33mcol:20[0m, [0;33mcol:30[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '&'
[0;34m|   |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4418[0m <[0;33mcol:28[0m> [0;32m'std::_Ios_Fmtflags (*)(std::_Ios_Fmtflags, std::_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|   |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a43f8[0m <[0;33mcol:28[0m> [0;32m'std::_Ios_Fmtflags (std::_Ios_Fmtflags, std::_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x1989ad8[0m[0;1;36m 'operator&'[0m [0;32m'std::_Ios_Fmtflags (std::_Ios_Fmtflags, std::_Ios_Fmtflags)'[0m
[0;34m|   |     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a43c8[0m <[0;33mcol:20[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4388[0m <[0;33mcol:20[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a08d8[0m[0;1;36m '__fmtfl'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a43e0[0m <[0;33mcol:30[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a43a8[0m <[0;33mcol:30[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a0950[0m[0;1;36m '__mask'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a4530[0m <[0;33mline:711:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4518[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a44f8[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a4068[0m[0;1;36m '__old'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0be8[0m <[0;33mline:720:5[0m, [0;33mline:722:28[0m> [0;33mline:721:5[0m used[0;1;36m unsetf[0m [0;32m'void (std::ios_base::fmtflags)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a0af8[0m <[0;33mcol:12[0m, [0;33mcol:21[0m> [0;33mcol:21[0m used[0;1;36m __mask[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a4708[0m <[0;33mline:722:5[0m, [0;33mcol:28[0m>
[0;34m|   `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x19a46d0[0m <[0;33mcol:7[0m, [0;33mcol:20[0m> [0;32m'const std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m '&='
[0;34m|     |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a46b8[0m <[0;33mcol:16[0m> [0;32m'const std::_Ios_Fmtflags &(*)(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|     | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4698[0m <[0;33mcol:16[0m> [0;32m'const std::_Ios_Fmtflags &(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x198b2c8[0m[0;1;36m 'operator&='[0m [0;32m'const std::_Ios_Fmtflags &(std::_Ios_Fmtflags &, std::_Ios_Fmtflags)'[0m
[0;34m|     |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a45c8[0m <[0;33mcol:7[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m ->_M_flags[0;33m 0x199e210[0m
[0;34m|     | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a45b8[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|     `-[0m[0;1;35mCXXOperatorCallExpr[0m[0;33m 0x19a4668[0m <[0;33mcol:19[0m, [0;33mcol:20[0m> [0;32m'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m '~'
[0;34m|       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4650[0m <[0;33mcol:19[0m> [0;32m'std::_Ios_Fmtflags (*)(std::_Ios_Fmtflags)'[0m[0;36m[0m[0;36m[0m <[0;31mFunctionToPointerDecay[0m>
[0;34m|       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4630[0m <[0;33mcol:19[0m> [0;32m'std::_Ios_Fmtflags (std::_Ios_Fmtflags)'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mFunction[0m[0;33m 0x198a508[0m[0;1;36m 'operator~'[0m [0;32m'std::_Ios_Fmtflags (std::_Ios_Fmtflags)'[0m
[0;34m|       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4618[0m <[0;33mcol:20[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|         `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a45f8[0m <[0;33mcol:20[0m> [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a0af8[0m[0;1;36m '__mask'[0m [0;32m'std::ios_base::fmtflags':'std::_Ios_Fmtflags'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0cd8[0m <[0;33mline:731:5[0m, [0;33mline:733:28[0m> [0;33mline:732:5[0m referenced[0;1;36m precision[0m [0;32m'std::streamsize () const'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a4788[0m <[0;33mline:733:5[0m, [0;33mcol:28[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a4778[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4760[0m <[0;33mcol:14[0m> [0;32m'std::streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4730[0m <[0;33mcol:14[0m> [0;32m'const std::streamsize':'const long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x199e150[0m
[0;34m|         `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4720[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0e48[0m <[0;33mline:740:5[0m, [0;33mline:746:5[0m> [0;33mline:741:5[0m[0;1;36m precision[0m [0;32m'std::streamsize (std::streamsize)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a0d88[0m <[0;33mcol:15[0m, [0;33mcol:26[0m> [0;33mcol:26[0m used[0;1;36m __prec[0m [0;32m'std::streamsize':'long'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a49b0[0m <[0;33mline:742:5[0m, [0;33mline:746:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a4870[0m <[0;33mline:743:7[0m, [0;33mcol:38[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a47b0[0m <[0;33mcol:7[0m, [0;33mcol:26[0m> [0;33mcol:18[0m used[0;1;36m __old[0m [0;32m'std::streamsize':'long'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4858[0m <[0;33mcol:26[0m> [0;32m'std::streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4828[0m <[0;33mcol:26[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x199e150[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4818[0m <[0;33mcol:26[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19a4948[0m <[0;33mline:744:7[0m, [0;33mcol:22[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a48e0[0m <[0;33mcol:7[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_precision[0;33m 0x199e150[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a48d0[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4930[0m <[0;33mcol:22[0m> [0;32m'std::streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4910[0m <[0;33mcol:22[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a0d88[0m[0;1;36m '__prec'[0m [0;32m'std::streamsize':'long'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a49a0[0m <[0;33mline:745:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4988[0m <[0;33mcol:14[0m> [0;32m'std::streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4968[0m <[0;33mcol:14[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a47b0[0m[0;1;36m '__old'[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a0f20[0m <[0;33mline:754:5[0m, [0;33mline:756:24[0m> [0;33mline:755:5[0m referenced[0;1;36m width[0m [0;32m'std::streamsize () const'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a4a40[0m <[0;33mline:756:5[0m, [0;33mcol:24[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a4a30[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4a18[0m <[0;33mcol:14[0m> [0;32m'std::streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a49e8[0m <[0;33mcol:14[0m> [0;32m'const std::streamsize':'const long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x199e1b0[0m
[0;34m|         `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a49d8[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a1060[0m <[0;33mline:763:5[0m, [0;33mline:769:5[0m> [0;33mline:764:5[0m referenced[0;1;36m width[0m [0;32m'std::streamsize (std::streamsize)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a0fd0[0m <[0;33mcol:11[0m, [0;33mcol:22[0m> [0;33mcol:22[0m used[0;1;36m __wide[0m [0;32m'std::streamsize':'long'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a4c68[0m <[0;33mline:765:5[0m, [0;33mline:769:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a4b28[0m <[0;33mline:766:7[0m, [0;33mcol:34[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a4a68[0m <[0;33mcol:7[0m, [0;33mcol:26[0m> [0;33mcol:18[0m used[0;1;36m __old[0m [0;32m'std::streamsize':'long'[0m cinit
[0;34m|   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4b10[0m <[0;33mcol:26[0m> [0;32m'std::streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4ae0[0m <[0;33mcol:26[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x199e1b0[0m
[0;34m|   |       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4ad0[0m <[0;33mcol:26[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19a4c00[0m <[0;33mline:767:7[0m, [0;33mcol:18[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m '='
[0;34m|   | |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4b98[0m <[0;33mcol:7[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m ->_M_width[0;33m 0x199e1b0[0m
[0;34m|   | | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4b88[0m <[0;33mcol:7[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4be8[0m <[0;33mcol:18[0m> [0;32m'std::streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4bc8[0m <[0;33mcol:18[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a0fd0[0m[0;1;36m '__wide'[0m [0;32m'std::streamsize':'long'[0m
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a4c58[0m <[0;33mline:768:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4c40[0m <[0;33mcol:14[0m> [0;32m'std::streamsize':'long'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4c20[0m <[0;33mcol:14[0m> [0;32m'std::streamsize':'long'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a4a68[0m[0;1;36m '__old'[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a11e8[0m <[0;33mline:782:5[0m, [0;33mline:783:39[0m> [0;33mcol:5[0m[0;1;36m sync_with_stdio[0m [0;32m'bool (bool)'[0m static
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a1128[0m <[0;33mcol:21[0m, [0;33mcol:35[0m> [0;33mcol:26[0m[0;1;36m __sync[0m [0;32m'bool'[0m cinit
[0;34m|   `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x19a3330[0m <[0;33mcol:35[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a1370[0m <[0;33mline:794:5[0m, [0;33mline:795:38[0m> [0;33mcol:5[0m referenced[0;1;36m imbue[0m [0;32m'std::locale (const std::locale &) throw()'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a12a0[0m <[0;33mcol:11[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m __loc[0m [0;32m'const std::locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a1468[0m <[0;33mline:805:5[0m, [0;33mline:807:29[0m> [0;33mline:806:5[0m[0;1;36m getloc[0m [0;32m'std::locale () const'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a4d10[0m <[0;33mline:807:5[0m, [0;33mcol:29[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a4d00[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mCXXConstructExpr[0m[0;33m 0x19a4cd0[0m <[0;33mcol:14[0m> [0;32m'std::locale'[0m[0;36m[0m[0;36m[0m [0;32m'void (const std::locale &) throw()'[0m
[0;34m|       `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4ca0[0m <[0;33mcol:14[0m> [0;32m'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m ->_M_ios_locale[0;33m 0x199f9c8[0m
[0;34m|         `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4c90[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a1558[0m <[0;33mline:816:5[0m, [0;33mline:818:29[0m> [0;33mline:817:5[0m referenced[0;1;36m _M_getloc[0m [0;32m'const std::locale &() const'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a4d78[0m <[0;33mline:818:5[0m, [0;33mcol:29[0m>
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a4d68[0m <[0;33mcol:7[0m, [0;33mcol:14[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4d38[0m <[0;33mcol:14[0m> [0;32m'const std::locale'[0m[0;36m lvalue[0m[0;36m[0m ->_M_ios_locale[0;33m 0x199f9c8[0m
[0;34m|       `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4d28[0m <[0;33mcol:14[0m> [0;32m'const std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a1658[0m <[0;33mline:835:5[0m, [0;33mline:836:20[0m> [0;33mcol:5[0m[0;1;36m xalloc[0m [0;32m'int () throw()'[0m static
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a17e0[0m <[0;33mline:851:5[0m, [0;33mline:857:5[0m> [0;33mline:852:5[0m[0;1;36m iword[0m [0;32m'long &(int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a1710[0m <[0;33mcol:11[0m, [0;33mcol:15[0m> [0;33mcol:15[0m used[0;1;36m __ix[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a5308[0m <[0;33mline:853:5[0m, [0;33mline:857:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a5290[0m <[0;33mline:854:7[0m, [0;33mline:855:47[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a4da0[0m <[0;33mline:854:7[0m, [0;33mline:855:46[0m> [0;33mline:854:15[0m used[0;1;36m __word[0m [0;32m'std::ios_base::_Words &'[0m cinit
[0;34m|   |   `-[0m[0;1;35mConditionalOperator[0m[0;33m 0x19a5208[0m <[0;33mcol:24[0m, [0;33mline:855:46[0m> [0;32m'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     |-[0m[0;1;35mParenExpr[0m[0;33m 0x19a4f68[0m <[0;33mline:854:24[0m, [0;33mcol:64[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|   |     | `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19a4f48[0m <[0;33mcol:25[0m, [0;33mcol:52[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '<'
[0;34m|   |     |   |-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x19a4e70[0m <[0;33mcol:25[0m, [0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4e58[0m <[0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4e40[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4e08[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a1710[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     |   `-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x19a4f20[0m <[0;33mcol:42[0m, [0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4f08[0m <[0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4ef0[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |         `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4ea8[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word_size[0;33m 0x199f6c0[0m
[0;34m|   |     |           `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4e98[0m <[0;33mcol:52[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     |-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x19a5018[0m <[0;33mline:855:6[0m, [0;33mcol:18[0m> [0;32m'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a4fe8[0m <[0;33mcol:6[0m> [0;32m'std::ios_base::_Words *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a4f98[0m <[0;33mcol:6[0m> [0;32m'std::ios_base::_Words *'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word[0;33m 0x199f720[0m
[0;34m|   |     | |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a4f88[0m <[0;33mcol:6[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a5000[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a4fc8[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a1710[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x19a50a8[0m <[0;33mcol:22[0m, [0;33mcol:46[0m> [0;32m'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |       |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a5048[0m <[0;33mcol:22[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->_M_grow_words[0;33m 0x199f908[0m
[0;34m|   |       | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a5038[0m <[0;33mcol:22[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a50d8[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a5078[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a1710[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |       `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x19a5098[0m <[0;33mcol:42[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m true
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a52f8[0m <[0;33mline:856:7[0m, [0;33mcol:21[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a52c8[0m <[0;33mcol:14[0m, [0;33mcol:21[0m> [0;32m'long'[0m[0;36m lvalue[0m[0;36m[0m ._M_iword[0;33m 0x199f1a8[0m
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a52a8[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a4da0[0m[0;1;36m '__word'[0m [0;32m'std::ios_base::_Words &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a19a0[0m <[0;33mline:872:5[0m, [0;33mline:878:5[0m> [0;33mline:873:5[0m[0;1;36m pword[0m [0;32m'void *&(int)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a18a0[0m <[0;33mcol:11[0m, [0;33mcol:15[0m> [0;33mcol:15[0m used[0;1;36m __ix[0m [0;32m'int'[0m
[0;34m| `-[0m[0;1;35mCompoundStmt[0m[0;33m 0x19a5788[0m <[0;33mline:874:5[0m, [0;33mline:878:5[0m>
[0;34m|   |-[0m[0;1;35mDeclStmt[0m[0;33m 0x19a5710[0m <[0;33mline:875:7[0m, [0;33mline:876:48[0m>
[0;34m|   | `-[0m[0;1;32mVarDecl[0m[0;33m 0x19a5338[0m <[0;33mline:875:7[0m, [0;33mline:876:47[0m> [0;33mline:875:15[0m used[0;1;36m __word[0m [0;32m'std::ios_base::_Words &'[0m cinit
[0;34m|   |   `-[0m[0;1;35mConditionalOperator[0m[0;33m 0x19a5688[0m <[0;33mcol:24[0m, [0;33mline:876:47[0m> [0;32m'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     |-[0m[0;1;35mParenExpr[0m[0;33m 0x19a5500[0m <[0;33mline:875:24[0m, [0;33mcol:64[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m
[0;34m|   |     | `-[0m[0;1;35mBinaryOperator[0m[0;33m 0x19a54e0[0m <[0;33mcol:25[0m, [0;33mcol:52[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m '<'
[0;34m|   |     |   |-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x19a5408[0m <[0;33mcol:25[0m, [0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |   | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a53f0[0m <[0;33mcol:35[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |   |   `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a53d8[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |   |     `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a53a0[0m <[0;33mcol:35[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a18a0[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     |   `-[0m[0;1;35mCStyleCastExpr[0m[0;33m 0x19a54b8[0m <[0;33mcol:42[0m, [0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mNoOp[0m>
[0;34m|   |     |     `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a54a0[0m <[0;33mcol:52[0m> [0;32m'unsigned int'[0m[0;36m[0m[0;36m[0m <[0;31mIntegralCast[0m> part_of_explicit_cast
[0;34m|   |     |       `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a5488[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m> part_of_explicit_cast
[0;34m|   |     |         `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a5440[0m <[0;33mcol:52[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word_size[0;33m 0x199f6c0[0m
[0;34m|   |     |           `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a5430[0m <[0;33mcol:52[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     |-[0m[0;1;35mArraySubscriptExpr[0m[0;33m 0x19a55b0[0m <[0;33mline:876:6[0m, [0;33mcol:18[0m> [0;32m'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |     | |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a5580[0m <[0;33mcol:6[0m> [0;32m'std::ios_base::_Words *'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     | | `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a5530[0m <[0;33mcol:6[0m> [0;32m'std::ios_base::_Words *'[0m[0;36m lvalue[0m[0;36m[0m ->_M_word[0;33m 0x199f720[0m
[0;34m|   |     | |   `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a5520[0m <[0;33mcol:6[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |     | `-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a5598[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |     |   `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a5560[0m <[0;33mcol:14[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a18a0[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |     `-[0m[0;1;35mCXXMemberCallExpr[0m[0;33m 0x19a5640[0m <[0;33mcol:22[0m, [0;33mcol:47[0m> [0;32m'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m
[0;34m|   |       |-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a55e0[0m <[0;33mcol:22[0m> [0;32m'<bound member function type>'[0m[0;36m[0m[0;36m[0m ->_M_grow_words[0;33m 0x199f908[0m
[0;34m|   |       | `-[0m[0;1;35mCXXThisExpr[0m[0;33m 0x19a55d0[0m <[0;33mcol:22[0m> [0;32m'std::ios_base *'[0m[0;36m[0m[0;36m[0m implicit this
[0;34m|   |       |-[0m[0;1;35mImplicitCastExpr[0m[0;33m 0x19a5670[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m[0m[0;36m[0m <[0;31mLValueToRValue[0m>
[0;34m|   |       | `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a5610[0m <[0;33mcol:36[0m> [0;32m'int'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mParmVar[0m[0;33m 0x19a18a0[0m[0;1;36m '__ix'[0m [0;32m'int'[0m
[0;34m|   |       `-[0m[0;1;35mCXXBoolLiteralExpr[0m[0;33m 0x19a5630[0m <[0;33mcol:42[0m> [0;32m'bool'[0m[0;36m[0m[0;36m[0m false
[0;34m|   `-[0m[0;1;35mReturnStmt[0m[0;33m 0x19a5778[0m <[0;33mline:877:7[0m, [0;33mcol:21[0m>
[0;34m|     `-[0m[0;1;35mMemberExpr[0m[0;33m 0x19a5748[0m <[0;33mcol:14[0m, [0;33mcol:21[0m> [0;32m'void *'[0m[0;36m lvalue[0m[0;36m[0m ._M_pword[0;33m 0x199f140[0m
[0;34m|       `-[0m[0;1;35mDeclRefExpr[0m[0;33m 0x19a5728[0m <[0;33mcol:14[0m> [0;32m'std::ios_base::_Words'[0m[0;36m lvalue[0m[0;36m[0m [0;1;32mVar[0m[0;33m 0x19a5338[0m[0;1;36m '__word'[0m [0;32m'std::ios_base::_Words &'[0m
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x19a1a90[0m <[0;33mline:889:5[0m, [0;33mcol:23[0m> [0;33mcol:13[0m[0;1;36m ~ios_base[0m [0;32m'void () throw()'[0m virtual
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19a1b70[0m <[0;33mline:891:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19a1bd8[0m <[0;33mline:892:5[0m, [0;33mcol:23[0m> [0;33mcol:5[0m referenced[0;1;36m ios_base[0m [0;32m'void () throw()'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19a1c80[0m <[0;33mline:903:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19a1da8[0m <[0;33mline:904:5[0m, [0;33mcol:38[0m> [0;33mcol:5[0m[0;1;36m ios_base[0m [0;32m'void (const std::ios_base &)'[0m delete
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a1ce8[0m <[0;33mcol:14[0m, [0;33mcol:28[0m> [0;33mcol:29[0m [0;32m'const std::ios_base &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a1f38[0m <[0;33mline:906:5[0m, [0;33mline:907:39[0m> [0;33mcol:5[0m[0;1;36m operator=[0m [0;32m'std::ios_base &(const std::ios_base &)'[0m delete
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a1e78[0m <[0;33mcol:15[0m, [0;33mcol:29[0m> [0;33mcol:30[0m [0;32m'const std::ios_base &'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19a1fe0[0m <[0;33mline:909:3[0m, [0;33mcol:12[0m> [0;33mcol:3[0m protected
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a2110[0m <[0;33mline:910:5[0m, [0;33mline:911:24[0m> [0;33mcol:5[0m referenced[0;1;36m _M_move[0m [0;32m'void (std::ios_base &) noexcept'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a2018[0m <[0;33mcol:13[0m, [0;33mcol:21[0m> [0;33mcol:22[0m [0;32m'std::ios_base &'[0m
[0;34m`-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19a2260[0m <[0;33mline:913:5[0m, [0;33mline:914:30[0m> [0;33mcol:5[0m referenced[0;1;36m _M_swap[0m [0;32m'void (std::ios_base &) noexcept'[0m
[0;34m  `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19a21c8[0m <[0;33mcol:13[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __rhs[0m [0;32m'std::ios_base &'[0m

Layout: <CGRecordLayout
  LLVMType:%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
  NonVirtualBaseLLVMType:%"class.std::ios_base" = type { i32 (...)**, i64, i64, i32, i32, i32, %"struct.std::ios_base::_Callback_list"*, %"struct.std::ios_base::_Words", [8 x %"struct.std::ios_base::_Words"], i32, %"struct.std::ios_base::_Words"*, %"class.std::locale" }
  IsZeroInitializable:1
  BitFields:[
]>

*** Dumping AST Record Layout
         0 | class std::basic_streambuf<char>
         0 |   (basic_streambuf vtable pointer)
         8 |   std::basic_streambuf<char>::char_type * _M_in_beg
        16 |   std::basic_streambuf<char>::char_type * _M_in_cur
        24 |   std::basic_streambuf<char>::char_type * _M_in_end
        32 |   std::basic_streambuf<char>::char_type * _M_out_beg
        40 |   std::basic_streambuf<char>::char_type * _M_out_cur
        48 |   std::basic_streambuf<char>::char_type * _M_out_end
        56 |   class std::locale _M_buf_locale
        56 |     class std::locale::_Impl * _M_impl
           | [sizeof=64, dsize=64, align=8,
           |  nvsize=64, nvalign=8]

*** Dumping IRgen Record Layout
Record: [0;1;32mClassTemplateSpecializationDecl[0m[0;33m 0x110c330[0m parent 0x1103268 <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/bits/streambuf.tcc:149:3[0m, [0;33mcol:45[0m> [0;33mcol:25[0m class[0;1;36m basic_streambuf[0m definition
[0;34m|-[0m[0;1;32mDefinitionData[0m polymorphic has_user_declared_ctor can_const_default_init
[0;34m| |-[0m[0;1;32mDefaultConstructor[0m exists non_trivial user_provided
[0;34m| |-[0m[0;1;32mCopyConstructor[0m non_trivial user_declared has_const_param needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveConstructor[0m needs_overload_resolution
[0;34m| |-[0m[0;1;32mCopyAssignment[0m non_trivial has_const_param user_declared needs_overload_resolution implicit_has_const_param
[0;34m| |-[0m[0;1;32mMoveAssignment[0m needs_overload_resolution
[0;34m| `-[0m[0;1;32mDestructor[0m non_trivial user_declared needs_overload_resolution
[0;34m|-[0mTemplateArgument type [0;32m'char'[0m
[0;34m| `-[0m[0;32mBuiltinType[0m[0;33m 0xfe9990[0m [0;32m'char'[0m
[0;34m|-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mRecordType[0m[0;33m 0x10b2520[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x12a76d0[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mCXXRecordDecl[0m[0;33m 0x19d8288[0m <[0;33m/usr/bin/../lib/gcc/x86_64-linux-gnu/12/../../../../include/c++/12/streambuf:122:5[0m, [0;33mcol:11[0m> [0;33mcol:11[0m implicit class[0;1;36m basic_streambuf[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19d8318[0m <[0;33mline:124:5[0m, [0;33mcol:11[0m> [0;33mcol:5[0m public
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x19d8378[0m <[0;33mline:131:7[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m char_type[0m [0;32m'char':'char'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x19d8340[0m [0;32m'char'[0m sugar
[0;34m|   |-[0m[0;32mTemplateTypeParmType[0m[0;33m 0x19b1700[0m [0;32m'_CharT'[0m dependent depth 0 index 0
[0;34m|   | `-[0m[0;1;32mTemplateTypeParm[0m[0;33m 0x19b16b0[0m[0;1;36m '_CharT'[0m
[0;34m|   `-[0m[0;32mBuiltinType[0m[0;33m 0xfe9990[0m [0;32m'char'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x19d8408[0m <[0;33mline:132:7[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m traits_type[0m [0;32m'std::char_traits<char>':'std::char_traits<char>'[0m
[0;34m| `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x19d83d0[0m [0;32m'std::char_traits<char>'[0m sugar
[0;34m|   |-[0m[0;32mTemplateTypeParmType[0m[0;33m 0x19b1780[0m [0;32m'_Traits'[0m dependent depth 0 index 1
[0;34m|   | `-[0m[0;1;32mTemplateTypeParm[0m[0;33m 0x19b1728[0m[0;1;36m '_Traits'[0m
[0;34m|   `-[0m[0;32mRecordType[0m[0;33m 0x10b2520[0m [0;32m'std::char_traits<char>'[0m
[0;34m|     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x12a76d0[0m[0;1;36m 'char_traits'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x19d8510[0m <[0;33mline:133:7[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m int_type[0m [0;32m'typename traits_type::int_type':'int'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x19d84c0[0m [0;32m'typename traits_type::int_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x12a96a0[0m [0;32m'std::char_traits<char>::int_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x12a79c8[0m[0;1;36m 'int_type'[0m
[0;34m|     `-[0m[0;32mBuiltinType[0m[0;33m 0xfe99f0[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x19d8600[0m <[0;33mline:134:7[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m pos_type[0m [0;32m'typename traits_type::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x19d85b0[0m [0;32m'typename traits_type::pos_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x19d8590[0m [0;32m'std::char_traits<char>::pos_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x12a7a30[0m[0;1;36m 'pos_type'[0m
[0;34m|     `-[0m[0;32mTypedefType[0m[0;33m 0x129c8b0[0m [0;32m'std::streampos'[0m sugar
[0;34m|       |-[0m[0;1;32mTypedef[0m[0;33m 0x1102f20[0m[0;1;36m 'streampos'[0m
[0;34m|       `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x1102ea0[0m [0;32m'fpos<mbstate_t>'[0m sugar fpos
[0;34m|         |-[0mTemplateArgument type [0;32m'mbstate_t':'__mbstate_t'[0m
[0;34m|         | `-[0m[0;32mUsingType[0m[0;33m 0x1102d60[0m [0;32m'mbstate_t'[0m sugar
[0;34m|         |   |-[0m[0;1;32mUsingShadow[0m[0;33m 0x10f77b8[0m[0;1;36m 'mbstate_t'[0m
[0;34m|         |   `-[0m[0;32mTypedefType[0m[0;33m 0x10e5440[0m [0;32m'mbstate_t'[0m sugar
[0;34m|         |     |-[0m[0;1;32mTypedef[0m[0;33m 0x10c60c0[0m[0;1;36m 'mbstate_t'[0m
[0;34m|         |     `-[0m[0;32mTypedefType[0m[0;33m 0x10c6090[0m [0;32m'__mbstate_t'[0m sugar
[0;34m|         |       |-[0m[0;1;32mTypedef[0m[0;33m 0x10c6018[0m[0;1;36m '__mbstate_t'[0m
[0;34m|         |       `-[0m[0;32mElaboratedType[0m[0;33m 0x10c5fc0[0m [0;32m'struct __mbstate_t'[0m sugar
[0;34m|         |         `-[0m[0;32mRecordType[0m[0;33m 0x10c5ba0[0m [0;32m'__mbstate_t'[0m
[0;34m|         |           `-[0m[0;1;32mCXXRecord[0m[0;33m 0x10c5b10[0m[0;1;36m ''[0m
[0;34m|         `-[0m[0;32mRecordType[0m[0;33m 0x1102e80[0m [0;32m'std::fpos<__mbstate_t>'[0m
[0;34m|           `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x1102d98[0m[0;1;36m 'fpos'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x19d86f0[0m <[0;33mline:135:7[0m, [0;33mcol:48[0m> [0;33mcol:48[0m[0;1;36m off_type[0m [0;32m'typename traits_type::off_type':'long'[0m
[0;34m| `-[0m[0;32mElaboratedType[0m[0;33m 0x19d86a0[0m [0;32m'typename traits_type::off_type'[0m sugar
[0;34m|   `-[0m[0;32mTypedefType[0m[0;33m 0x19d8680[0m [0;32m'std::char_traits<char>::off_type'[0m sugar
[0;34m|     |-[0m[0;1;32mTypedef[0m[0;33m 0x12a7a98[0m[0;1;36m 'off_type'[0m
[0;34m|     `-[0m[0;32mTypedefType[0m[0;33m 0x10fda10[0m [0;32m'std::streamoff'[0m sugar
[0;34m|       |-[0m[0;1;32mTypedef[0m[0;33m 0x10fd500[0m[0;1;36m 'streamoff'[0m
[0;34m|       `-[0m[0;32mBuiltinType[0m[0;33m 0xfe9a10[0m [0;32m'long'[0m
[0;34m|-[0m[0;1;32mTypedefDecl[0m[0;33m 0x19d8810[0m <[0;33mline:140:7[0m, [0;33mcol:57[0m> [0;33mcol:57[0m[0;1;36m __streambuf_type[0m [0;32m'basic_streambuf<std::basic_streambuf<char>::char_type, std::basic_streambuf<char>::traits_type>':'std::basic_streambuf<char>'[0m
[0;34m| `-[0m[0;32mTemplateSpecializationType[0m[0;33m 0x19d8790[0m [0;32m'basic_streambuf<std::basic_streambuf<char>::char_type, std::basic_streambuf<char>::traits_type>'[0m sugar basic_streambuf
[0;34m|   |-[0mTemplateArgument type [0;32m'std::basic_streambuf<char>::char_type':'char'[0m
[0;34m|   | `-[0m[0;32mTypedefType[0m[0;33m 0x19d8750[0m [0;32m'std::basic_streambuf<char>::char_type'[0m sugar
[0;34m|   |   |-[0m[0;1;32mTypedef[0m[0;33m 0x19d8378[0m[0;1;36m 'char_type'[0m
[0;34m|   |   `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x19d8340[0m [0;32m'char'[0m sugar
[0;34m|   |     |-[0m[0;32mTemplateTypeParmType[0m[0;33m 0x19b1700[0m [0;32m'_CharT'[0m dependent depth 0 index 0
[0;34m|   |     | `-[0m[0;1;32mTemplateTypeParm[0m[0;33m 0x19b16b0[0m[0;1;36m '_CharT'[0m
[0;34m|   |     `-[0m[0;32mBuiltinType[0m[0;33m 0xfe9990[0m [0;32m'char'[0m
[0;34m|   |-[0mTemplateArgument type [0;32m'std::basic_streambuf<char>::traits_type':'std::char_traits<char>'[0m
[0;34m|   | `-[0m[0;32mTypedefType[0m[0;33m 0x19d8460[0m [0;32m'std::basic_streambuf<char>::traits_type'[0m sugar
[0;34m|   |   |-[0m[0;1;32mTypedef[0m[0;33m 0x19d8408[0m[0;1;36m 'traits_type'[0m
[0;34m|   |   `-[0m[0;32mSubstTemplateTypeParmType[0m[0;33m 0x19d83d0[0m [0;32m'std::char_traits<char>'[0m sugar
[0;34m|   |     |-[0m[0;32mTemplateTypeParmType[0m[0;33m 0x19b1780[0m [0;32m'_Traits'[0m dependent depth 0 index 1
[0;34m|   |     | `-[0m[0;1;32mTemplateTypeParm[0m[0;33m 0x19b1728[0m[0;1;36m '_Traits'[0m
[0;34m|   |     `-[0m[0;32mRecordType[0m[0;33m 0x10b2520[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   |       `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x12a76d0[0m[0;1;36m 'char_traits'[0m
[0;34m|   `-[0m[0;32mRecordType[0m[0;33m 0x110c430[0m [0;32m'std::basic_streambuf<char>'[0m
[0;34m|     `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x110c330[0m[0;1;36m 'basic_streambuf'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19d8958[0m <[0;33mline:143:7[0m, [0;33mcol:52[0m> [0;33mcol:14[0m [0;32m'class basic_ios<char_type, traits_type>':'std::basic_ios<char>'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19d8a88[0m <[0;33mline:144:7[0m, [0;33mcol:56[0m> [0;33mcol:14[0m [0;32m'class basic_istream<char_type, traits_type>':'std::basic_istream<char>'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19d8bb8[0m <[0;33mline:145:7[0m, [0;33mcol:56[0m> [0;33mcol:14[0m [0;32m'class basic_ostream<char_type, traits_type>':'std::basic_ostream<char>'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19d8ce8[0m <[0;33mline:146:7[0m, [0;33mcol:62[0m> [0;33mcol:14[0m [0;32m'class istreambuf_iterator<char_type, traits_type>':'std::istreambuf_iterator<char>'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19d8e18[0m <[0;33mline:147:7[0m, [0;33mcol:62[0m> [0;33mcol:14[0m [0;32m'class ostreambuf_iterator<char_type, traits_type>':'std::ostreambuf_iterator<char>'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19d91a0[0m <[0;33mline:149:7[0m, [0;33mline:150:72[0m> [0;33mcol:7[0m
[0;34m| `-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19d9028[0m parent 0x19b0f10 prev 0x19d0898 <[0;33mline:149:7[0m, [0;33mline:150:72[0m> [0;33mcol:7[0m[0;1;36m __copy_streambufs_eof[0m [0;32m'std::streamsize (std::basic_streambuf<char> *, std::basic_streambuf<char> *, bool &)'[0m
[0;34m|   |-[0mTemplateArgument type [0;32m'char'[0m
[0;34m|   | `-[0m[0;32mBuiltinType[0m[0;33m 0xfe9990[0m [0;32m'char'[0m
[0;34m|   |-[0mTemplateArgument type [0;32m'std::char_traits<char>'[0m
[0;34m|   | `-[0m[0;32mRecordType[0m[0;33m 0x10b2520[0m [0;32m'std::char_traits<char>'[0m
[0;34m|   |   `-[0m[0;1;32mClassTemplateSpecialization[0m[0;33m 0x12a76d0[0m[0;1;36m 'char_traits'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19d8e68[0m <[0;33mcol:31[0m, [0;33mcol:46[0m> [0;33mcol:47[0m [0;32m'std::basic_streambuf<char> *'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19d8ee0[0m <[0;33mcol:49[0m, [0;33mcol:64[0m> [0;33mcol:65[0m [0;32m'std::basic_streambuf<char> *'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19d8f48[0m <[0;33mcol:67[0m, [0;33mcol:71[0m> [0;33mcol:72[0m [0;32m'bool &'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19d9a50[0m <[0;33mline:152:7[0m, [0;33mline:156:48[0m> [0;33mline:155:9[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x19d9970[0m parent 0x19b0f10 prev 0x15c78d8 <[0;33mline:152:7[0m, [0;33mline:156:48[0m> [0;33mline:155:9[0m[0;1;36m __copy_move_a2[0m
[0;34m|   |-[0m[0;1;32mNonTypeTemplateParmDecl[0m[0;33m 0x19d91e0[0m <[0;33mline:152:16[0m, [0;33mcol:21[0m> [0;33mcol:21[0m [0;32m'bool'[0m depth 0 index 0[0;1;36m _IsMove[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19d9240[0m <[0;33mcol:30[0m, [0;33mcol:39[0m> [0;33mcol:39[0m typename depth 0 index 1[0;1;36m _CharT2[0m
[0;34m|   `-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19d98a8[0m parent 0x19b0f10 prev 0x15c7838 <[0;33mline:153:9[0m, [0;33mline:156:48[0m> [0;33mline:155:9[0m[0;1;36m __copy_move_a2[0m [0;32m'typename __gnu_cxx::__enable_if<__is_char<_CharT2>::__value, _CharT2 *>::__type (istreambuf_iterator<_CharT2>, istreambuf_iterator<_CharT2>, _CharT2 *)'[0m
[0;34m|     |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19d95f0[0m <[0;33mcol:24[0m, [0;33mcol:51[0m> [0;33mcol:52[0m [0;32m'istreambuf_iterator<_CharT2>'[0m
[0;34m|     |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19d9740[0m <[0;33mline:156:10[0m, [0;33mcol:37[0m> [0;33mcol:38[0m [0;32m'istreambuf_iterator<_CharT2>'[0m
[0;34m|     `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19d97b8[0m <[0;33mcol:40[0m, [0;33mcol:47[0m> [0;33mcol:48[0m [0;32m'_CharT2 *'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19da430[0m <[0;33mline:158:7[0m, [0;33mline:162:21[0m> [0;33mline:161:9[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x19da350[0m parent 0x19b0f10 <[0;33mline:158:7[0m, [0;33mline:162:21[0m> [0;33mline:161:9[0m[0;1;36m find[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19d9a90[0m <[0;33mline:158:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _CharT2[0m
[0;34m|   `-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19da288[0m parent 0x19b0f10 <[0;33mline:159:9[0m, [0;33mline:162:21[0m> [0;33mline:161:9[0m[0;1;36m find[0m [0;32m'typename __gnu_cxx::__enable_if<__is_char<_CharT2>::__value, istreambuf_iterator<_CharT2>>::__type (istreambuf_iterator<_CharT2>, istreambuf_iterator<_CharT2>, const _CharT2 &)'[0m
[0;34m|     |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19d9f60[0m <[0;33mcol:14[0m, [0;33mcol:41[0m> [0;33mcol:42[0m [0;32m'istreambuf_iterator<_CharT2>'[0m
[0;34m|     |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19da0b0[0m <[0;33mcol:44[0m, [0;33mcol:71[0m> [0;33mcol:72[0m [0;32m'istreambuf_iterator<_CharT2>'[0m
[0;34m|     `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19da158[0m <[0;33mline:162:7[0m, [0;33mcol:20[0m> [0;33mcol:21[0m [0;32m'const _CharT2 &'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19dac98[0m <[0;33mline:164:7[0m, [0;33mline:167:57[0m> [0;33mcol:9[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x19daba8[0m parent 0x19b0f10 <[0;33mline:164:7[0m, [0;33mline:167:57[0m> [0;33mcol:9[0m[0;1;36m advance[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19da470[0m <[0;33mline:164:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _CharT2[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19da4e8[0m <[0;33mcol:34[0m, [0;33mcol:43[0m> [0;33mcol:43[0m typename depth 0 index 1[0;1;36m _Distance[0m
[0;34m|   `-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19daae8[0m parent 0x19b0f10 <[0;33mline:165:9[0m, [0;33mline:167:57[0m> [0;33mcol:9[0m[0;1;36m advance[0m [0;32m'typename __gnu_cxx::__enable_if<__is_char<_CharT2>::__value, void>::__type (istreambuf_iterator<_CharT2> &, _Distance)'[0m
[0;34m|     |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19da950[0m <[0;33mcol:17[0m, [0;33mcol:45[0m> [0;33mcol:46[0m [0;32m'istreambuf_iterator<_CharT2> &'[0m
[0;34m|     `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19da9c8[0m <[0;33mcol:48[0m> [0;33mcol:57[0m [0;32m'_Distance'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19daf10[0m <[0;33mline:169:7[0m, [0;33mcol:64[0m> [0;33mcol:19[0m
[0;34m| `-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19dae48[0m parent 0x19b0f10 <[0;33mcol:7[0m, [0;33mcol:64[0m> [0;33mcol:19[0m[0;1;36m __istream_extract[0m [0;32m'void (std::istream &, char *, std::streamsize)'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dacd8[0m <[0;33mcol:37[0m, [0;33mcol:44[0m> [0;33mcol:45[0m [0;32m'std::istream &'[0m
[0;34m|   |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dad40[0m <[0;33mcol:47[0m, [0;33mcol:51[0m> [0;33mcol:52[0m [0;32m'char *'[0m
[0;34m|   `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dada8[0m <[0;33mcol:54[0m> [0;33mcol:64[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19db678[0m <[0;33mline:171:7[0m, [0;33mline:174:46[0m> [0;33mline:173:9[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x19db598[0m parent 0x19b0f10 prev 0x190ceb8 <[0;33mline:171:7[0m, [0;33mline:174:46[0m> [0;33mline:173:9[0m[0;1;36m operator>>[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19daf50[0m <[0;33mline:171:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _CharT2[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19dafc8[0m <[0;33mcol:34[0m, [0;33mcol:43[0m> [0;33mcol:43[0m typename depth 0 index 1[0;1;36m _Traits2[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19db048[0m <[0;33mcol:53[0m, [0;33mcol:62[0m> [0;33mcol:62[0m typename depth 0 index 2[0;1;36m _Alloc[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19db4d8[0m parent 0x19b0f10 prev 0x190ce18 <[0;33mline:172:9[0m, [0;33mline:174:46[0m> [0;33mline:173:9[0m[0;1;36m operator>>[0m [0;32m'basic_istream<_CharT2, _Traits2> &(basic_istream<_CharT2, _Traits2> &, basic_string<_CharT2, _Traits2, _Alloc> &)'[0m
[0;34m|   | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19db278[0m <[0;33mcol:20[0m, [0;33mcol:52[0m> [0;33mcol:53[0m [0;32m'basic_istream<_CharT2, _Traits2> &'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19db3e0[0m <[0;33mline:174:6[0m, [0;33mcol:45[0m> [0;33mcol:46[0m [0;32m'basic_string<_CharT2, _Traits2, _Alloc> &'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x175ae20[0m[0;1;36m 'operator>>'[0m [0;32m'basic_istream<char> &(basic_istream<char> &, basic_string<char> &)'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x1915158[0m[0;1;36m 'operator>>'[0m [0;32m'basic_istream<wchar_t, std::char_traits<wchar_t>> &(basic_istream<wchar_t, std::char_traits<wchar_t>> &, basic_string<wchar_t, std::char_traits<wchar_t>, std::allocator<wchar_t>> &)'[0m
[0;34m|-[0m[0;1;32mFriendDecl[0m[0;33m 0x19dbe70[0m <[0;33mline:176:7[0m, [0;33mline:179:52[0m> [0;33mline:178:9[0m
[0;34m| `-[0m[0;1;32mFunctionTemplateDecl[0m[0;33m 0x19dbd90[0m parent 0x19b0f10 prev 0x1910528 <[0;33mline:176:7[0m, [0;33mline:179:52[0m> [0;33mline:178:9[0m[0;1;36m getline[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19db6b8[0m <[0;33mline:176:16[0m, [0;33mcol:25[0m> [0;33mcol:25[0m typename depth 0 index 0[0;1;36m _CharT2[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19db738[0m <[0;33mcol:34[0m, [0;33mcol:43[0m> [0;33mcol:43[0m typename depth 0 index 1[0;1;36m _Traits2[0m
[0;34m|   |-[0m[0;1;32mTemplateTypeParmDecl[0m[0;33m 0x19db7b8[0m <[0;33mcol:53[0m, [0;33mcol:62[0m> [0;33mcol:62[0m typename depth 0 index 2[0;1;36m _Alloc[0m
[0;34m|   |-[0m[0;1;32mFunctionDecl[0m[0;33m 0x19dbcc8[0m parent 0x19b0f10 prev 0x1910488 <[0;33mline:177:9[0m, [0;33mline:179:52[0m> [0;33mline:178:9[0m[0;1;36m getline[0m [0;32m'basic_istream<_CharT2, _Traits2> &(basic_istream<_CharT2, _Traits2> &, basic_string<_CharT2, _Traits2, _Alloc> &, _CharT2)'[0m
[0;34m|   | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19db9e8[0m <[0;33mcol:17[0m, [0;33mcol:49[0m> [0;33mcol:50[0m [0;32m'basic_istream<_CharT2, _Traits2> &'[0m
[0;34m|   | |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dbb50[0m <[0;33mline:179:3[0m, [0;33mcol:42[0m> [0;33mcol:43[0m [0;32m'basic_string<_CharT2, _Traits2, _Alloc> &'[0m
[0;34m|   | `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dbbc8[0m <[0;33mcol:45[0m> [0;33mcol:52[0m [0;32m'_CharT2'[0m
[0;34m|   |-[0m[0;1;32mFunction[0m[0;33m 0x175e940[0m[0;1;36m 'getline'[0m [0;32m'basic_istream<char> &(basic_istream<char> &, basic_string<char> &, char)'[0m
[0;34m|   `-[0m[0;1;32mFunction[0m[0;33m 0x175f810[0m[0;1;36m 'getline'[0m [0;32m'basic_istream<wchar_t> &(basic_istream<wchar_t> &, basic_string<wchar_t> &, wchar_t)'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19dbeb0[0m <[0;33mline:181:5[0m, [0;33mcol:14[0m> [0;33mcol:5[0m protected
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19dbf18[0m <[0;33mline:189:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _M_in_beg[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19dbf78[0m <[0;33mline:190:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _M_in_cur[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19dbfd8[0m <[0;33mline:191:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _M_in_end[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19dc038[0m <[0;33mline:192:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _M_out_beg[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19dc098[0m <[0;33mline:193:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _M_out_cur[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19dc0f8[0m <[0;33mline:194:7[0m, [0;33mcol:20[0m> [0;33mcol:20[0m[0;1;36m _M_out_end[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m|-[0m[0;1;32mFieldDecl[0m[0;33m 0x19dc148[0m <[0;33mline:197:7[0m, [0;33mcol:17[0m> [0;33mcol:17[0m[0;1;36m _M_buf_locale[0m [0;32m'std::locale'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19dc198[0m <[0;33mline:199:3[0m, [0;33mcol:9[0m> [0;33mcol:3[0m public
[0;34m|-[0m[0;1;32mCXXDestructorDecl[0m[0;33m 0x19dc1e8[0m <[0;33mline:201:7[0m, [0;33mline:203:9[0m> [0;33mline:202:7[0m[0;1;36m ~basic_streambuf[0m [0;32m'void ()'[0m virtual noexcept-unevaluated 0x19dc1e8
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dc370[0m <[0;33mline:213:7[0m, [0;33mline:220:7[0m> [0;33mline:214:7[0m[0;1;36m pubimbue[0m [0;32m'std::locale (const std::locale &)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dc2e0[0m <[0;33mcol:16[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __loc[0m [0;32m'const std::locale &'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dc428[0m <[0;33mline:230:7[0m, [0;33mline:232:31[0m> [0;33mline:231:7[0m[0;1;36m getloc[0m [0;32m'std::locale () const'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dc668[0m <[0;33mline:243:7[0m, [0;33mline:245:40[0m> [0;33mline:244:7[0m[0;1;36m pubsetbuf[0m [0;32m'std::basic_streambuf<char> *(std::basic_streambuf<char>::char_type *, std::streamsize)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dc4e8[0m <[0;33mcol:17[0m, [0;33mcol:28[0m> [0;33mcol:28[0m[0;1;36m __s[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dc550[0m <[0;33mcol:33[0m, [0;33mcol:44[0m> [0;33mcol:44[0m[0;1;36m __n[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dc978[0m <[0;33mline:255:7[0m, [0;33mline:258:53[0m> [0;33mline:256:7[0m[0;1;36m pubseekoff[0m [0;32m'std::basic_streambuf<char>::pos_type (std::basic_streambuf<char>::off_type, ios_base::seekdir, ios_base::openmode)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dc780[0m <[0;33mcol:18[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __off[0m [0;32m'std::basic_streambuf<char>::off_type':'long'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dc7e8[0m <[0;33mcol:34[0m, [0;33mcol:52[0m> [0;33mcol:52[0m[0;1;36m __way[0m [0;32m'ios_base::seekdir':'std::_Ios_Seekdir'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dc850[0m <[0;33mline:257:4[0m, [0;33mcol:57[0m> [0;33mcol:23[0m[0;1;36m __mode[0m [0;32m'ios_base::openmode':'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dcbc8[0m <[0;33mline:267:7[0m, [0;33mline:270:45[0m> [0;33mline:268:7[0m[0;1;36m pubseekpos[0m [0;32m'std::basic_streambuf<char>::pos_type (std::basic_streambuf<char>::pos_type, ios_base::openmode)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dca50[0m <[0;33mcol:18[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __sp[0m [0;32m'std::basic_streambuf<char>::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dcab8[0m <[0;33mline:269:4[0m, [0;33mcol:57[0m> [0;33mcol:23[0m[0;1;36m __mode[0m [0;32m'ios_base::openmode':'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dcc88[0m <[0;33mline:275:7[0m, [0;33mline:276:40[0m> [0;33mcol:7[0m[0;1;36m pubsync[0m [0;32m'int ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dcd38[0m <[0;33mline:288:7[0m, [0;33mline:293:7[0m> [0;33mline:289:7[0m[0;1;36m in_avail[0m [0;32m'std::streamsize ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dce58[0m <[0;33mline:302:7[0m, [0;33mline:310:7[0m> [0;33mline:303:7[0m[0;1;36m snextc[0m [0;32m'std::basic_streambuf<char>::int_type ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dcf28[0m <[0;33mline:320:7[0m, [0;33mline:332:7[0m> [0;33mline:321:7[0m[0;1;36m sbumpc[0m [0;32m'std::basic_streambuf<char>::int_type ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dcff8[0m <[0;33mline:342:7[0m, [0;33mline:351:7[0m> [0;33mline:343:7[0m[0;1;36m sgetc[0m [0;32m'std::basic_streambuf<char>::int_type ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dd238[0m <[0;33mline:361:7[0m, [0;33mline:363:40[0m> [0;33mline:362:7[0m[0;1;36m sgetn[0m [0;32m'std::streamsize (std::basic_streambuf<char>::char_type *, std::streamsize)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dd0b8[0m <[0;33mcol:13[0m, [0;33mcol:24[0m> [0;33mcol:24[0m[0;1;36m __s[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dd120[0m <[0;33mcol:29[0m, [0;33mcol:40[0m> [0;33mcol:40[0m[0;1;36m __n[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dd3f8[0m <[0;33mline:376:7[0m, [0;33mline:390:7[0m> [0;33mline:377:7[0m[0;1;36m sputbackc[0m [0;32m'std::basic_streambuf<char>::int_type (std::basic_streambuf<char>::char_type)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dd308[0m <[0;33mcol:17[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __c[0m [0;32m'std::basic_streambuf<char>::char_type':'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dd4d0[0m <[0;33mline:401:7[0m, [0;33mline:413:7[0m> [0;33mline:402:7[0m[0;1;36m sungetc[0m [0;32m'std::basic_streambuf<char>::int_type ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dd620[0m <[0;33mline:428:7[0m, [0;33mline:441:7[0m> [0;33mline:429:7[0m[0;1;36m sputc[0m [0;32m'std::basic_streambuf<char>::int_type (std::basic_streambuf<char>::char_type)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dd590[0m <[0;33mcol:13[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __c[0m [0;32m'std::basic_streambuf<char>::char_type':'char'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19dd898[0m <[0;33mline:454:7[0m, [0;33mline:456:40[0m> [0;33mline:455:7[0m[0;1;36m sputn[0m [0;32m'std::streamsize (const std::basic_streambuf<char>::char_type *, std::streamsize)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dd718[0m <[0;33mcol:13[0m, [0;33mcol:30[0m> [0;33mcol:30[0m[0;1;36m __s[0m [0;32m'const std::basic_streambuf<char>::char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dd780[0m <[0;33mcol:35[0m, [0;33mcol:46[0m> [0;33mcol:46[0m[0;1;36m __n[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mAccessSpecDecl[0m[0;33m 0x19dd958[0m <[0;33mline:458:5[0m, [0;33mcol:14[0m> [0;33mcol:5[0m protected
[0;34m|-[0m[0;1;32mCXXConstructorDecl[0m[0;33m 0x19dd9b8[0m <[0;33mline:468:7[0m, [0;33mline:472:9[0m> [0;33mline:468:7[0m[0;1;36m basic_streambuf[0m [0;32m'void ()'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19ddab8[0m <[0;33mline:486:7[0m, [0;33mline:487:41[0m> [0;33mcol:7[0m[0;1;36m eback[0m [0;32m'std::basic_streambuf<char>::char_type *() const'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19ddb88[0m <[0;33mline:489:7[0m, [0;33mline:490:42[0m> [0;33mcol:7[0m[0;1;36m gptr[0m [0;32m'std::basic_streambuf<char>::char_type *() const'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19ddc58[0m <[0;33mline:492:7[0m, [0;33mline:493:41[0m> [0;33mcol:7[0m[0;1;36m egptr[0m [0;32m'std::basic_streambuf<char>::char_type *() const'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19ddd98[0m <[0;33mline:502:7[0m, [0;33mline:503:42[0m> [0;33mcol:7[0m[0;1;36m gbump[0m [0;32m'void (int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19ddd08[0m <[0;33mcol:13[0m, [0;33mcol:17[0m> [0;33mcol:17[0m[0;1;36m __n[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19de038[0m <[0;33mline:513:7[0m, [0;33mline:519:7[0m> [0;33mline:514:7[0m[0;1;36m setg[0m [0;32m'void (std::basic_streambuf<char>::char_type *, std::basic_streambuf<char>::char_type *, std::basic_streambuf<char>::char_type *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dde60[0m <[0;33mcol:12[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __gbeg[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dded8[0m <[0;33mcol:31[0m, [0;33mcol:42[0m> [0;33mcol:42[0m[0;1;36m __gnext[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19ddf50[0m <[0;33mcol:51[0m, [0;33mcol:62[0m> [0;33mcol:62[0m[0;1;36m __gend[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19de170[0m <[0;33mline:533:7[0m, [0;33mline:534:42[0m> [0;33mcol:7[0m[0;1;36m pbase[0m [0;32m'std::basic_streambuf<char>::char_type *() const'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19de240[0m <[0;33mline:536:7[0m, [0;33mline:537:41[0m> [0;33mcol:7[0m[0;1;36m pptr[0m [0;32m'std::basic_streambuf<char>::char_type *() const'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19de310[0m <[0;33mline:539:7[0m, [0;33mline:540:42[0m> [0;33mcol:7[0m[0;1;36m epptr[0m [0;32m'std::basic_streambuf<char>::char_type *() const'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19de450[0m <[0;33mline:549:7[0m, [0;33mline:550:43[0m> [0;33mcol:7[0m[0;1;36m pbump[0m [0;32m'void (int)'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19de3c0[0m <[0;33mcol:13[0m, [0;33mcol:17[0m> [0;33mcol:17[0m[0;1;36m __n[0m [0;32m'int'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19de6a8[0m <[0;33mline:559:7[0m, [0;33mline:564:7[0m> [0;33mline:560:7[0m[0;1;36m setp[0m [0;32m'void (std::basic_streambuf<char>::char_type *, std::basic_streambuf<char>::char_type *)'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19de518[0m <[0;33mcol:12[0m, [0;33mcol:23[0m> [0;33mcol:23[0m[0;1;36m __pbeg[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19de590[0m <[0;33mcol:31[0m, [0;33mcol:42[0m> [0;33mcol:42[0m[0;1;36m __pend[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19de850[0m <[0;33mline:580:7[0m, [0;33mline:582:9[0m> [0;33mline:581:7[0m[0;1;36m imbue[0m [0;32m'void (const std::locale &)'[0m virtual
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19de768[0m <[0;33mcol:13[0m, [0;33mcol:27[0m> [0;33mcol:27[0m[0;1;36m __loc[0m [0;32m'const std::locale &'[0m
[0;34m|   `-[0m[0;1;34mUnusedAttr[0m[0;33m 0x19de7d0[0m <[0;33mline:49:35[0m> unused
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19deb28[0m <[0;33mline:595:7[0m, [0;33mline:597:22[0m> [0;33mline:596:7[0m[0;1;36m setbuf[0m [0;32m'basic_streambuf<std::basic_streambuf<char>::char_type, std::char_traits<char>> *(std::basic_streambuf<char>::char_type *, std::streamsize)'[0m virtual
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19de9c8[0m <[0;33mcol:14[0m, [0;33mcol:23[0m> [0;33mcol:24[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dea30[0m <[0;33mcol:26[0m> [0;33mcol:36[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19ded68[0m <[0;33mline:606:7[0m, [0;33mline:609:40[0m> [0;33mline:607:7[0m[0;1;36m seekoff[0m [0;32m'std::basic_streambuf<char>::pos_type (std::basic_streambuf<char>::off_type, ios_base::seekdir, ios_base::openmode)'[0m virtual
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19debf8[0m <[0;33mcol:15[0m> [0;33mcol:23[0m [0;32m'std::basic_streambuf<char>::off_type':'long'[0m
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dec60[0m <[0;33mcol:25[0m, [0;33mcol:35[0m> [0;33mcol:42[0m [0;32m'ios_base::seekdir':'std::_Ios_Seekdir'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19decc8[0m <[0;33mline:608:8[0m, [0;33mcol:65[0m> [0;33mcol:38[0m [0;32m'ios_base::openmode':'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19def40[0m <[0;33mline:618:7[0m, [0;33mline:621:40[0m> [0;33mline:619:7[0m[0;1;36m seekpos[0m [0;32m'std::basic_streambuf<char>::pos_type (std::basic_streambuf<char>::pos_type, ios_base::openmode)'[0m virtual
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19dee40[0m <[0;33mcol:15[0m> [0;33mcol:23[0m [0;32m'std::basic_streambuf<char>::pos_type':'std::fpos<__mbstate_t>'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19deea8[0m <[0;33mline:620:8[0m, [0;33mcol:65[0m> [0;33mcol:38[0m [0;32m'ios_base::openmode':'std::_Ios_Openmode'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19df000[0m <[0;33mline:631:7[0m, [0;33mline:632:26[0m> [0;33mcol:7[0m[0;1;36m sync[0m [0;32m'int ()'[0m virtual
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19df0b0[0m <[0;33mline:653:7[0m, [0;33mline:654:31[0m> [0;33mcol:7[0m[0;1;36m showmanyc[0m [0;32m'std::streamsize ()'[0m virtual
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19df270[0m <[0;33mline:669:7[0m, [0;33mline:670:44[0m> [0;33mcol:7[0m[0;1;36m xsgetn[0m [0;32m'std::streamsize (std::basic_streambuf<char>::char_type *, std::streamsize)'[0m virtual
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19df170[0m <[0;33mcol:14[0m, [0;33mcol:25[0m> [0;33mcol:25[0m[0;1;36m __s[0m [0;32m'std::basic_streambuf<char>::char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19df1d8[0m <[0;33mcol:30[0m, [0;33mcol:41[0m> [0;33mcol:41[0m[0;1;36m __n[0m [0;32m'std::streamsize':'long'[0m
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19df350[0m <[0;33mline:691:7[0m, [0;33mline:693:36[0m> [0;33mline:692:7[0m[0;1;36m underflow[0m [0;32m'std::basic_streambuf<char>::int_type ()'[0m virtual
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19df420[0m <[0;33mline:704:7[0m, [0;33mline:716:7[0m> [0;33mline:705:7[0m[0;1;36m uflow[0m [0;32m'std::basic_streambuf<char>::int_type ()'[0m virtual
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19df5f8[0m <[0;33mline:728:7[0m, [0;33mline:730:36[0m> [0;33mline:729:7[0m[0;1;36m pbackfail[0m [0;32m'std::basic_streambuf<char>::int_type (std::basic_streambuf<char>::int_type)'[0m virtual
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19df4e0[0m <[0;33mcol:17[0m, [0;33mcol:60[0m> [0;33mcol:26[0m[0;1;36m __c[0m [0;32m'std::basic_streambuf<char>::int_type':'int'[0m
[0;34m|   `-[0m[0;1;34mUnusedAttr[0m[0;33m 0x19df548[0m <[0;33mline:49:35[0m> unused
[0;34m|-[0m[0;1;32mCXXMethodDecl[0m[0;33m 0x19df7c0[0m <[0;33mline:746:7[0m, [0;33mline:747:50[0m> [0;33mcol:7[0m[0;1;36m xsputn[0m [0;32m'std::streamsize (const std::basic_streambuf<char>::char_type *, std::streamsize)'[0m virtual
[0;34m| |-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19df6c0[0m <[0;33mcol:14[0m, [0;33mcol:31[0m> [0;33mcol:31[0m[0;1;36m __s[0m [0;32m'const std::basic_streambuf<char>::char_type *'[0m
[0;34m| `-[0m[0;1;32mParmVarDecl[0m[0;33m 0x19df728[0m <[0;33mcol:36[0m, [0;33mcol:47[0m> [0;33mcol:47[0m[0;1;36m __n[0m [0;32m'std::streamsize':'long'[0m
